{"address":"0x0223fc70574214F65813fE336D870Ac47E147fAe","coingecko_rank":849,"coingecko_score":24.076,"community_score":5.472,"description":"Reforging The Cornerstone Of The Blockchain World\nCanonChain will be triggered from the protocol layer and the chipset layer of data communications to provide a robust foundation for the entire blockchain industry.\n\nThe pursuit of inclusiveness and relative fairness is the target of CanonChain.\n\nCanonChain will be triggered from the protocol layer and the chip layer of the communication to provide a robust foundation for the entire blockchain industry.\n\nUNDERLYING PROTOCOL\nWe have established the basic protocol for the Fog Networking and implemented a new consensus mechanism via a specially designed blockchain chipset that truly fulfill the transactional capability requirements of dApps at the chip-level\n\nBUCKYBALL (FULLERENE) NETWORK\nOur Buckyball topology architecture will support the decentralized characteristics of DeOSes (Decentralized Operating Systems) and Dapps (Decentralized Applications) operations, by reaching consensus on fragmented self-autonomous network.\n\nVALUE SYSTEM BASED ON PARTICIPATION\nOperating on the main chain and application chain of CanonChain. When the blockchain and network resources are being contributed or used in different levels of applications and blockchain nodes, a standard measure is required, which is known as Xuanchi CZR.","developer_score":14.228,"id":"canonchain","image":{"large":"https://assets.coingecko.com/coins/images/5327/large/canonchain.jpg?1547040895","small":"https://assets.coingecko.com/coins/images/5327/small/canonchain.jpg?1547040895","thumb":"https://assets.coingecko.com/coins/images/5327/thumb/canonchain.jpg?1547040895"},"links":{"blockchain_site":["https://enjinx.io/eth/token/0x0223fc70574214f65813fe336d870ac47e147fae","https://etherscan.io/token/0x0223fc70574214f65813fe336d870ac47e147fae","https://ethplorer.io/address/0x0223fc70574214f65813fe336d870ac47e147fae"],"homepage":["http://www.canonchain.com/"],"repos_url":{"github":["https://github.com/canonchain/canonchain"]},"telegram_channel_identifier":"canonchainEN","twitter_screen_name":"canonchain"},"liquidity_score":24.037,"market_cap_rank":460,"name":"CanonChain","public_interest_score":27.172,"symbol":"czr","tickers":[]}