{"address":"0x039B5649A59967e3e936D7471f9c3700100Ee1ab","coingecko_rank":205,"coingecko_score":39.484,"community_score":44.003,"description":"KuCoin is an international cryptocurrency exchange based out of Hong Kong that currently supports the trading of 210 digital assets. What’s unique about KuCoin is that they share 50% of their overall trading fee revenue with users holding their exchange-based token. In a similar fashion to <a href=\"https://www.coingecko.com/en/exchanges/binance\">Binance</a>, KuCoin offers relatively low tradings fees and incentives for holding (or trading) its native cryptocurrency. Back in 2011, the founders started researching blockchain tech and went further to build the technical architecture for KuCoin in 2013. 4 years later, the exchange launched with the ultimate goal of “becoming one of the top 10 worldwide hottest exchange platform[s]” by 2019.\n\nAs stated on their official website which lists 12 core members, “Kucoin aims at providing users digital asset transaction and exchange services which are even more safe and convenient, integrating premium assets worldwide, and constructing state of the art transaction platform”. CEO and founder, Michael Gam, is a former technical expert at Ant Financial, an affiliate company of the Chinese Alibaba Group. He was also a senior partner at Internet giants like MikeCRM and KF5.COM. OO, Eric Don, is referred to as a “senior Internet researcher, systems architect, and Internet industry star”. He is also stated to be the CTO and senior partner of IT companies including YOULIN.COM, KITEME, and REINOT. However, it’s unclear if these websites actually exist as they did not show in a Google search or when entering the website domains.  According to his LinkedIn, he is currently CTO at Youlin Network Technologies, yet there is no mention of KITEME or REINOT.\n\nWith its growing user base and increasing number of cryptocurrencies being offered, KuCoin may be set up for a strong run in the markets. KuCoin Shares volume is expected to grow as the daily trading volume on KuCoin, hence, trading fees collection grows & thus, the size of dividend payout grows. This can lure investors to hold KCS token which may even increase its value. KuCoin faces stiff competition from <a href=\"https://www.coingecko.com/en/exchanges/okex\">OKEx</a>, but it expects to continue to grow its community exponentially as it is being projected to be one among the top 5 exchanges in the world.","developer_score":0.0,"id":"kucoin-shares","image":{"large":"https://assets.coingecko.com/coins/images/1047/large/kcs.png?1547034982","small":"https://assets.coingecko.com/coins/images/1047/small/kcs.png?1547034982","thumb":"https://assets.coingecko.com/coins/images/1047/thumb/kcs.png?1547034982"},"links":{"blockchain_site":["https://enjinx.io/eth/token/0x039b5649a59967e3e936d7471f9c3700100ee1ab","https://etherscan.io/token/0x039b5649a59967e3e936d7471f9c3700100ee1ab","https://ethplorer.io/address/0x039b5649a59967e3e936d7471f9c3700100ee1ab"],"homepage":["https://www.kucoin.com/#/"],"subreddit_url":"https://www.reddit.com/r/kucoin","twitter_screen_name":"kucoincom"},"liquidity_score":53.083,"market_cap_rank":46,"name":"KuCoin Shares","public_interest_score":34.072,"symbol":"kcs","tickers":[{"base":"KCS","market":{"identifier":"alterdice","name":"AlterDice"},"target":"BTC"}]}