{"address":"0x05f4a42e251f2d52b8ed15E9FEdAacFcEF1FAD27","coingecko_rank":32,"coingecko_score":58.154,"community_score":46.089,"description":"Zilliqa (ZIL) is a token developed in the year 2017. Zilliqa is mainly based on the concept of Sharding and primarily aims at improving the scalability of the cryptocurrency networks as in case of <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a> or <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a>. The white paper mentions that the transactions speed would be approximately a thousand times more than that of Ethereum network. Ziliqa is fast, secured and decentralized. Zilliqa’s high throughput means that you can focus on developing your ideas without worrying about network congestion, high transaction fees or security which are the key issues with legacy blockchain platforms.\n\nZilliqa network uses a concept called Sharding where the transactions are grouped into smaller groups and divided among the miners for the parallel transactional verification. Developing smaller groups for transactional verification means the Consensus can be reached faster and hence a higher number of transactions can be processed in a given time frame. The capacity of the network linearly increases in other cryptocurrencies as the number of people joins the network, but in this case, the capacity is increased at a higher variable rate than the number of members joining the network. By incorporating the Sharding Technology, it can completely revolutionize the smart contract functionality too.\n\nZiliqa has few pros as it has a great new technology. Zilliqa is the first platform to use sharding technology. This puts it ahead of the rest of the market. It’s a completely new kind of blockchain designed to solve the problem of scalability. Third-generation platforms like Zilliqa could be the big winners in the future of cryptocurrency. Ziliqa has a strong community. The platform has a lot of fans. The Zilliqa ICO only happened because there was so much demand for it. The Zilliqa ICO also shows that the crypto community is ready to see blockchain technology move to the next phase of its development.","developer_score":79.561,"id":"zilliqa","image":{"large":"https://assets.coingecko.com/coins/images/2687/large/Zilliqa-logo.png?1547036894","small":"https://assets.coingecko.com/coins/images/2687/small/Zilliqa-logo.png?1547036894","thumb":"https://assets.coingecko.com/coins/images/2687/thumb/Zilliqa-logo.png?1547036894"},"links":{"bitcointalk_thread_identifier":2367256,"blockchain_site":["https://enjinx.io/eth/token/0x05f4a42e251f2d52b8ed15e9fedaacfcef1fad27","https://etherscan.io/token/0x05f4a42e251f2d52b8ed15e9fedaacfcef1fad27","https://ethplorer.io/address/0x05f4a42e251f2d52b8ed15e9fedaacfcef1fad27","https://explorer.zilliqa.com","https://viewblock.io/zilliqa"],"homepage":["https://www.zilliqa.com/"],"repos_url":{"github":["https://github.com/Zilliqa/Zilliqa","https://github.com/Zilliqa/Zilliqa-JavaScript-Library","https://github.com/Zilliqa/Zilliqa-Wallet","https://github.com/Zilliqa/scilla"]},"subreddit_url":"https://www.reddit.com/r/zilliqa/","telegram_channel_identifier":"zilliqachat","twitter_screen_name":"zilliqa"},"liquidity_score":49.625,"market_cap_rank":76,"name":"Zilliqa","public_interest_score":29.495,"symbol":"zil","tickers":[{"base":"ZIL","market":{"identifier":"tokenize","name":"Tokenize"},"target":"BTC"},{"base":"ZIL","market":{"identifier":"whitebit","name":"Whitebit"},"target":"BTC"},{"base":"ZIL","market":{"identifier":"whitebit","name":"Whitebit"},"target":"ETH"},{"base":"ZIL","market":{"identifier":"whitebit","name":"Whitebit"},"target":"USDT"}]}