{"address":"0x054Ad3Cd4A66F14bF5C0De2548A53BE66995A4f6","coingecko_rank":2702,"coingecko_score":9.5,"community_score":24.296,"description":"ESTS stands for E&S Tokenised Services and ties in with an established Legal, Corporate and Business Advisory organisation, with over 10 years’ experience, 30+ employees and a steady annual revenue stream of close to $5 Million.\n\nThe ESTS initiative intends to bring the innovative concepts of Blockchain and decentralisation to the old profession of Corporate and Legal Advisory Services. By creating a link, and bridging the gap between the old, paper-dependent way of doing things, and the decentralised world of Blockchain, something new and exciting has begun. The idea of ESTS was born as a ‘Proof of Work’ concept.\n\nWhat better way to prove to clients and the community that we can launch Initial Coin Offerings (ICO) and Token related services in ways never done before? Unlike most other industries that have developed over several years, this industry is developing at an incredibly fast pace. This is mainly because the industry was able to self-finance with the introduction of ICOs.\n\nTo keep up with this ever-changing environment and remain at the forefront, as part of the ESTS Initiative, we have decided to launch our own Tokens, ESTS. Funds raised in our Private Placement will be utilised to expand our team, finance strategic acquisitions, and promote Blockchain and the crypto Economy in General.","developer_score":0.0,"id":"ests","image":{"large":"https://assets.coingecko.com/coins/images/5076/large/ests-logo.png?1547040479","small":"https://assets.coingecko.com/coins/images/5076/small/ests-logo.png?1547040479","thumb":"https://assets.coingecko.com/coins/images/5076/thumb/ests-logo.png?1547040479"},"links":{"blockchain_site":["https://etherscan.io/token/0x054ad3cd4a66f14bf5c0de2548a53be66995a4f6"],"facebook_username":"ESTSINITIATIVE","homepage":["http://www.ests.io/"],"subreddit_url":"https://www.reddit.com/r/ESTS/","twitter_screen_name":"supportestsio1 "},"liquidity_score":0.0,"market_cap_rank":5216,"name":"Ests","public_interest_score":34.261,"symbol":"ests","tickers":[]}