{"address":"0x06fA8BE9B6609D963E8fC63977B9F8DC5f10895F","coingecko_rank":738,"coingecko_score":25.358,"community_score":32.284,"description":"Loopring is an open protocol for building decentralized exchanges. Loopring has quickly gained visibility as one of the decentralized exchange options that’s making progress on trading across multiple blockchains. Loopring’s solution utilizes ring transactions and order matching to facilitate asset exchanges. Essentially, it aggregates the order books of other exchanges. This allows any exchange, decentralized or centralized, to utilize Loopring’s protocol to match orders. Part of providing an open protocol is remaining blockchain agnostic. Hence, the first <a href=\"https://www.coingecko.com/en/coins/loopring\">Loopring token (LRC)</a> was launched on <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a>, but it also plans to launch <a href=\"https://www.coingecko.com/en/coins/loopring-neo\">Loopring NEO (LRN)</a> and Loopring QTUM (LRQ).\n\nThe plans to launch Loopring NEO are coming along. The distribution of the new tokens, LRN, has already begun. Essentially, the token distribution involves two phases: an investor sale and an airdrop. This guide will look at both phases, how to buy LRN, and what to expect from Loopring NEO.\n\nThe big selling point of Loopring’s exchange solution is you never have to deposit funds to Loopring. With most exchanges, even other decentralized exchanges, you still have to transfer funds to their wallets. On Loopring, you can keep your funds in your own private wallet when trading.\n\nOf course, that creates a challenge for Loopring because the exchange no longer controls the wallet and that means smart contracts need to do the work of verifying that transactions are legitimate and confirmed. When a trade occurs, it happens user to user, with no middleman. Loopring finds the match and coordinates the terms of the trade, but it never controls the assets.\n\nLoopring is one of the first projects to attempt launching across multiple blockchain ecosystems. This experiment is interesting and exciting. It also has the potential to be lucrative if Loopring continues to increase in value.","developer_score":57.998,"id":"loopring-neo","image":{"large":"https://assets.coingecko.com/coins/images/4064/large/2693.png?1547039210","small":"https://assets.coingecko.com/coins/images/4064/small/2693.png?1547039210","thumb":"https://assets.coingecko.com/coins/images/4064/thumb/2693.png?1547039210"},"links":{"announcement_url":["https://medium.com/loopring-protocol/"],"blockchain_site":["https://neotracker.io/asset/06fa8be9b6609d963e8fc63977b9f8dc5f10895f"],"homepage":["https://loopring.org"],"repos_url":{"github":["https://github.com/Loopring/protocol"]},"subreddit_url":"https://www.reddit.com/r/loopring/","telegram_channel_identifier":"loopringorg","twitter_screen_name":"loopringorg"},"liquidity_score":1.0,"market_cap_rank":3443,"name":"Loopring [NEO]","public_interest_score":25.873,"symbol":"lrn","tickers":[{"base":"LRN","market":{"identifier":"switcheo","name":"Switcheo"},"target":"NEO"}]}