{"address":"0x0775C81A273B355e6a5b76e240BF708701F00279","coingecko_rank":1206,"coingecko_score":19.8,"community_score":30.705,"description":"Bulleon is not just another digital asset service, it will be a product combination with a massive amount of high skilled labor input. Bulleon is a Universal digital asset platform, which is also aimed at building a strong, concept-driven currency that offers the chance to see profits and gains considerably snappier and can take benefits out more effortlessly. Bulleon will provide customer user-friendly tools to satisfy his all the digital resource needs and help comfortably navigate the crypto world. The customer only needs to focus on his own business, not its technical difficulties.\nAbout Bulleon\nThe purpose of the product is to provide end users with the everyday digital asset related services from a single place, it is a service that will significantly facilitate online affairs. Bulleon as a currency is a shareholder’s certificate with voting rights and the right to receive dividends from Bulleon’s operating income. Our strategy to make Bulleon mighty and respectable is simple and unique on the crypto-market. Our goal is to create a practical digital asset service concept, make it safe, user-friendly, clear and simply attractive.\nBulleon will provide consumers with user-friendly tools they require to handle all of the digital resource needs and navigate the crypto world easily - by focusing on business operations.\nIt is a Universal digital asset platform, which includes, among other things, the following services:\n- Digital asset exchange\n- Biometric hardware wallet & login authentication\n- International Debit card\n- E-Commerce payment gateway for Merchants\n- Peer2Peer Lending platform\n- Cloud mining platform\nBulleon ICO is also decentralized. While most other ICOs sell their cheapest shares/tokens to the major investors, venture capitals, and angels, Bulleon has a vision of decentralization of tokens. Tokens are available to anyone willing to participate in early phase funding. Bulleon is distributing the power and opportunities regardless of the size of contribution from investors.\nWe are inviting all the investors to participate in the initial stages of the ICO. It is an opportunity to make higher ROI regardless of the investment you seed in the project.\nThe ICO is open to all participants from the early stages, as we usher in the new era of decentralized ICOs.","developer_score":0.0,"id":"bulleon","image":{"large":"https://assets.coingecko.com/coins/images/3145/large/7mpDR_n6_400x400.jpg?1548257068","small":"https://assets.coingecko.com/coins/images/3145/small/7mpDR_n6_400x400.jpg?1548257068","thumb":"https://assets.coingecko.com/coins/images/3145/thumb/7mpDR_n6_400x400.jpg?1548257068"},"links":{"bitcointalk_thread_identifier":2704639,"blockchain_site":["https://etherscan.io/token/0x0775c81a273b355e6a5b76e240bf708701f00279","https://ethplorer.io/address/0x0775c81a273b355e6a5b76e240bf708701f00279"],"facebook_username":"bulleon.net","homepage":["http://bulleon.io/"],"repos_url":{"github":["https://github.com/Bulleon/contract"]},"subreddit_url":"https://www.reddit.com/r/Bulleon","telegram_channel_identifier":"bulleon_official","twitter_screen_name":"Bulleon_net"},"liquidity_score":1.0,"market_cap_rank":1523,"name":"Bulleon","public_interest_score":39.162,"symbol":"bul","tickers":[{"base":"BUL","market":{"identifier":"crex24","name":"CREX24"},"target":"BTC"},{"base":"BUL","market":{"identifier":"stocks_exchange","name":"STEX"},"target":"ETH"}]}