{"address":"0x0AbdAce70D3790235af448C88547603b945604ea","coingecko_rank":143,"coingecko_score":42.783,"community_score":43.205,"description":"The district0x network is a collective of decentralized and autonomous marketplaces and communities, also known as districts. These districts are built upon a decentralized and distributed open-source framework, the d0xINFRA network, which is powered by Ethereum smart contracts. The district0x network aims at creating a friction-free, virtual economy where the users will be able to make buying and selling decisions, complete transactions, and even rank their peers with just one simple click. District0x aims to develop a flexible, and free market with advanced entrepreneurial concepts.\n\nThe District0x infrastructure has a very neat concept with some well-outlined features, such as the staking interface. A staking interface is put in place that allows DNT holders to have open control over the districts through an Aragon governance layer for all markets that come online. Post creation of a district, an Aragon entity will also be created that people can use to interact with this staking mechanism. After staking a user will receive voting rights in that district.  Using the creation interface, one can remove central power structures from any marketplace without the additional need for development or programming skills. It can be described as the WordPress of dApps where the districts being launched are like wordpress templates and the auxiliary modules are WordPress plugins for extended functionality.\n\nWhile it is very difficult to buy lesser known cryptocurrencies using fiat currencies (dollars, euros) directly from crypto-exchanges, district0x or DNT can be easily purchased from various exchanges using <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> or <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a> as the base cryptocoin. <a href=\"https://www.coingecko.com/en/exchanges/binance\">Binance</a> is one of the popular exchange platforms that can help trade Bitcoin or Ethereum for District0x. One can use various wallets like myetherwallet.com to store the district0x (DNT) coins. Coinbase, Blockchain, Exodus, <a href=\"https://www.coingecko.com/buzz/trezor-model-t-wallet-review?locale=en\">Trezor Hardware Wallet</a> are also wallets that supports district0x.\n\nDistrict0x, differs from most coins in its underlying concept and the architecture it is built on. The concept of interconnected districts and marketplaces promises a novel structure to the modern economies. What a lot of users are missing out on is the fact that it is a staking mechanism and not just a voting token. Staking is basically the process of mining the PoS (proof of stake) coins. Early investors will be able to lock their tokens to a specific district on the network, thus being able to participate in its governance later. DNT tokens can be staked in districts, thus they not only give voting power and privileges within that district but also provide district-specific tokens depending on when the investor had started trading. For example, early investors of the PoS token will be able to make decisions about the distribution of profits among stakeholders, the intricacies of the business model etc. DNT can basically be considered as a dynamic stock in the future district0x ecosystem.\n\nBy joining the district0x, the user receives district0x coins. They allow the owner to exercise the right to vote for district proposals and make decisions within certain districts. This includes, for example, voting on proposals concerning the future of a particular district or setting fees. The scope of shareholders’ rights is outlined in the bylaws and varies according to the specific scope and purpose of each district. District0x platform users can interact with the functions and services provided by each district. Users can also freely create their own districts. For example, on Ethlance, the first district in the District0x network, users can post job offers or search for new jobs.","developer_score":51.836,"id":"district0x","image":{"large":"https://assets.coingecko.com/coins/images/849/large/district0x.png?1547223762","small":"https://assets.coingecko.com/coins/images/849/small/district0x.png?1547223762","thumb":"https://assets.coingecko.com/coins/images/849/thumb/district0x.png?1547223762"},"links":{"bitcointalk_thread_identifier":2009966,"blockchain_site":["https://enjinx.io/eth/token/0x0abdace70d3790235af448c88547603b945604ea","https://etherscan.io/token/0x0abdace70d3790235af448c88547603b945604ea","https://ethplorer.io/address/0x0abdace70d3790235af448c88547603b945604ea"],"homepage":["https://district0x.io/"],"repos_url":{"github":["https://github.com/district0x/name-bazaar"]},"subreddit_url":"https://www.reddit.com/r/district0x","twitter_screen_name":"district0x"},"liquidity_score":22.704,"market_cap_rank":410,"name":"district0x","public_interest_score":26.716,"symbol":"dnt","tickers":[{"base":"DNT","market":{"identifier":"abcc","name":"ABCC"},"target":"BTC"},{"base":"DNT","market":{"identifier":"bittrex","name":"Bittrex"},"target":"BTC"},{"base":"DNT","market":{"identifier":"upbit","name":"Upbit"},"target":"BTC"}]}