{"address":"0x0bC61DdED5F6710c637cf8288Eb6058766ce1921","coingecko_rank":1518,"coingecko_score":18.476,"community_score":9.211,"description":"Coinsuper would like to announce our platform token — CEN (Coinsuper Ecosystem Network)’s issuance and our plan to set up “Coinsuper Club”, i.e., the Global Advisor Association. All the CEN holders own the privilege for premium projects subscription.\n\nCEN (“Coinsuper Ecosystem Network”) is Coinsuper’s platform token. It is based on the ERC-20 token standard and has a total supply of 1 billion tokens, with no further issuance. Coinsuper is committed to building a world-class cryptocurrency exchange that drives mainstream and institutional adoption of digital assets. Coinsuper’s unique expertise in traditional finance, combined with its technical and operational excellence, makes it uniquely qualified to achieve this goal.\nCEN will serve as Coinsuper’s platform token and power a robust cryptocurrency ecosystem that is comprised of the Coinsuper exchange, a network of global crypto investors, top crypto investment funds, regulatory authorities and blockchain innovation labs. Together, this ecosystem will advance the growth of cryptocurrency and strengthen industry regulation and governance.\n\nCoinsuper has always been committed to creating a compliant and safe trading platform for premium blockchain projects, so as to provide global users more opportunities to participate through CEN. With the establishment of Coinsuper Club, Coinsuper will invite world-class blockchain investors and consultants who consistently refer premium blockchain projects to the platform.\n\nCEN holders and Coinsuper Club members would enjoy the benefits including:\n\na. All CEN holders on the platform can get the opportunities and discounts for early participation in premium projects subscriptions;\nb. The platform will also give premium project tokens away to CEN holders on an irregular basis;\nc. Club members would enjoy the priority to get a certain share of premium projects;\n\nCurrently, the first batch Coinsuper Club members including Pantera Capital, 8 Decimal Capital, Node Capital, Blockwater Capital and Connect Capital have been invited to join.","developer_score":0.0,"id":"coinsuper-ecosystem-network","image":{"large":"https://assets.coingecko.com/coins/images/5215/large/coinsuper-ecosystem-network-token-logo.png?1547040682","small":"https://assets.coingecko.com/coins/images/5215/small/coinsuper-ecosystem-network-token-logo.png?1547040682","thumb":"https://assets.coingecko.com/coins/images/5215/thumb/coinsuper-ecosystem-network-token-logo.png?1547040682"},"links":{"announcement_url":["https://medium.com/@coinsuper"],"blockchain_site":["https://enjinx.io/eth/token/0x0bc61dded5f6710c637cf8288eb6058766ce1921","https://etherscan.io/token/0x0bc61dded5f6710c637cf8288eb6058766ce1921","https://ethplorer.io/address/0x0bc61dded5f6710c637cf8288eb6058766ce1921"],"homepage":["https://www.coinsuper.com/","https://www.coinsuper.com/cen"],"twitter_screen_name":"Coinsuper_OFCL"},"liquidity_score":17.915,"market_cap_rank":1270,"name":"Coinsuper Ecosystem Network","public_interest_score":36.078,"symbol":"cen","tickers":[]}