{"address":"0x0B4C2708F052dca413600e237675e4d6778A9375","coingecko_rank":3731,"coingecko_score":6.102,"community_score":9.445,"description":"CoinClaim is an automated redemption (bounty) system for companies to use their tokens in marketing campaigns during ICO, post-ICO and post exchange listing.\n\nCoinClaim attracts a large user-base of internet users looking to earn free tokens for promoting brands.\n\nCompanies create automated marketing campaigns in the company Dashboard. They decide which tasks need to be completed and how many of their tokens to award users. The system calculates the amount of company tokens required for the campaign and tokens are automatically added to the user’s wallet when the campaign is complete.\n\nIn addition to company tokens, users are also awarded CoinClaim (CLM) tokens for completing tasks such as logging in daily and weekly, completing company CoinClaims, birthdays, holidays and more. CLM tokens are also available to non-crypto companies who want to promote their brands to the crypto community through CoinClaim. They can buy CLM on the exchange and give them away as bounty to users who promote them.\n\nCoinClaim gives companies access to a growing set of reporting tools to measure ROI of their crypto marketing efforts.\n\nCoinClaim increases brand awareness and adds value to a company’s token on exchanges.","developer_score":0.0,"id":"coinclaim","image":{"large":"https://assets.coingecko.com/coins/images/6687/large/coinclaim.jpg?1547042891","small":"https://assets.coingecko.com/coins/images/6687/small/coinclaim.jpg?1547042891","thumb":"https://assets.coingecko.com/coins/images/6687/thumb/coinclaim.jpg?1547042891"},"links":{"blockchain_site":["https://etherscan.io/token/0x0b4c2708f052dca413600e237675e4d6778a9375"],"facebook_username":"coinclm","homepage":["https://coinclaim.io/"],"telegram_channel_identifier":"coinclm","twitter_screen_name":"coin_claim"},"liquidity_score":5.688,"market_cap_rank":3648,"name":"CoinClaim","public_interest_score":26.033,"symbol":"clm","tickers":[]}