{"address":"0x0db03B6CDe0B2d427C64a04FeAfd825938368f1F","coingecko_rank":4168,"coingecko_score":5.262,"community_score":7.781,"description":"Opiria is a global decentralized marketplace powered by blockchain that helps companies with collecting and analyzing consumer data and enables them make better business decisions. Consumers are in full control of their data, their data privacy is fully protected and they are paid by companies with PDATA tokens for sharing their data. PDATA Token is the currency that expresses the value of personal data and enables its trading by using smart contracts on the blockchain. Opiria is a real company since 2015 with a working product used by hundreds of customers globally including many Fortune500 companies such as BMW, Audi, Mercedes, Volkswagen, GM, Nissan, P&G and Intel.\n\nOpiria is solving one of biggest problems companies worldwide are having. Companies worldwide desperately need personal data from consumers to understand their needs and requirements in order to design products and services that fuel desire as well as perfectly target marketing and sales activities. Because of a lack in understanding consumer´s needs and requirements 70-80% of new product innovations fail what leads to billions of failed investments every year. Today personal data is stolen from consumers by data brokers without their knowledge or consent and sold for big money. The annual revenue of the data brokerage business is 250 billion USD per year and is growing with 13% every year on average…while consumers are getting nothing! Opiria´s mission is to change that and give back control to the consumer while cutting out the middlemen!","developer_score":0.0,"id":"pdata","image":{"large":"https://assets.coingecko.com/coins/images/3052/large/personal-data-marketplace.jpg?1556866760","small":"https://assets.coingecko.com/coins/images/3052/small/personal-data-marketplace.jpg?1556866760","thumb":"https://assets.coingecko.com/coins/images/3052/thumb/personal-data-marketplace.jpg?1556866760"},"links":{"announcement_url":["https://medium.com/pdata-token"],"bitcointalk_thread_identifier":3076122,"blockchain_site":["https://etherscan.io/token/0x0db03b6cde0b2d427c64a04feafd825938368f1f"],"facebook_username":"pdatatoken","homepage":["https://www.opiria.io"],"telegram_channel_identifier":"pdatatoken","twitter_screen_name":"PDATA_Token"},"liquidity_score":1.0,"market_cap_rank":5468,"name":"PDATA","public_interest_score":31.164,"symbol":"pdata","tickers":[{"base":"PDATA","market":{"identifier":"exmarkets","name":"ExMarkets"},"target":"BTC"},{"base":"PDATA","market":{"identifier":"tokenize","name":"Tokenize"},"target":"BTC"}]}