{"address":"0x0d16450D347c12C086d6C94c76c5Aaac35eA07E0","coingecko_rank":2130,"coingecko_score":9.314,"community_score":11.993,"description":"Digital Gold is a blockchain-based project, designed to encourage the digitalization of the financial markets, and their afferent investment instruments. It hopes to achieve this by enabling users to purchase coverage in physical gold, via the ERC-20 Ethereum-based GOLD token.\nThe project holds numerous advantages for its users, the gold market, but also for blockchain technology as a whole.\nWith this in mind, customers can use the platform to instantly purchase the GOLD token, each coin being equal to one gram of 99.99% FINE gold that is stored in the company’s vaults. As such, the tokens enable users to indirectly use gold to make monetary transactions, or to leverage it as a wealth storage method. This is achieved without requiring users to follow complicated procedures.\nThe token is pegged to the value of the gold spot price, thus also acting as a stablecoin. This makes it useful for protecting against market volatility on the cryptocurrency market, while also allowing users to benefit off long-term gold price uptrends.\nLiquidity is ensured at all times, granted that independent live audits can be verified to cross-check the number of tokens in circulation, with the amount of vault-stored gold.\nThe digitalization of gold is bound to also increase the worldwide appeal of the precious metal, which has been sought for and used by mankind for thousands of years. The cross-implementation between gold and blockchain technology serves as yet another successful use case scenario, showcasing blockchain’s potential in revolutionizing the financial market.\nSpeaking of blockchain, its application in the Digital Gold project allows for several innovative features, including, but not limited to: instant, low-cost transactions carried out via the Ethereum blockchain, immutability for all confirmed transactions (no chargeback risk), overall network security and protection from cyber-attacks, smart contract functionality (propping an instant gold purchase for each token bought), market transparency, support for all ERC- 20 wallets, and support for trading the GOLD token on partner exchanges.\nThe GOLD token community can utilize the Digital Gold Marketplace to instantly purchase and/or sale the token. As the parent company is also a liquidity supplier, users are free to carry out as many transactions as they wish, with no additional costs apart from the yearly service fee and the general ‘gas’ cost for Ethereum-based transactions.\nThe Digital Gold project is not an Initial Coin Offering, as no crowdfunding effort is being carried out. All operations are self-funded, thus any acquisition of the GOLD token results in an instantaneous smart contract-based purchase of physical gold.\nThe worldwide interest in the gold market is well-known, whereas the value of gold Exchange-Traded Funds (ETFs) exceeds the $100 billion threshold. With the GOLD token, the precious metal can now be more than a wealth storage method and investment tool. With the help of blockchain, gold can now act as a payment method for transactions of all types.","developer_score":0.0,"id":"digital-gold-token","image":{"large":"https://assets.coingecko.com/coins/images/9785/large/x_Kwc_Vg_400x400_%281%29.png?1571871690","small":"https://assets.coingecko.com/coins/images/9785/small/x_Kwc_Vg_400x400_%281%29.png?1571871690","thumb":"https://assets.coingecko.com/coins/images/9785/thumb/x_Kwc_Vg_400x400_%281%29.png?1571871690"},"links":{"announcement_url":["https://medium.com/@digitalgoldcoin"],"bitcointalk_thread_identifier":5161544,"blockchain_site":["https://etherscan.io/token/0x0d16450d347c12c086d6c94c76c5aaac35ea07e0","https://ethplorer.io/address/0x0d16450d347c12c086d6c94c76c5aaac35ea07e0"],"homepage":["https://gold.storage/"],"subreddit_url":"https://www.reddit.com/r/golderc20/","telegram_channel_identifier":"digitalgoldcoin","twitter_screen_name":"gold_erc20"},"liquidity_score":33.379,"market_cap_rank":null,"name":"Digital Gold Token","public_interest_score":0.002,"symbol":"gold","tickers":[{"base":"GOLD","market":{"identifier":"livecoin","name":"Livecoin"},"target":"ETH"},{"base":"GOLD","market":{"identifier":"livecoin","name":"Livecoin"},"target":"USDT"}]}