{"address":"0x0EE815F8BE0B0259E2657C8b8d1E57Bd3D60F26b","coingecko_rank":6478,"coingecko_score":0.2,"community_score":0.0,"description":"Harmony Block Capital (referred to as HBC for short) is a tokenized crypto hedge fund. It borrows and adopts the structure of a distributed autonomous organization (DAO for short) and is a decentralized autonomous fund (DAF). Harmony Block Capital uses tokens and smart contracts to participate in financial management. The fund's position information, transaction records, investment portfolios and asset curves are all integrated into the crypto audit system. It is open and transparent to accept inquiries and supervision by fund holders and the public. The assets will be recorded on the Ethereum blockchain. Fund holders can participate in the management of Harmony Block Capital through the holders' meeting according to their TRUST shares (1TRUST represents 1 voting right), so as to achieve maximum autonomy in the operation of distributed autonomous funds.\n\nTRUST Token (referred to as TRUST) is a token based on Ethereum's ERC20 standard. It is a tokenized fund share. 1TRUST stands for 1 fund share. TRUST is a negotiable community governance and equity certification certificate. It is used for fund profit distribution, net value calculation of fund unit, share equity transfer and circulation, community governance, and payment and settlement of fund operating costs.\n\nTRUST is not an ICO, because TRUST and ETH are circulated and exchanged in both directions through subscription pledges and redemptions. TRUST exchange ETH price is completely determined by fund performance, there is no room for speculation.","developer_score":0.0,"id":"trust","image":{"large":"https://assets.coingecko.com/coins/images/10402/large/trust.PNG?1578951769","small":"https://assets.coingecko.com/coins/images/10402/small/trust.PNG?1578951769","thumb":"https://assets.coingecko.com/coins/images/10402/thumb/trust.PNG?1578951769"},"links":{"blockchain_site":["https://etherscan.io/token/0x0EE815F8BE0B0259E2657C8b8d1E57Bd3D60F26b"],"homepage":["https://www.swhyfund.com/"]},"liquidity_score":1.0,"market_cap_rank":6151,"name":"Harmony Block Capital","public_interest_score":0.0,"symbol":"trust","tickers":[]}