{"address":"0x1410434b0346f5bE678d0FB554E5c7ab620f8f4a","coingecko_rank":931,"coingecko_score":24.145,"community_score":7.248,"description":"BITKAN as an App serving cryptocurrency users and integrating market, information, mining monitoring and wallet, it provides four language versions, namely Chinese, English, Russian and Japanese. Now it has more than 5 million users from 170 countries around the world.\n\nBITKAN provides quotations and candlestick charts of more than 2,200 kinds of cryptocurrencies from more than 50 major cryptocurrency exchanges around the world. It has achieved News cooperation with more than 70 international media. The daily news updates are over 300, and the daily reads of the News section are over 500 thousand. BITKAN provides wallet services for digital asset transfer, such as BTC, BCH, DASH, ETH, SAFE, and it has provided stable and secure wallet service for the assets of 170,000 users.\n\nThe team will launch the first blockchain-concentrated community around the blockchain industry based on the BITKAN platform: K Site. The community will encourage users to produce high-quality contents, and users can get profits in the form of cryptocurrencies by publishing high-quality contents.\n\nThe communities created by users in the community will be presented in the form of \"K Site\". The creators can set up the \"K Site\" to pay for admission or join for free. By composing high-quality contents, it can attract other users to join in and form their own \"K Sites\". Users having joined in can read the contents of the \"circle\" or post their own content in the \"circle\". On the other hand, users can also set a certain content for paid reading, the more people who read, the greater the income. Users can also reward the content to encourage the author to continue to compose more and better content.\n\nKAN will be used to pay for the platform services of BITKAN. If a user keeps sufficient amount of KAN will enjoy a certain percentage discount for service fees, and service fees will be deducted from KAN.\n\nThe main project team comes from BITKAN, which currently provides price monitoring, news and information, mining monitoring, wallet and other services for cryptocurrencies. Users can store cryptocurrencies simply, conveniently and safely through the BITKAN app. At the same time, they can check the market price of cryptocurrencies of major exchanges in real time, get timely and fresh industry information at home and abroad, and set up price reminders by BITKAN app. And it has real-time mining monitoring, which allows you to master the running condition of the mining machine whenever and wherever possible.\n\nThe token is called \"KAN\". A strict limit of 10 billion KAN will be issued, and will never be increased.  KAN will be issued according to the Ethereum ERC 20 standard. KAN's profit comes mainly from the payment fees, exchange fees and membership service fees from the BITKAN platform.\n\nBITKAN is already online. The team is currently developing the \"K Site\" feature which is a decentralized crytocurrency-concentrated & content payment community. KAN will be online as the same time as the \"K Site\" feature, which is scheduled in May 2018.","developer_score":0.0,"id":"kan","image":{"large":"https://assets.coingecko.com/coins/images/4651/large/kan-token.png?1547039917","small":"https://assets.coingecko.com/coins/images/4651/small/kan-token.png?1547039917","thumb":"https://assets.coingecko.com/coins/images/4651/thumb/kan-token.png?1547039917"},"links":{"blockchain_site":["https://enjinx.io/eth/token/0x1410434b0346f5be678d0fb554e5c7ab620f8f4a","https://etherscan.io/token/0x1410434b0346f5be678d0fb554e5c7ab620f8f4a","https://ethplorer.io/address/0x1410434b0346f5be678d0fb554e5c7ab620f8f4a"],"homepage":["http://kan.land/","http://www.bitkan.com/"],"telegram_channel_identifier":"BitKan","twitter_screen_name":"BitKanOfficial"},"liquidity_score":34.251,"market_cap_rank":156,"name":"BitKan","public_interest_score":24.638,"symbol":"kan","tickers":[{"base":"KAN","market":{"identifier":"exx","name":"EXX"},"target":"CNYT"},{"base":"KAN","market":{"identifier":"okex","name":"OKEx"},"target":"OKB"}]}