{"address":"0x155E5E7C77274CA7a1c58236326518CC948daad6","coingecko_rank":5448,"coingecko_score":3.349,"community_score":0.0,"description":"he Attractive Force Gene is committed to creating the world's first distributed storage network system that provides genetic data and individual health data, and establishing a centralized storage and ecological application platform for genomic data and health big data.\n\nThe platform construction is divided into three stages of five years to complete the overall project development and ecological system construction, so as to form a set of accurate ecological closed loop of big health data, and thus form a big health ecological community with autonomy jointly built by global community users.\n\nCommunity users are encouraged to share genome and health data in this ecosystem through the Token mechanism of pass-through economy, and a large number of analysis reports based on individualized data of service providers in the health care industry are obtained. At the same time, sufficient data support and use interfaces are provided for research institutions, pharmaceutical factories and medical institutions.\n\nHospitals, chronic disease management agencies, health consulting service providers and others can use the Attractive Force Gene chain system to realize the development and application of DApp. With the permission of users, these applications will provide users with a variety of personalized and accurate health services based on the genome and health data. At the same time, distributed storage and encryption technology are used to solve data privacy and security problems. By deconstructing the division of labor in the industry, a new ecology centering on users and involving sequencing providers, service providers and project parties will be formed. As a digital asset in the ecology, health big data flows in medical treatment, health, scientific research and other fields, allowing individuals to gain benefits from digital assets while accelerating the exploration of life and health and benefiting human society.","developer_score":0.0,"id":"attractive-force-gene","image":{"large":"https://assets.coingecko.com/coins/images/7531/large/Screenshot_2019-01-23_at_4.01.54_PM.png?1548230606","small":"https://assets.coingecko.com/coins/images/7531/small/Screenshot_2019-01-23_at_4.01.54_PM.png?1548230606","thumb":"https://assets.coingecko.com/coins/images/7531/thumb/Screenshot_2019-01-23_at_4.01.54_PM.png?1548230606"},"links":{"blockchain_site":["https://etherscan.io/token/0x155e5e7c77274ca7a1c58236326518cc948daad6"],"homepage":["http://www.afgene.co/"],"twitter_screen_name":"ForceGene"},"liquidity_score":0.0,"market_cap_rank":3061,"name":"AFG Token","public_interest_score":33.491,"symbol":"afg","tickers":[]}