{"address":"0x16c4672C614FA107972427Db6f5fb165583B8fbC","coingecko_rank":4517,"coingecko_score":4.748,"community_score":6.608,"description":"The Brave Sound Platform by Sound Blockchain Technology (SBT) is a software development and management company focused on creating blockchain based technology, smart contract design, and digital tokenized applications. Brave Sound Platform primary mission is to solve creators rights and royalty transparency issues of the entertainment industry. In addition, the establishment of our Brave Sound Token (BRST) products to enable ecosystems the ability to incentivize all the stakeholders in the creation, discovery, and sharing and using of entertainment including creators and curators. We envision a network effect caused from the creation of a fully incentivized ecosystem that rewards all the participants.\n\nWe hope that the Brave Sound community will act as a catalyst in the application and practical utility of the BRST to demonstrate, build and grow the community.\n\nIn a time where access to resources, materials or otherwise, is becoming increasingly egalitarian, we see access to curated content and appropriate compensation, as no different. Brave Sound is trying to create the first international entertainment database for entertainment creations by redefining the future of entertainment rights and royalty transparency on the blockchain. While Brave Sound is seeking to revolutionize the way entertainment content is being distributed and made available, Brave Sound vision intertwines them with the power and efficiency of cryptography, decentralization, and immutability.","developer_score":0.0,"id":"brave-sound-token","image":{"large":"https://assets.coingecko.com/coins/images/8529/large/5cc82bbf839e0.png?1559111688","small":"https://assets.coingecko.com/coins/images/8529/small/5cc82bbf839e0.png?1559111688","thumb":"https://assets.coingecko.com/coins/images/8529/thumb/5cc82bbf839e0.png?1559111688"},"links":{"blockchain_site":["https://etherscan.io/token/0x16c4672c614fa107972427db6f5fb165583b8fbc"],"homepage":["https://sg.bravesound.io/"],"telegram_channel_identifier":"bravesoundtoken","twitter_screen_name":"bravesoundtoken"},"liquidity_score":1.0,"market_cap_rank":2143,"name":"Brave Sound Token","public_interest_score":28.958,"symbol":"brst","tickers":[{"base":"BRST","market":{"identifier":"biki","name":"Biki"},"target":"BTC"}]}