{"address":"0x168296bb09e24A88805CB9c33356536B980D3fC5","coingecko_rank":126,"coingecko_score":44.29,"community_score":37.629,"description":"RChain is a fundamentally new blockchain platform rooted in a formal model of concurrent and decentralized computation. The RChain Cooperative is leveraging that model through correct-by-construction software development to produce a concurrent, compositional, and massively scalable blockchain. he industry has spoken, the blockchain platforms of today, and as they are currently built, are not fit for scale or speed, they continue to lack security and they are not designed for the masses in the developer community. We have all heard of the problems within the ever expanding blockchain space. The fact that scalability isn’t just the giant elephant in the room, it’s that elephant that hastaken over the room. They are slow. Security – one needs to look no further than the recent events of not just (Initial Coin Offerings) ICO’s being hacked but exchanges, wallets and entire systems as well. The blockchain space is not for everyone - there a limited few developers in the world today that can build upon any of the existing blockchains.\n\nGreg is the founder and visionary behind RChain, with a tremendous passion for mathematics and over 30 years of high level experience driving innovative technology projects. Greg is the Co-founder, President and Member of the Board of Directors of The RChain Cooperative. Previously he was the Principal Architect of Microsoft's BizTalk Process Orchestration, Principal Architect of Microsoft's Highwire offering as well as Principal Architect of ATM Network management solution for ATT/NCR and Co- designer and developer of MCC's Rosette/ESS technology. No discussion about Greg would be complete without mentioning his unwavering passion/devotion (understatement) to the environment. he Co-op is the organization that develops the open-source RChain platform software. It’s an open and community-driven initiative with multiple communication channels through which all are welcome to participate. The Co-op is dependent on participation from its members. This will be crucial for governance, innovation and adoption.\n\nRhain has cooperatively <a href=\"https://www.coingecko.com/en/ico/rchain\">sold $15 million</a> worth of RHOC (valued at $0.20 each at the time) during its sale. The current iteration of RChain RHOC is an ERC-20 token on the Ethereum blockchain. Once the RChain mainnet launches (tentatively scheduled for the end of 2018), RHOC tokens will convert to REV tokens at a 1:1 ratio. The tokens are used to compensate node operators for computing and storing system contracts, along with bandwidth resources. They’re also a staking currency used for consensus and validator bonding.","developer_score":78.895,"id":"rchain","image":{"large":"https://assets.coingecko.com/coins/images/985/large/rchain-logo.png?1547034877","small":"https://assets.coingecko.com/coins/images/985/small/rchain-logo.png?1547034877","thumb":"https://assets.coingecko.com/coins/images/985/thumb/rchain-logo.png?1547034877"},"links":{"bitcointalk_thread_identifier":1747033,"blockchain_site":["https://enjinx.io/eth/token/0x168296bb09e24a88805cb9c33356536b980d3fc5","https://etherscan.io/token/0x168296bb09e24a88805cb9c33356536b980d3fc5","https://ethplorer.io/address/0x168296bb09e24a88805cb9c33356536b980d3fc5"],"homepage":["https://www.rchain.coop/"],"repos_url":{"github":["https://github.com/rchain/rchain"]},"subreddit_url":"https://www.reddit.com/r/RChain","twitter_screen_name":"rchain_coop"},"liquidity_score":1.0,"market_cap_rank":230,"name":"RChain","public_interest_score":25.733,"symbol":"rhoc","tickers":[{"base":"ROC","market":{"identifier":"bamboo_relay","name":"Bamboo Relay"},"target":"WETH"},{"base":"RHOC","market":{"identifier":"bilaxy","name":"Bilaxy"},"target":"ETH"},{"base":"RHOC","market":{"identifier":"hotbit","name":"Hotbit"},"target":"ETH"},{"base":"RHOC","market":{"identifier":"thetokenstore","name":"Token.Store"},"target":"ETH"}]}