{"address":"0x1602af2C782cC03F9241992E243290Fccf73Bb13","coingecko_rank":1580,"coingecko_score":13.836,"community_score":19.479,"description":"QUBITICA is a community of more than 1000 developers, IT companies and investors from over 20 nations who want to work together to advance blockchain technology. This community has developed the QUBITICA infrastructure and since May 2018 it has been working on new projects under the associated brands and websites. Subcontracting is organized within the community. This requires the holding of QBIT, the paticipation shares in QUBITICA and all related projects.\n\nA long-term goal of QUBITICA is the development of project-related Smart Contract Solutions. These projects are treated as independent tasks and subprojects advertised individually. This allows us to achieve a flexible pipeline adapted to the needs of the market.\n\nThe general developments in Blockchain will grow disproportionately, which is why it is the right time to find an intelligent solution to accomplish these tasks.\n\nWhat sets QUBITICA apart from an IT company operating in this field? QUBITICA is not an IT company, but an association of like-minded developers, IT companies and investors. IT projects will be handled under future brands and websites, and QUBITICA will be responsible for exchanging ideas, prioritizing projects and managing the shares in QUBITICA.\n\nQUBITICA's QBIT is an ERC-20 token that honors achievements. This honor is also comparable to shares. Developers receive QBIT for the implementation of projects and thus a share in the assets of the platform. A developer becomes, so to speak, a miner of shares through the power of his programming. He can now keep this QBIT, which represents his share of the overall project, or exchange it for Ether or USD / Euro. The mining of QBIT as part of the development of QUBITICA itself is no longer possible. This process is complete.\n\nQBIT is also the unit through which investors can acquire shares in the projects. To do this, buy QBIT either from the developers, any holder or via the platform. A purchase on exchanges is of course also possible. For new projects under other brands, the introduction of additional tokens is possible. QBIT holders automatically receive shares in this token upon issue.","developer_score":28.128,"id":"qubitica","image":{"large":"https://assets.coingecko.com/coins/images/5803/large/qubitica.png?1547041673","small":"https://assets.coingecko.com/coins/images/5803/small/qubitica.png?1547041673","thumb":"https://assets.coingecko.com/coins/images/5803/thumb/qubitica.png?1547041673"},"links":{"blockchain_site":["https://etherscan.io/token/0x1602af2c782cc03f9241992e243290fccf73bb13","https://ethplorer.io/address/0x1602af2c782cc03f9241992e243290fccf73bb13"],"facebook_username":"Qubitica","homepage":["https://www.qubitica.net/"],"repos_url":{"github":["https://github.com/dantak2000/qubitica"]},"subreddit_url":"https://www.reddit.com/r/Qubitica/","twitter_screen_name":"Qubitica"},"liquidity_score":12.592,"market_cap_rank":null,"name":"Qubitica","public_interest_score":0.0,"symbol":"qbit","tickers":[{"base":"QBIT","market":{"identifier":"sistemkoin","name":"Sistemkoin"},"target":"ETH"}]}