{"address":"0x17f8aFB63DfcDcC90ebE6e84F060Cc306A98257D","coingecko_rank":1050,"coingecko_score":23.108,"community_score":12.411,"description":"Nebula AI is a decentralized blockchain integrated with Artificial Intelligence and sharing economies. With the Nebula blockchain, developers can deploy their Artificial Intelligence applications easily on a blockchain platform. The integrated API/SDK and payment services allow the developers to earn revenue based on the AI smart contract. Nebula AI also allows the GPU miners to contribute their GPU hash power to AI computing power which allow for a variety of AI applications. This invention allows Nebula AI to compete with the pricing of Amazon and Google cloud computing services.\n\nThe blockchain technology provides a digital trust mechanism for human beings which enhances the efficiency of value exchange and reduces costs, the genuinely credible and efficient Internet of Value is approaching. In recent years, many breakthroughs have been made in the field of artificial intelligence, and artificial intelligence has now penetrated every corner of human society and will become an essential cornerstone of change in human society.\n\nNebula AI is committed to building a decentralized artificial intelligence computing blockchain (NBAI) that reduces the energy costs of traditional Proof of Work by converting GPU mining machines into AI computing services.The AI transactions recorded on NBAI will be irreversible. The distributed computing network also ensures high concurrency and low latency computing power. The conversion of GPU mining machines makes it possible to provide more cost-effective artificial intelligence services.\n\nNebula AI will cooperate with large-scale third-party Internet data centers to provide adequate computing power for AI computing. Nebula AI has established an artificial intelligence training centre in Canada. System-based quantitative finance, image identification and other blockchain applications are also in development.\n\nThe well-developed NBAI ecosystem integrates the top-level applications such as DAI App, scientific research and application, university education, and the bottom-level of NBAI blockchain, Artificial Intelligence Mining Machine and Artificial Intelligence Data Center. The innovative economic model of NBAI ecosystem is the realization of a complete set of value-added economic systems.","developer_score":28.417,"id":"nebula-ai","image":{"large":"https://assets.coingecko.com/coins/images/3341/large/logo-2.png?1547037951","small":"https://assets.coingecko.com/coins/images/3341/small/logo-2.png?1547037951","thumb":"https://assets.coingecko.com/coins/images/3341/thumb/logo-2.png?1547037951"},"links":{"bitcointalk_thread_identifier":2928531,"blockchain_site":["https://enjinx.io/eth/token/0x17f8afb63dfcdcc90ebe6e84f060cc306a98257d","https://etherscan.io/token/0x17f8afb63dfcdcc90ebe6e84f060cc306a98257d","https://ethplorer.io/address/0x17f8afb63dfcdcc90ebe6e84f060cc306a98257d"],"facebook_username":"NebulaAI","homepage":["https://www.nebula-ai.com/"],"repos_url":{"github":["https://github.com/nebulaai/quantum-web"]},"telegram_channel_identifier":"NebulaAICommunity","twitter_screen_name":"nebula_ai"},"liquidity_score":1.0,"market_cap_rank":1015,"name":"Nebula AI","public_interest_score":27.887,"symbol":"nbai","tickers":[]}