{"address":"0x17e67d1CB4e349B9CA4Bc3e17C7DF2a397A7BB64","coingecko_rank":1049,"coingecko_score":21.226,"community_score":23.535,"description":"Freyrchain devotes itself to building the first blockchain-based collection authentication platform worldwide. This platform intends to create a decentralized digital repository platform of culture and art works for art enthusiasts to help their growth.\nFreyrchain aims to build the first platform based on blockchain and big data of culture in the world. Currently a world-class blockchain collection database app has been developed to provide access to information, historical transaction and collection records of a certain item as well as ancillary authentication information support for the whole industry.\nMost of our team members have working experience in art collection industry and be aware of the problems in this industry. They are striving to change the current situation of this industry and re-shape its structure by using the sufficient resources support provided by us.\nFreyrchain has the biggest physical Chinese art library and the biggest collection database in the world, covering almost all known published Chinese art books and records worldwide, of which the One Thousand Character Primer of Huai Su’s Calligraphy Reproduced by Yu Zijun in 1470 (Ming Xianzong's 6th year of reign) is the earliest digital data while The Complete Works of William Shakespeare of 1593 and the Pictures of Ancient Jades of 1752 are the earliest physical records. This database can provide collection enthusiasts with abundant collection information, including transfer, authentication and value change of collections and provide them with more complete information on transfer and maximize the value of art collections.","developer_score":12.0,"id":"freyrchain","image":{"large":"https://assets.coingecko.com/coins/images/4301/large/freyrchain.png?1548126583","small":"https://assets.coingecko.com/coins/images/4301/small/freyrchain.png?1548126583","thumb":"https://assets.coingecko.com/coins/images/4301/thumb/freyrchain.png?1548126583"},"links":{"announcement_url":["http://www.freyrchain.org/en/news/","https://medium.com/@freyrchain"],"bitcointalk_thread_identifier":3240704,"blockchain_site":["https://enjinx.io/eth/token/0x17e67d1cb4e349b9ca4bc3e17c7df2a397a7bb64","https://etherscan.io/token/0x17e67d1cb4e349b9ca4bc3e17c7df2a397a7bb64","https://ethplorer.io/address/0x17e67d1cb4e349b9ca4bc3e17c7df2a397a7bb64"],"homepage":["http://www.freyrchain.org/index.html"],"repos_url":{"github":["https://github.com/Freyrchain/FREC"]},"subreddit_url":"https://www.reddit.com/r/Freyrchain/","telegram_channel_identifier":"Freyrchain_Official","twitter_screen_name":"freyrchain"},"liquidity_score":1.0,"market_cap_rank":1065,"name":"Freyrchain","public_interest_score":24.209,"symbol":"frec","tickers":[{"base":"FREC","market":{"identifier":"zgtop","name":"ZG.TOP"},"target":"USDT"}]}