{"address":"0x170b275CEd089FffAEBFe927F445a350ED9160DC","coingecko_rank":1072,"coingecko_score":20.874,"community_score":7.937,"description":"Owndata is the World’s ultimate blockchain based data exchange platform. Owndata is a crypto marketplace for data sellers and buyers. You can earn money as tokens by using our platform to share your data. Owndata provides sophisticated tools for sharing and managing the data with the targeted platform / user base.\n\nHow Owndata Works?\n1. Collection of Data\nSite Owners/Editors have to sign up and get a Owndata user account in order to register their websites to OwnData Blockchain Platform. Owndata generates a unique pixel code (unique cookie) for each website in return. The addition of this unique cookie to a web site, immediately enables the collection of visitors’ data.\n\n2. Segmentation & Profilisation of Data\nThanks to the user-friendly interface, Owndata users can flexibly segment the collected visitors’ data however they (or the buyer) would like to take. Besides, it also allows the users to integrate their own algorithm for a deeper profilisation & retargeting. Such a flexibility paves the way to automatically tokenize and sell the segmented data to buyers on the OwnData exchange platform.\n\nOwndata is for content owners, website owners and editors, application developers, advertisers, publishers, data suppliers, data exchanges, ad networks, DSPs, DMPs and more!\n\n1. Digital Advertisement - Digital advertising includes promotional advertisements and messages delivered through email, social media websites, online advertising on search engines, banner ads on mobile or Web sites and affiliates programs.\n\n2. TV Ads - Television advertisements have the advantage of sight, sound, movement and colour to persuade a customer to buy from you. They are particularly useful if you need to demonstrate how your product or service works.\n\n3. Print Ads - If an advertisement is printed on paper, be it newspapers, magazines, newsletters, booklets, flyers, direct mail, or anything else that would be considered a portable printed medium, then it usually comes under the banner of print advertising\n\n4. Near Future - Owndata plans to use data exchange not only on Digital, Media or Print platforms, but on all of the platforms that needs data, such as Telecommunications, Textile, Medical, etc...","developer_score":27.492,"id":"owndata","image":{"large":"https://assets.coingecko.com/coins/images/3903/large/owndata.png?1548330403","small":"https://assets.coingecko.com/coins/images/3903/small/owndata.png?1548330403","thumb":"https://assets.coingecko.com/coins/images/3903/thumb/owndata.png?1548330403"},"links":{"announcement_url":["https://medium.com/@owndata","https://steemit.com/@owndata"],"bitcointalk_thread_identifier":2996349,"blockchain_site":["https://etherscan.io/address/0x170b275ced089fffaebfe927f445a350ed9160dc","https://etherscan.io/token/0x170b275ced089fffaebfe927f445a350ed9160dc"],"facebook_username":"owndata","homepage":["https://owndata.network"],"repos_url":{"github":["https://github.com/owndata/owndata-token"]},"telegram_channel_identifier":"owndata_network","twitter_screen_name":"owndata_coin"},"liquidity_score":1.0,"market_cap_rank":1088,"name":"OWNDATA","public_interest_score":24.357,"symbol":"own","tickers":[{"base":"OWN","market":{"identifier":"crex24","name":"CREX24"},"target":"BTC"}]}