{"address":"0x1b93ADEBFF40cC36F0E2B97A427c7Bc52edaA552","coingecko_rank":5307,"coingecko_score":3.332,"community_score":0.0,"description":"With the emergence of Bitcoin, cryptocurrency has erupted into a global currency market. The market cap of all the cryptocurrencies in December of 2017 was $610 Billion Dollars passing even the online giant Amazon which recorded global record sales of $573 Billion. \n\nAs the cryptocurrency market grows, financial institutions will need to cater to these needs and give individuals a way to manage their money and store it in a safe and friendly environment. Hence, CROBA Bank has been following the cryptocurrency market ever since its emergence and have been planning and developing the needs of individuals and businesses.\n\nCurrently, there are over 35 million crypto wallets with over 12 million active daily users from statistics of the University of Cambridge. Cryptocurrencies have received legal status around the world including and not limited to: South Korea, Japan, Singapore, Hong Kong, Czech Republic, Gibraltar, Cyprus, Estonia, Belarus, Poland, Armenia, Germany and others. \n\nThese growing needs are inevitable and CROBA Bank will be there to service the world. If the predictions are correct about cryptocurrencies, cryptocurrencies will replace fiat money significantly in the course of time. Thus, we have a goal to provide Crypto banking services to the world.","developer_score":0.0,"id":"croba","image":{"large":"https://assets.coingecko.com/coins/images/8957/large/croba.PNG?1563230590","small":"https://assets.coingecko.com/coins/images/8957/small/croba.PNG?1563230590","thumb":"https://assets.coingecko.com/coins/images/8957/thumb/croba.PNG?1563230590"},"links":{"blockchain_site":["https://etherscan.io/token/0x1b93adebff40cc36f0e2b97a427c7bc52edaa552"],"homepage":["https://croba.io/"],"telegram_channel_identifier":"crobacoinkr"},"liquidity_score":0.49,"market_cap_rank":5232,"name":"Croba","public_interest_score":32.337,"symbol":"croba","tickers":[]}