{"address":"0x1b793E49237758dBD8b752AFC9Eb4b329d5Da016","coingecko_rank":247,"coingecko_score":36.603,"community_score":0.0,"description":"VITE - A Next Generation High-performance Decentralized Application Platform\n\nDAG Ledger\nTransactions in Vite are grouped by accounts. That is, each transaction only changes the state of one single account. Send transactions are separated from receive transactions, thereby obviating the need to wait for a transfer to be complete before the initiation of another transaction. The hierarchical design of the consensus algorithm allows horizontal scalability in consensus groups.\n\nAsynchronous Architecture\nVite splits transactions into transaction pairs according to a \"request-response\" pattern. The writing and verification of transactions are asynchronously decoupled, thereby supporting ultra-high throughput. Inter-contract communications are based on an asynchronous messaging model.\n\nReactive Contract\nMessage-Driven\nWith an event-driven architecture, every smart contract is viewed as an independent service. Contracts communicate via messages without sharing state.\n\nSolidity++\nSolidity++’s syntax is compatible with most of that of Solidity. The new syntax supports asynchronous semantics, contract scheduling, and provides a series of standard libraries, such as string manipulation, floating-point operations, basic mathematical operations, containers, sorting, and so on.\n\nIntegrated Decentralized Ecosystem\nEnd-to-end system for value transfer\nVite itself is a decentralized exchange that supports digital asset issuance, cross-chain value transmission, and inter-token transactions based on the Loopring protocol. A quota-based resource allocation mechanism allows light users to pay zero fees and gas. Users can obtain computing resources in multiple ways. Vite also supports quota leasing.\n\ndApp Mini Programs\nThe Vite client features an engine for creating HTML5-based decentralized mini programs. This engine simplifies the process of dApp development and deployment.","developer_score":69.645,"id":"vite","image":{"large":"https://assets.coingecko.com/coins/images/4513/large/Vite.png?1558014583","small":"https://assets.coingecko.com/coins/images/4513/small/Vite.png?1558014583","thumb":"https://assets.coingecko.com/coins/images/4513/thumb/Vite.png?1558014583"},"links":{"bitcointalk_thread_identifier":4438416,"blockchain_site":["https://enjinx.io/eth/token/0x1b793e49237758dbd8b752afc9eb4b329d5da016","https://etherscan.io/token/0x1b793E49237758dBD8b752AFC9Eb4b329d5Da016","https://ethplorer.io/address/0x1b793e49237758dbd8b752afc9eb4b329d5da016"],"chat_url":["https://discordapp.com/invite/CsVY76q"],"homepage":["https://www.vite.org/"],"repos_url":{"github":["https://github.com/vitelabs/go-vite"]},"telegram_channel_identifier":"vite_en"},"liquidity_score":26.681,"market_cap_rank":651,"name":"Vite","public_interest_score":30.134,"symbol":"vite","tickers":[{"base":"VITE","market":{"identifier":"bittrex","name":"Bittrex"},"target":"BTC"},{"base":"VITE","market":{"identifier":"upbit","name":"Upbit"},"target":"BTC"},{"base":"VITE","market":{"identifier":"upbit_indonesia","name":"Upbit Indonesia "},"target":"BTC"}]}