{"address":"0x1C62aCa2b7605Db3606eAcdA7Bc67A1857DDb8FF","coingecko_rank":1536,"coingecko_score":17.202,"community_score":14.108,"description":"Just like blockchain itself, we are fair, just and transparent. We are not another freaking ICO and we do not want to promise the world and then deliver a speck of dust.\n\nHaving a rich background in blockchain development, we believe we are more than competent to bring you alternate solutions to help connect people who want to participate in the world of music and earn, both as creatives and fans.\n\nWe want you to succeed and we want everyone to be treated according to what they deserve. We take pride in our forward-thinking and celebrate progress. We are Soniq, a project where collaboration and fair play aren’t mere concepts, but the norm. We promise to do one simple, yet awesome thing: provide the world of music with something no one else has ever come up with - a real-world blockchain use case with all the benefits it brings - transparency, security, geographic independence.\n\nHave you ever wondered why music middle management professionals charge so much for their services? So have we, and we have no idea. Without dealing with the hows, whats and whys of the current state of the music industry, we’ve decided to take our project down the path of blockchain.\n\nTThrough blockchain, we want to make sure that you earn automatically and instantly for your contribution and the value you’re contributing, without a price tag set by corporate business people. People take the music industry for granted - we are here to change that.","developer_score":12.0,"id":"soniq","image":{"large":"https://assets.coingecko.com/coins/images/5793/large/soniq.png?1548609864","small":"https://assets.coingecko.com/coins/images/5793/small/soniq.png?1548609864","thumb":"https://assets.coingecko.com/coins/images/5793/thumb/soniq.png?1548609864"},"links":{"bitcointalk_thread_identifier":3795734,"blockchain_site":["https://enjinx.io/eth/token/0x1c62aca2b7605db3606eacda7bc67a1857ddb8ff","https://etherscan.io/token/0x1c62aca2b7605db3606eacda7bc67a1857ddb8ff","https://ethplorer.io/address/0x1c62aca2b7605db3606eacda7bc67a1857ddb8ff"],"chat_url":["https://discordapp.com/invite/p2tSgMC","https://medium.com/soniq-blog"],"facebook_username":"soniqproject","homepage":["https://soniqproject.com/"],"repos_url":{"github":["https://github.com/soniqproject/smart-contracts"]},"subreddit_url":"https://www.reddit.com/r/soniq/","telegram_channel_identifier":"soniqproject","twitter_screen_name":"soniqproject"},"liquidity_score":1.0,"market_cap_rank":1453,"name":"Soniq","public_interest_score":24.426,"symbol":"soniq","tickers":[]}