{"address":"0x1C289a12A8552B314D0d153d6991fd27a54Aa640","coingecko_rank":399,"coingecko_score":33.324,"community_score":30.843,"description":"The native digital cryptographically-secured utility token of BitMax (BTMX) is a major component of the ecosystem on BitMax, and is designed to be used solely as the primary token on the platform. BTMX will initially be issued by the Distributor as ERC-20 standard compliant digital tokens on the Ethereum blockchain.\n\nBTMX is a non-refundable functional utility token which will be used as the unit of exchange between participants on BitMax. The goal of introducing BTMX is to provide a convenient and secure mode of payment and settlement between participants who interact within the ecosystem on BitMax. BTMX does not in any way represent any shareholding, participation, right, title, or interest in the Foundation, the Distributor its affiliates, or any other company, enterprise or undertaking, nor will BMAX entitle token holders to any promise of fees, dividends, revenue, profits or investment returns, and are not intended to constitute securities in Singapore or any relevant jurisdiction. BTMX may only be utilised on BitMax, and ownership of BTMX carries no rights, express or implied, other than the right to use BTMX as a means to enable usage of and interaction within BitMax.\n\nBTMX would also function as the economic incentive to incentivise users to participate in the BitMax ecosystem. Users of BitMax and/or holders of BTMX which did not actively participate will not receive any BTMX incentives.\n\nThe Distributor which issues and sells BTMX shall be an affiliate of the Foundation. The limit of 10 billion BMAX is strictly imposed without any further increase.\n\nThe users can obtain BTMX through the \"Trading Mining\" model and are eligible to receive BTMX incentives based on the trade volume of their user account. BTMX can also be purchased on the exchange under the pairs of BTMX /BTC, BTMX /USDT.","developer_score":0.0,"id":"bmax","image":{"large":"https://assets.coingecko.com/coins/images/5003/large/BTMX.jpg?1547040429","small":"https://assets.coingecko.com/coins/images/5003/small/BTMX.jpg?1547040429","thumb":"https://assets.coingecko.com/coins/images/5003/thumb/BTMX.jpg?1547040429"},"links":{"announcement_url":["https://medium.com/bitmax-io"],"blockchain_site":["https://enjinx.io/eth/token/0x1c289a12a8552b314d0d153d6991fd27a54aa640","https://etherscan.io/token/0x1c289a12a8552b314d0d153d6991fd27a54aa640","https://ethplorer.io/address/0x1c289a12a8552b314d0d153d6991fd27a54aa640"],"homepage":["https://bitmax.io/#/home"],"subreddit_url":"https://www.reddit.com/r/BitMax/","telegram_channel_identifier":"BitMaxioEnglishOfficial","twitter_screen_name":"BitMax_Official"},"liquidity_score":44.859,"market_cap_rank":77,"name":"Bitmax Token","public_interest_score":26.572,"symbol":"btmx","tickers":[]}