{"address":"0x1e258Ca7CCa4513a219E2E0d0Dd29E2888b3BA4b","coingecko_rank":5954,"coingecko_score":2.597,"community_score":0.0,"description":"BDEX is a new generation of decentralized multi-mechanism cross-chain exchange that was invested and developed by BCEX Global in early stage. BDEX will apply cross-chain agreements, smart contracts, and matching mechanisms to complete order matching and transactions. At the same time, BDEX uses a variety of cross-chain mechanisms to complete decentralized transactions to meet various needs of users, including decentralized asset exchanges, real-time settlement across exchanges, and inter-industry cross-ledger asset exchanges. BDE (BDEX COIN) will help users and project parties better adapt to the transitions from centralized to decentralized cross-chain of transactions.BDE has three attributes:\n\nUniversal Tokens of BCEX Global Trading Zone:  BCEX Global users who hold BDE can obtain many rights such as transaction fee reduction and dividends in the global trading zone, and project partners’ airdrops. In the future, more and more exchanges will be launched into the BDEX Global Trading Zone, forming the BDEX decentralized global cross-chain trading network.\n\nBDEX preferred listing channel: Project parties obtain the qualification of listing on the BDEX trading platform by pledging and destroying a certain amount or proportion of BDE.\n\nOriginal token of BDEX underlying public chain: BDEX underlying public chain adopts multi-layer and multi-chain architecture with integrated relay chains/parallel chains and POS consensus mechanism. BDE will be used as node mining reward or transaction fees.","developer_score":0.0,"id":"bdex-coin","image":{"large":"https://assets.coingecko.com/coins/images/8746/large/bde_coin.png?1560838586","small":"https://assets.coingecko.com/coins/images/8746/small/bde_coin.png?1560838586","thumb":"https://assets.coingecko.com/coins/images/8746/thumb/bde_coin.png?1560838586"},"links":{"blockchain_site":["https://etherscan.io/token/0x1e258ca7cca4513a219e2e0d0dd29e2888b3ba4b"],"homepage":["https://www.bdex.global/"]},"liquidity_score":1.0,"market_cap_rank":4188,"name":"BDEX COIN","public_interest_score":23.969,"symbol":"bde","tickers":[]}