{"address":"0x1E26b3D07E57F453caE30F7DDd2f945f5bF3EF33","coingecko_rank":1014,"coingecko_score":23.083,"community_score":33.931,"description":"ClearCoin is a technology company that powers the real-time buying and selling of media on decentralized applications and the broader digital environment. In 2017, the cryptocurrency economy added hundreds of billions of dollars of market capitalization. In the next ten years, the cryptocurrency economy could add trillions of dollars of market capitalization. This emerging industry has produced new decentralized applications, platforms, and distributed blockchain ledgers. New media opportunities have arisen as a result of the mainstream adoption of blockchain. Blockchain has gained acceptance because its distributed ledger technology solved the double spending problem for digital currencies. Blockchain solves similar problems for supply chains. ClearCoin works with the supply chain of the $563 billion media and advertising industry. ClearCoin (CLR) tokens power its distributed ledger blockchain technology that can improve the supply chain of the rapidly growing media and advertising industry. ClearCoin’s solutions increase efficiencies and reduce the reported $16 billion of annual ad fraud.\n\nA Vision Powered By The Token\nWith The ClearVision Dashboard Powered By The ClearCoin Token, you can easily execute media buys using our programmatic Omni-Channel Dashboard that features major publishers like Facebook, Google, Instagram, and Display Ads pulled from the top supply sources in the industry. Launch highly targeted campaigns using our advanced AI + ML Cohort, Demographic, and Sentiment tools. Our anonymized user data created using the ClearCoin SmartProfile Framework connects with the Geometric ClearCoin SmartStone Ledger, allowing you to track ad inventory with Next-Generation Blockchain Technology.\n\nAn App Built With Imagination\nAnalytics that go with you when you leave the office. Campaigns that move with you and provide a breath of clarity when you need it most. Track all the key data points in the blink of an eye with The ClearVision App for iOS & Android. Receive customized notifications that change based on your team’s behavior. Get the right message sent to you when your key data points change and be on the lookout for exciting new insights that our platform can find.","developer_score":12.679,"id":"clearcoin","image":{"large":"https://assets.coingecko.com/coins/images/3646/large/clearcoin.png?1547038608","small":"https://assets.coingecko.com/coins/images/3646/small/clearcoin.png?1547038608","thumb":"https://assets.coingecko.com/coins/images/3646/thumb/clearcoin.png?1547038608"},"links":{"bitcointalk_thread_identifier":2710499,"blockchain_site":["https://enjinx.io/eth/token/0x1e26b3d07e57f453cae30f7ddd2f945f5bf3ef33","https://etherscan.io/token/0x1E26b3D07E57F453caE30F7DDd2f945f5bF3EF33","https://ethplorer.io/address/0x1e26b3d07e57f453cae30f7ddd2f945f5bf3ef33"],"facebook_username":"ClearCoin","homepage":["https://clearcoin.co/"],"official_forum_url":["https://clearcoin.co/blog/"],"repos_url":{"github":["https://github.com/clearcoin/cljs-web3","https://github.com/clearcoin/go-ethereum","https://github.com/clearcoin/web3j"]},"subreddit_url":"https://www.reddit.com/r/ClearCoin/","telegram_channel_identifier":"ClearCoin","twitter_screen_name":"clearcoinHQ"},"liquidity_score":1.0,"market_cap_rank":1388,"name":"ClearCoin","public_interest_score":26.982,"symbol":"xclr","tickers":[{"base":"XCLR","market":{"identifier":"hitbtc","name":"HitBTC"},"target":"BTC"}]}