{"address":"0x1F573D6Fb3F13d689FF844B4cE37794d79a7FF1C","coingecko_rank":76,"coingecko_score":51.212,"community_score":42.266,"description":"Bancor is a blockchain protocol that allows users to convert between different tokens directly as opposed to exchanging them on cryptocurrency markets. The project offers a network, which we’ll discuss soon, that works to bring liquidity to the majority of tokens that lack a consistent supply/demand in exchanges. That network is built on smart contracts and a new class of cryptocurrencies that the team calls “Smart Tokens.” Bancor is looking to provide support to the illiquidity that currently exists within the cryptocurrency market. Illiquidity isn’t so much an issue for top coins like <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a> or <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> because there are always buyers and sellers looking to exchange those coins. It is definitely an issue, however, for the thousands of other tokens that may serve legitimate decentralized purposes but haven’t attracted enough attention in the market to be liquid.\n\nBancor’s protocol uses smart contracts to create Smart Tokens, which serve as an alternative mechanism for trading. A key characteristic of the protocol is that it doesn’t call for an exchange of tokens with a second party, as in the case of cryptocurrency exchanges. Rather, it employs Smart Tokens to convert between different ERC-20 tokens internally. These conversions take place through the blockchain’s protocol and completely outside of cryptocurrency exchanges. Smart Tokens process token conversions internally by holding reserves of other ERC20 tokens within their Smart Contract. They can then convert back and forth between those reserves as users request it.\n\nThe Bancor team consists of a core Foundation Council and their Advisory Board. The Foundation Council includes four individuals based out of Zug, Switzerland. Bernard Lietaer is a Belgian civil engineer, economist, author, and professor. Lietaer specialized in monetary systems and promotes the notion of communities creating their own local currencies. Guy Benartzi serves as co-founder and is recognized for founding the gaming company, Mytopia. Benartzi also co-founded Particle Code, a development studio based in Tel Aviv, Israel. Guido Schmitz-Krummacher is an executive of the Bancor Protocol foundation that’s involved with a variety of commercial entrepreneurial ventures in Switzerland. His involvement in the crypto space includes that of Bancor as well as an executive position in crowdfunding network, <a href=\"https://www.coingecko.com/en/coins/tezos\">Tezos (XTZ)</a>.\n\nOne of the key elements of the Bancor Network is the automated pricing. This comes from the Smart Tokens’ built-in automated market makers. These automated market makers mean that the tokens’ smart contracts always buy or sell Smart Tokens from or to any user in exchange for any connector token (as well as any token found in the network). The price comes from the Bancor Formula. This formula that is responsible for balancing a Smart Token’s demand and supply while also maintaining the ratio between the token’s total value with the connector token balances. The creator of the Smart Token configures these ratios, known as the connector weight. The creator can adjust them with the goal of decreasing or increasing the liquidity level of the token. The connector weight indicates price sensitivity, or how much sells and buys affect the price movement. Any time the prices no longer syncs with prices listed on external exchanges, the arbitrageurs will quickly balance the gaps.\"","developer_score":64.478,"id":"bancor","image":{"large":"https://assets.coingecko.com/coins/images/736/large/bancor.png?1547034477","small":"https://assets.coingecko.com/coins/images/736/small/bancor.png?1547034477","thumb":"https://assets.coingecko.com/coins/images/736/thumb/bancor.png?1547034477"},"links":{"bitcointalk_thread_identifier":1789222,"blockchain_site":["https://enjinx.io/eth/token/0x1f573d6fb3f13d689ff844b4ce37794d79a7ff1c","https://etherscan.io/token/0x1f573d6fb3f13d689ff844b4ce37794d79a7ff1c","https://ethplorer.io/address/0x1f573d6fb3f13d689ff844b4ce37794d79a7ff1c"],"facebook_username":"bancor","homepage":["https://www.bancor.network/"],"official_forum_url":["https://blog.bancor.network/"],"repos_url":{"github":["https://github.com/bancorprotocol/contracts","https://github.com/bancorprotocol/contracts_eos"]},"subreddit_url":"https://www.reddit.com/r/Bancor","telegram_channel_identifier":"bancor","twitter_screen_name":"BancorNetwork"},"liquidity_score":39.319,"market_cap_rank":113,"name":"Bancor Network Token","public_interest_score":30.672,"symbol":"bnt","tickers":[]}