{"address":"0x20F7A3DdF244dc9299975b4Da1C39F8D5D75f05A","coingecko_rank":975,"coingecko_score":22.023,"community_score":24.119,"description":"Sapien is a Web 3.0 Social News Platform that will reward millions of content creators, fight fake news & share ad revenue with its users.\n\nKey To The Sapien Network\nThe SPN token is required to access the Sapien network. But don’t worry! It doesn’t cost you anything to use the platform - a user simply has to hold the tokens. By staking tokens, a user gets access to voting, commenting, and posting on the platform. This is also creates the “something-at-stake” design of Sapien that will help combat trolls, bots, and fake news on the platform.\n\nPower a Tokenize Marketplace\nSapien users will have access to exclusive physical and virtual goods that are purchasable with the SPN token. The marketplace will be closely integrated with the Sapien social platform. Our goal is to create a reputation-based market for user-to-user content, services, and platform features. With Sapien, you can directly subscribe to your favorite podcaster and pay with SPN tokens.\n\nReward Valuable Content\nSapien wants to reward the TRUE value creators in any social network: the users! The SPN token will be used to reward creators and curators who create high quality, original content in their communities. Using reputation-based consensus, a community can determine whether a user’s post or comment is valuable. Users can also use SPN to tip one another for quality content\n\nShape a Social Network\nUnlike other social networks, users will finally have a voice via our proposal system, where they can vote on feature development and the direction of the platform. Sapien will enable user communities to self-govern and decide what is the best for their community. This is your social network. Find out more about how we are using the blockchain to accomplish these goals.\n\nOwn Your Social Data\nAny data you share on Sapien will be transparently visible for you to control. By default, no user data will be collected and no advertisements will be shown. However, if users opt in, Sapien can tokenize user data and let users earn rewards in SPN tokens for sharing their data with advertisers.\n\nEmpower Developers\nKnow how to code? Sapien will launch a developer platform powered by SPN to offer users app integrations and permit external businesses to build on the Sapien platform. The developer platform will enable developers to earn SPN tokens for creating valuable features and applications desired by the community. Developers will be able to take advantage of our extensive reputation system and make purchases with the SPN token. Follow our Github page to stay up-to-date with developments","developer_score":13.578,"id":"sapien","image":{"large":"https://assets.coingecko.com/coins/images/2596/large/sapien.png?1548608738","small":"https://assets.coingecko.com/coins/images/2596/small/sapien.png?1548608738","thumb":"https://assets.coingecko.com/coins/images/2596/thumb/sapien.png?1548608738"},"links":{"announcement_url":["https://blog.sapien.network/"],"bitcointalk_thread_identifier":2739033,"blockchain_site":["https://enjinx.io/eth/token/0x20f7a3ddf244dc9299975b4da1c39f8d5d75f05a","https://etherscan.io/token/0x20f7a3ddf244dc9299975b4da1c39f8d5d75f05a","https://ethplorer.io/address/0x20f7a3ddf244dc9299975b4da1c39f8d5d75f05a"],"facebook_username":"sapien.network","homepage":["https://www.sapien.network/"],"repos_url":{"github":["https://github.com/SapienNetwork/module-boilerplate"]},"subreddit_url":"https://www.reddit.com/r/sapien/","telegram_channel_identifier":"SapienNetwork","twitter_screen_name":"sapien_network"},"liquidity_score":0.0,"market_cap_rank":824,"name":"Sapien","public_interest_score":25.306,"symbol":"spn","tickers":[{"base":"SPN","market":{"identifier":"idex","name":"Idex"},"target":"ETH"}]}