{"address":"0x217375Af2De10C73F94408c3258a956DF106ba98","coingecko_rank":5045,"coingecko_score":3.94,"community_score":0.0,"description":"Knowledge.io is a blockchain powered knowledge sharing platform which enables consumers and experts to prove their knowledge in many areas of expertise, and earn tokens which can be redeemed for real-life rewards. The platform also contains the Q&Ads Knowledge Score Targeting enabling marketers and advertisers to target advertising at real people who have proven expertise in their areas, avoiding many issues prevalent with adtech today.\n\nKnowledge.io began as a concept for rewarding and celebrating knowledge. Everyone pos- sesses knowledge, and is shaped through their individual life experiences, but opportunities to share, showcase, and receive the bene t of one’s own knowledge can be scarce for most people. Knowledge.io introduces a platform to applaud and reward users for sharing their knowledge. Knowledge.io proposes a platform that will enable its participants to attain an immediate reward and validation through gami ed learning, veri cation of expertise, and cutting-edge ad tech based technology. Knowledge.io is a multifaceted platform with for- ward thinking crypto technology, creating a user centric approach to information gathering and persona building. Knowledge.io proposes a new frontier in knowledge tracking, veri ca- tion and validation, and through using reward and incentive models detailed below, attains high levels of engagement.","developer_score":0.0,"id":"knowledge","image":{"large":"https://assets.coingecko.com/coins/images/4872/large/knowledge-ico-logo.jpg?1547040288","small":"https://assets.coingecko.com/coins/images/4872/small/knowledge-ico-logo.jpg?1547040288","thumb":"https://assets.coingecko.com/coins/images/4872/thumb/knowledge-ico-logo.jpg?1547040288"},"links":{"announcement_url":["https://medium.com/knowledgeio"],"blockchain_site":["https://etherscan.io/token/0x217375af2de10c73f94408c3258a956df106ba98"],"homepage":["https://knowledge.io"]},"liquidity_score":0.0,"market_cap_rank":3389,"name":"Knowledge","public_interest_score":39.404,"symbol":"knw","tickers":[]}