{"address":"0x218f1De2Ea9AE3e9FDEa347b6E707EbfdA2D6233","coingecko_rank":1949,"coingecko_score":14.249,"community_score":4.725,"description":"m+plus project takes advantage of the decentralization, trustworthiness, collective maintenance and reliable database of blockchain, aiming at the opaque, centralization operation, difficulty in distinguishing true from false, trust and other industrial pain points of the traceability chain and the counterfeiting of medical drugs.\n\nIt will open up the traditional centralized information island, realize the business and data sharing under the premise of information security and confidentiality, and avoid the serious economic loss caused by the non-sharing and non-trust of data.\n\nIt makes use of the trading information of blockchain ledger to realize the tracing industry chain of pharmaceuticals. During the circulation process of medical drugs supply chain, in the m+plus project system, the important information of each link of the supply chain will be confirmed by signature and recorded in the chain after the identification of the third-party information.\n\nIt includes the procedures of drug production, component manufacturing, pharmaceutical principles, warehousing acceptance, storage, drug maintenance, stock picking, drug review and batch number adjustment.\nIt is the nuts and bolts of medicine circulation in the market. All data are safe and reliable and cannot be tampered with. In case of disputes, it is easy to trace, which ensures the safety and reliability of the ultimate trace of medical drugs in the whole supply chain and thus ensures the safety of medical drugs.","developer_score":0.0,"id":"m-plus","image":{"large":"https://assets.coingecko.com/coins/images/9068/large/-1HQ3mZq_400x400.jpg?1563951907","small":"https://assets.coingecko.com/coins/images/9068/small/-1HQ3mZq_400x400.jpg?1563951907","thumb":"https://assets.coingecko.com/coins/images/9068/thumb/-1HQ3mZq_400x400.jpg?1563951907"},"links":{"blockchain_site":["https://etherscan.io/token/0x218f1de2ea9ae3e9fdea347b6e707ebfda2d6233"],"facebook_username":"mpluscoin","homepage":["https://mplusproject.com/"],"twitter_screen_name":"mplus_project"},"liquidity_score":44.646,"market_cap_rank":2378,"name":"M+Plus","public_interest_score":41.385,"symbol":"mpl","tickers":[]}