{"address":"0x224bb81EdE0922a82d529125a095E5Ab0c0c4d5e","coingecko_rank":3567,"coingecko_score":7.244,"community_score":8.249,"description":"Online media need to quickly understand what happens at site and primarily share news and evaluate so that we can\nonly share the truth. Blockchain media need to be decentralized. Additionally, users should not only be consumers but\nalso active participants in providing and verifying the articles. Even now, there are many blockchain and\ncryptocurrency-related seminars, meetups, forums, academic conferences, and other events all around the world.\n\nWe need to encourage the participants to create articles and evaluate (through verification process) to share such\nnews with the right system and reward. We are going to help users to create articles on issues they witnessed through\na simple format guide and provide rewards afterward. If users in this world can both be providers and evaluators and\nonly the filtered news are shared, blockchain and cryptocurrency industry and market will stabilize in a healthy ecosystem.\n\nAlso, besides articles and news on blockchain and cryptocurrency, video sharing channel should also change.\nEven if one uploads multiple, diverse videos on a website, if he or she does not have substantial number of subscribers,\nthere is no reward. 90% of users on video platform uploads videos and expect one day there will be many subscribers.\nTo solve this problem, DNCOM will provide blockchain and cryptocurrency related MCN, an one-man media that easily\nshare verified videos on web.\n\nSimultaneously, users will be rewarded by uploading videos, watching others’\nvideos, and evaluate. Through DNCOM, people can watch not only blockchain and cryptocurrency seminars and other\nevents but also educational videos. Hence, all the aforementioned features will enable DNCOM to be a successful\nmulti-media company.","developer_score":0.0,"id":"dncom","image":{"large":"https://assets.coingecko.com/coins/images/8960/large/dncom.PNG?1563240881","small":"https://assets.coingecko.com/coins/images/8960/small/dncom.PNG?1563240881","thumb":"https://assets.coingecko.com/coins/images/8960/thumb/dncom.PNG?1563240881"},"links":{"blockchain_site":["https://etherscan.io/token/0x224bb81ede0922a82d529125a095e5ab0c0c4d5e"],"homepage":["https://www.dailycoin.io/"],"twitter_screen_name":"dailycoinews"},"liquidity_score":13.593,"market_cap_rank":2884,"name":"DNCOM","public_interest_score":24.638,"symbol":"dn","tickers":[]}