{"address":"0x228ba514309FFDF03A81a205a6D040E429d6E80C","description":"GSC (Global Social Chain) is the world's first new generation of social networking chain that owns hundreds of millions of social users. This social chain is determined to use block chain technology to subvert centralized social networks such as Facebook, WeChat, etc., which plays a dual role as \"manager\" and \"arbiter\" simultaneously for the former social networking platforms.\n\nSocial network is the most important basic measure of the Internet. It conveys the user's daily high frequency interactive behavior. However, at present, all the centralized social networking platforms, such as Facebook, Snapchat, etc., are facing many pain points.\n\nThe security of users' private information cant be guaranteed;\nThe user data can be used by the platform at any time;\nThere is a lack of incentive as the values created within the content of the user belong, at last, to the platform;\nCredit system vulnerability, false information, and low social efficiency.\n\nThe social network is a natural source applied to the centralized block chain technology. GSC's vision is to utilize the block chain technology to restructure the values of the next generation of social networking platforms and let the security of the private data and the digital assets become individual. Through the in-depth cooperation with the famous social networking application Mico, we have the chance to validate the solution of the block chain technology on the product matrix of Mico and made very effective progress.","id":"global-social-chain","links":{"announcement_url":["https://medium.com/@gsc_socialchain"],"blockchain_site":["https://enjinx.io/eth/token/0x228ba514309ffdf03a81a205a6d040e429d6e80c","https://etherscan.io/token/0x228ba514309ffdf03a81a205a6d040e429d6e80c","https://ethplorer.io/address/0x228ba514309ffdf03a81a205a6d040e429d6e80c"],"facebook_username":"GSCCoin","homepage":["https://www.gsc.social/"],"telegram_channel_identifier":"gsc_official","twitter_screen_name":"gsc_socialchain"},"name":"Global Social Chain","symbol":"gsc","tickers":[{"base":"GSC","market":{"identifier":"dcoin","name":"Dcoin"},"target":"ETH"},{"base":"GSC","market":{"identifier":"hb_top","name":"Hb.top"},"target":"CNYE"},{"base":"GSC","market":{"identifier":"hb_top","name":"Hb.top"},"target":"USDE"},{"base":"GSC","market":{"identifier":"hpx","name":"HPX"},"target":"ETH"},{"base":"GSC","market":{"identifier":"okex","name":"OKEx"},"target":"BTC"},{"base":"GSC","market":{"identifier":"okex","name":"OKEx"},"target":"ETH"},{"base":"GSC","market":{"identifier":"okex","name":"OKEx"},"target":"USDT"},{"base":"GSC","market":{"identifier":"rfinex","name":"Rfinex"},"target":"ETH"},{"base":"GSC","market":{"identifier":"rfinex","name":"Rfinex"},"target":"USDT"},{"base":"GSC","market":{"identifier":"tokenjar","name":"TokenJar"},"target":"WETH"}]}