{"address":"0x23D80c4EE8Fb55D4183dd9329296E176dC7464e1","coingecko_rank":1270,"coingecko_score":19.772,"community_score":48.208,"description":"Donuts are a form of community points that are (currently) exclusive to the r/ethtrader subreddit. You can think of them as similar to Reddit karma, except exclusively representing contributions on r/ethtrader, rather than all of Reddit.\n\nYou can also directly give Donuts to other users as a reward for good comments. Once you have Donuts, give it a try! While using the new Reddit redesign, click on the Donut symbol next to any username to give that user some of your Donuts.\n\nDonuts use cases currently include tipping other users' posts and comments, adding weight to your votes in governance polls, buying limited-edition subreddit badges, and buying the banner to probably update it with whatever weird t-shirt Vitalik wore to the last development conference.\n\nYou can also turn any amount of your Reddit Donuts into an ERC-20 cryptocurrency token at a 1:1 rate, and vice versa.\n\nConverting EthTrader Donuts To ERC-20 Donuts\nStep 1: Deposit donuts into your donut.dance account.\n\nTo make a deposit from Reddit, send donuts to ProofOfDonut. Any donuts received will be deposited to your account.\n\nTo send donuts, go to https://new.reddit.com/r/ethtrader (this ensures you are using the Reddit redesign). Find the side module labelled \"Subreddit Points\", click on the \"Send\" button, enter the number of donuts you would like to deposit, and send them to ProofOfDonut.\n\nhttps://donut.dance/tutorial/reddit_deposit_1.pnghttps://donut.dance/tutorial/reddit_deposit_2.png\n\nNow when you visit donut.dance and log in using your Reddit account, you will see your balance reflects the number of donuts you have deposited.\n\n\n\nStep 2: Withdraw ERC-20 Donuts\n\nAfter depositing donuts to donut.dance, you can convert them into ERC-20 tokens by going to https://donut.dance/withdraw and entering an Ethereum address and an amount of donuts to withdraw. Click the \"Withdraw\" button, and ERC-20 donuts will be sent to your Ethereum address!\n\nhttps://donut.dance/tutorial/erc20_withdrawal.png","developer_score":0.0,"id":"donut","image":{"large":"https://assets.coingecko.com/coins/images/7538/large/Donut.png?1548234345","small":"https://assets.coingecko.com/coins/images/7538/small/Donut.png?1548234345","thumb":"https://assets.coingecko.com/coins/images/7538/thumb/Donut.png?1548234345"},"links":{"blockchain_site":["https://etherscan.io/token/0x23d80c4ee8fb55d4183dd9329296e176dc7464e1"],"homepage":["https://www.reddit.com/r/ethtrader"],"subreddit_url":"https://www.reddit.com/r/ethtrader"},"liquidity_score":1.0,"market_cap_rank":5584,"name":"Donut","public_interest_score":75.205,"symbol":"donut","tickers":[{"base":"DONUT","market":{"identifier":"uniswap","name":"Uniswap"},"target":"ETH"}]}