{"address":"0x23b75Bc7AaF28e2d6628C3f424B3882F8f072a3c","coingecko_rank":2823,"coingecko_score":9.676,"community_score":9.471,"description":"The Vice Industry Token represents a profound change in the adult entertainment industry. It functions as two things; an adult entertainment platform where viewers can watch videos, and as a cryptocurrency where anybody who participates (in viewing, adding, or curating content) will get paid with VIT's proprietary cryptocurrency.\n\nThe original paradigm in adult entertainment was that people paid for the content they consumed; whether by subscription or pay-per-view. With \"tube\" websites becoming popular, there was a shift toward free-viewing. While free content was certainly desirable, wouldn't it be better if you could get paid for it, too?\nVice Industry Token is creating a breakthrough in the adult industry where everybody who accesses the platform will be rewarded. This includes producers, distributors, and more importantly... you as the viewer.\n\nBacked by some of the top names in the adult entertainment world, Vice Industry Token will deliver you the content that you want to see, while enabling you to get paid just for watching it.\n\nAdult entertainment is a multi-billion dollar industry. Vice Industry Token is your opportunity to get a piece of it, and all you have to do is watch porn. It's that simple. Sit back and watch as we revolutionize adult entertainment. We look forward to you joining us!","developer_score":14.917,"id":"vice-industry-token","image":{"large":"https://assets.coingecko.com/coins/images/2983/large/vit.png?1547037240","small":"https://assets.coingecko.com/coins/images/2983/small/vit.png?1547037240","thumb":"https://assets.coingecko.com/coins/images/2983/thumb/vit.png?1547037240"},"links":{"bitcointalk_thread_identifier":2675532,"blockchain_site":["https://etherscan.io/token/0x23b75bc7aaf28e2d6628c3f424b3882f8f072a3c"],"facebook_username":"vicetoken","homepage":["https://vicetoken.com/"],"repos_url":{"github":["https://github.com/ViceIndustryToken/vit-token"]},"telegram_channel_identifier":"viceindustrytoken","twitter_screen_name":"ViceToken"},"liquidity_score":1.0,"market_cap_rank":2286,"name":"Vice Industry Token","public_interest_score":33.786,"symbol":"vit","tickers":[{"base":"VIT","market":{"identifier":"idax","name":"Idax"},"target":"ETH"},{"base":"VIT","market":{"identifier":"stocks_exchange","name":"STEX"},"target":"NXT"}]}