{"address":"0x255Aa6DF07540Cb5d3d297f0D0D4D84cb52bc8e6","coingecko_rank":57,"coingecko_score":52.749,"community_score":41.354,"description":"The Raiden Network is an off-chain scaling solution, enabling near-instant, low-fee and scalable payments. It’s complementary to the <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> blockchain and works with any ERC20 compatible token. The Raiden project is work in progress. Its goal is to research state channel technology, define protocols and develop reference implementations. The introduction of payment channels, specifically the type first described by the Lightning Whitepaper (which introduced the Lightning Network), seeks to fix the scalability and congestion issues that currently plague blockchain technology. While the Lightning Network operates on the Bitcoin blockchain, Raiden introduces a comparable solution for the Ethereum network.\n\nThere are several key features of the Raiden Network Token. Expedited transfer confirmations (<1 second ). Current transfers on the Ethereum blockchain can take a few seconds to minutes. Private transfers that are not viewable on the global ledger. Solve scalability issues so that Ethereum can create mass adoption, allowing Ethereum to become the peer-to-peer, global payments infrastructure with electronic cash that it was initially designed for. Low fee transactions. Micropayment capability that works in union with any ERC-20 token.\n\nThe Raiden Network project is being developed by Germany’s Brainbot Technologies AG, a software company devoted to blockchain protocol development. Founded in the year 2000 by Heiko Hees, it currently has between 11 to 50 employees in offices among Berlin, Mainz, and Copenhagen. Also the founder of PediaPress, Hees has been a core developer of Ethereum since March 2014. Being a core developer for Ethereum, it is evident on how the founder sees the flaws in the current its present protocol with ways to improve it. Interestingly enough, the website does not include RDN as one of their main blockchain developments, which could be attributed to the difficulty of highlighting a wide variety of projects they are currently undertaking on one page. However, there are no updates on the status of the Raiden Network Project on either Twitter nor Medium since December 1st, 2017.\n\nRaiden can be used for a wide variety of applications and purposes such as Micropayments For Content Distribution, Decentralized M2M Markets, API Access and Fast Decentralized Exchanges.\"","developer_score":81.42,"id":"raiden-network","image":{"large":"https://assets.coingecko.com/coins/images/1132/large/raiden-logo.jpg?1547035131","small":"https://assets.coingecko.com/coins/images/1132/small/raiden-logo.jpg?1547035131","thumb":"https://assets.coingecko.com/coins/images/1132/thumb/raiden-logo.jpg?1547035131"},"links":{"announcement_url":["https://www.medium.com/@raiden_network"],"blockchain_site":["https://enjinx.io/eth/token/0x255aa6df07540cb5d3d297f0d0d4d84cb52bc8e6","https://etherscan.io/token/0x255aa6df07540cb5d3d297f0d0d4d84cb52bc8e6","https://ethplorer.io/address/0x255aa6df07540cb5d3d297f0d0d4d84cb52bc8e6"],"chat_url":["https://gitter.im/raiden-network/raiden","https://riot.im/app/#/room/#raiden-network:matrix.org"],"homepage":["https://raiden.network/"],"repos_url":{"github":["https://github.com/raiden-network/raiden/"]},"subreddit_url":"https://www.reddit.com/r/raidennetwork","twitter_screen_name":"raiden_network"},"liquidity_score":34.949,"market_cap_rank":270,"name":"Raiden Network Token","public_interest_score":28.29,"symbol":"rdn","tickers":[{"base":"RDN","market":{"identifier":"bamboo_relay","name":"Bamboo Relay"},"target":"WETH"},{"base":"RDN","market":{"identifier":"bitfinex","name":"Bitfinex"},"target":"BTC"},{"base":"RDN","market":{"identifier":"bitfinex","name":"Bitfinex"},"target":"ETH"},{"base":"RDN","market":{"identifier":"bitfinex","name":"Bitfinex"},"target":"USD"},{"base":"RDN","market":{"identifier":"forkdelta","name":"ForkDelta"},"target":"ETH"},{"base":"RDN","market":{"identifier":"gate","name":"Gate.io"},"target":"ETH"},{"base":"RDN","market":{"identifier":"gdac","name":"GDAC"},"target":"BTC"},{"base":"RDN","market":{"identifier":"radar_relay","name":"Radar Relay"},"target":"WETH"},{"base":"RDN","market":{"identifier":"uniswap","name":"Uniswap"},"target":"ETH"}]}