{"address":"0x2730d6FdC86C95a74253BefFaA8306B40feDecbb","coingecko_rank":2492,"coingecko_score":10.645,"community_score":3.572,"description":"UNI is committed to building a non-probable cross-chain hub, and its unique TPOS➕RAFT multi-function consensus algorithm implements user account management, cross-chain asset flashing, multi-chain wallet management, and one-click flash multi-chain assets; The cross-chain interface service system Phoenix enters the application environment of the cross-chain service through the RPC remote call protocol; the UNI platform will provide an optimized smart contract library to reduce the difficulty of developing DAPP, enabling the local and third-party DAPP ecosystem to rapidly expand and more Fast improvement; at the same time, using IPFS technology, HDFS distributed storage and big data AI algorithm to provide basic services such as data storage and big data artificial intelligence to the UNI main chain, empowering DApp. UNI will realize the free flow of assets between different chains, release the potential of different chains, allow more users to participate, and enable more chains to connect, eventually forming a truly big ecology, a network of inter-connected blockchains.","developer_score":0.0,"id":"unicorn-token","image":{"large":"https://assets.coingecko.com/coins/images/9383/large/54231438.png?1566777314","small":"https://assets.coingecko.com/coins/images/9383/small/54231438.png?1566777314","thumb":"https://assets.coingecko.com/coins/images/9383/thumb/54231438.png?1566777314"},"links":{"blockchain_site":["https://etherscan.io/token/0x2730d6fdc86c95a74253beffaa8306b40fedecbb"],"homepage":["https://unicorn.cm/"],"repos_url":{"github":["https://github.com/uni-official/token-profile"]},"twitter_screen_name":"unicorn_unx"},"liquidity_score":30.428,"market_cap_rank":6159,"name":"UNICORN Token","public_interest_score":36.669,"symbol":"uni","tickers":[{"base":"UNI","market":{"identifier":"biki","name":"Biki"},"target":"USDT"},{"base":"UNI","market":{"identifier":"citex","name":"CITEX"},"target":"USDT"}]}