{"address":"0x29536B7Ca7029b5cDDEB03c0451715615AcA35ba","coingecko_rank":3374,"coingecko_score":7.281,"community_score":4.448,"description":"NEWS CHAIN (propagation chain) is a blockchain-based traffic dissemination ecosystem. Its goal is to establish a network that uses blockchain technology to use decentralized consensus methods to contribute pricing and equity returns to content production. Producers, content investors and content consumers all have reasonable incentives and rewards. Advertisers can also achieve accurate marketing on the platform.\n\nThe original design of NEWS CHAIN (propaganda chain) is to construct a set of reasonable content flow advertising value evaluation and income distribution mechanism, and build a value network based on user content evaluation. Regardless of text, video, image, audio, or even live broadcast content-based content platforms (including, not limited to websites, Apps, and other forms of expression), the use of communication chains can be used to construct a content incentive platform corresponding to the theme. Between the platforms, the content is evaluated using a\nunified content evaluation algorithm, the value of the traffic is evaluated using an effective traffic algorithm, and the advertisement is provided by an accurate marketing algorithm. The content is produced by content producers, content investors, content communicators, and platforms. Constructors, advertisers, etc. will all rely on the ecology of the dissemination chain to obtain appropriate and reasonable returns based on content, traffic value, and precision marketing.\n\nTherefore, NEWS CHAIN (propagation chain) combines social networks, artificial intelligence, big data, and blockchains seamlessly. It will surely enable content-based eco-blockchains based on social networks to create content producers and content consumers. Content communicators and advertising investors share the economic ecology of mutual benefit.","developer_score":13.49,"id":"newstoken","image":{"large":"https://assets.coingecko.com/coins/images/5420/large/newstoken.png?1547041095","small":"https://assets.coingecko.com/coins/images/5420/small/newstoken.png?1547041095","thumb":"https://assets.coingecko.com/coins/images/5420/thumb/newstoken.png?1547041095"},"links":{"blockchain_site":["https://etherscan.io/token/0x29536b7ca7029b5cddeb03c0451715615aca35ba","https://ethplorer.io/address/0x29536b7ca7029b5cddeb03c0451715615aca35ba"],"homepage":["http://ne.ws/html/"],"repos_url":{"github":["https://github.com/news-chain/newschain/"]},"telegram_channel_identifier":"newschaintoken","twitter_screen_name":"news_newtoken"},"liquidity_score":1.0,"market_cap_rank":2690,"name":"NewsToken","public_interest_score":25.961,"symbol":"newos","tickers":[]}