{"address":"0x2c949199cFF14AEAF1B33D64Db01F48FB57f592f","coingecko_rank":949,"coingecko_score":22.659,"community_score":0.0,"description":"CoinBene Token (the \"Coni\") is a crypto-token developed by the CoinBene exchange. It has a strict total volume of 1 billion, which will be created and never increased. Coni will run on the Ethereum blockchain with ERC 20.\n\nValue of Coni\n\n1. 40% of Profit-sharing: 40% of the net profit of the platform is used to reward Coni holders in 8th of each month such as the first reward time is July 8th and so on. Based on developing of CoinBene, the monthly rewards will be replaced by weekly rewards.\n\n2. Exclusive Discounts of Trade Fee: Coni holders will be expected to enjoy the exclusive discounts of trade fee, the more holding amount, the bigger discounts, with 70% off in maximum.\n\n3. Guarantee Deposit: Every new project needs to deposit a number of Coni tokens based on market value to a listing guarantee with 10 months reserved period. The guarantee deposit will be refunded in 1st of each month and the proportion of refunds is 10% of the guarantee deposit until all of them.\n\n4. Listing vote: As platform develops, CoinBene will adopt 'Voting to listing' model.\n\n5. Global Partner: With the acceleration of globalization, CoinBene will select global partners. In addition to other requirements, the partner is expected to deposit a number of Coni tokens based on market value to a cooperating guarantee.\n\n6. Public Blockchain: CoinBene will release Coni public blockchain, meanwhile, the global business process will be managed on blockchain and the application of Coni will extend in the future.","developer_score":0.0,"id":"coinbene-token","image":{"large":"https://assets.coingecko.com/coins/images/4772/large/coinbene-coni-token-logo.jpg?1547040104","small":"https://assets.coingecko.com/coins/images/4772/small/coinbene-coni-token-logo.jpg?1547040104","thumb":"https://assets.coingecko.com/coins/images/4772/thumb/coinbene-coni-token-logo.jpg?1547040104"},"links":{"blockchain_site":["https://enjinx.io/eth/token/0x2c949199cff14aeaf1b33d64db01f48fb57f592f","https://etherscan.io/token/0x2c949199cff14aeaf1b33d64db01f48fb57f592f","https://ethplorer.io/address/0x2c949199cff14aeaf1b33d64db01f48fb57f592f"],"homepage":["https://www.coinbene.com/#/coni"]},"liquidity_score":40.043,"market_cap_rank":353,"name":"Coinbene Token","public_interest_score":27.208,"symbol":"coni","tickers":[]}