{"address":"0x30680AC0a8A993088223925265fD7a76bEb87E7F","coingecko_rank":2121,"coingecko_score":12.893,"community_score":10.371,"description":"We are on a mission to provide end-to-end solutions for E-Commerce Marketplace, Touch & Pay Cryptocurrency Card, Online Cryptocurrency Payment, and Unified Reward System powered by the Ethereum Blockchain.\n\nToday’s e-commerce industry is growing at a rapid pace and global retail e-commerce sales are expected to reach $4.5 trillion by 2021. For most commercial businesses, cryptocurrency is becoming a preferred mode of transaction highlighted by its current cap of hundreds of billions and expected to rise to trillions. According to research, most of the finance and banking industry is expected to move to the blockchain and hence adoption rate of blockchain across all industries will increase in the coming years. By Introducing the ARAW Token, the heart of the decentralised payment ecosystem powered by the Ethereum Blockchain, We are aiming to contribute to the global Blockchain User Adoption by intuitive integration of vastly used E-Commerce channel with the Decentralised Payment such that regular people across the world can benefits from the cryptocurrency without needing them to change their shopping behaviour or understand complexity of the Blockchain technology.\nWe are the first company in the world whose mission is to combine the benefits of the E-Commerce and Payment industries; provide end-to-end solutions for E-Commerce Marketplace, Touch & Pay Cryptocurrency Card, Online Cryptocurrency Payment, and Unified Reward System on the Ethereum Blockchain powered by the ARAW token.\nThe goal of the ARAW token is to be a part of everyone’s day-to-day online & in-store shopping.","developer_score":0.0,"id":"araw-token","image":{"large":"https://assets.coingecko.com/coins/images/4281/large/araw.png?1547039642","small":"https://assets.coingecko.com/coins/images/4281/small/araw.png?1547039642","thumb":"https://assets.coingecko.com/coins/images/4281/thumb/araw.png?1547039642"},"links":{"announcement_url":["https://medium.com/@TheARAWToken"],"bitcointalk_thread_identifier":3497194,"blockchain_site":["https://enjinx.io/eth/token/0x30680ac0a8a993088223925265fd7a76beb87e7f","https://etherscan.io/token/0x30680ac0a8a993088223925265fd7a76beb87e7f","https://ethplorer.io/address/0x30680ac0a8a993088223925265fd7a76beb87e7f"],"facebook_username":"arawtoken","homepage":["https://arawtoken.io/"],"repos_url":{"github":["https://github.com/arawtoken/arawtoken"]},"telegram_channel_identifier":"ArawTokenOfficial","twitter_screen_name":"arawtoken"},"liquidity_score":1.0,"market_cap_rank":1581,"name":"ARAW Token","public_interest_score":25.611,"symbol":"araw","tickers":[{"base":"ARAW","market":{"identifier":"hotbit","name":"Hotbit"},"target":"ETH"},{"base":"ARAW","market":{"identifier":"mercatox","name":"Mercatox"},"target":"BTC"},{"base":"ARAW","market":{"identifier":"mercatox","name":"Mercatox"},"target":"ETH"}]}