{"address":"0x33B919F54692dDbf702065763EA2b50Ca02e6bfF","coingecko_rank":2003,"coingecko_score":13.576,"community_score":4.015,"description":"MOCROW ecosystem is an energy ecosystem that is powered by Mocrow (MCW), an ERC20 token. MOCROW ecosystem is an integral part of, and has been fully integrated with an existing energy utility company which serves over 900,000 electricity users in the coverage area. Energy payments are being made with MCW. Furthermore payment validation and verification is also being achieved by the system. All tests have been carried out and concluded. Full deployment is currently underway. The immediate community for MCW is the staff of the utility company; every staff is entitled to some MCW and the airdrop has been done. Free token airdrops to interested parties from the twitter community have also been done.\n\nReason for Project: A notable obstacle to economic growth of under developed countries is inadequate electric energy due primarily to very high losses within the existing Electricity Transmission and Distribution networks. The electricity infrastructure is often times weak and old with outdated installations. The most profound and fundamental cause of the high losses can be directly linked to revenue leakages which can be as high as 80% in some cases. In a bid to reduce these losses for improved revenue profile (for reinvestment onto the networks), MOCROW ecosystem was built primarily for the validation of ALL energy payments using the blockchain.","developer_score":12.0,"id":"mocrow","image":{"large":"https://assets.coingecko.com/coins/images/7193/large/AhLjOv5y_400x400.jpg?1547043754","small":"https://assets.coingecko.com/coins/images/7193/small/AhLjOv5y_400x400.jpg?1547043754","thumb":"https://assets.coingecko.com/coins/images/7193/thumb/AhLjOv5y_400x400.jpg?1547043754"},"links":{"bitcointalk_thread_identifier":5031930,"blockchain_site":["https://etherscan.io/token/0x33b919f54692ddbf702065763ea2b50ca02e6bff","https://ethplorer.io/address/0x33b919f54692ddbf702065763ea2b50ca02e6bff"],"homepage":["https://www.cynotrust.com/"],"repos_url":{"github":["https://github.com/salamtura/mcw-token"]},"telegram_channel_identifier":"mocrowcommunity","twitter_screen_name":"MocrowToken"},"liquidity_score":0.0,"market_cap_rank":1659,"name":"Mocrow","public_interest_score":24.128,"symbol":"mcw","tickers":[]}