{"address":"0x349C14bcA4e70D5eA4a4c08E7CFfce51708B4887","coingecko_rank":4769,"coingecko_score":3.421,"community_score":2.603,"description":"Idea of the project is to tell about important problem in the world. The more successful the project, the more people will know about it!\n\nIn the last two years, the world has experienced new epidemies due to refusal of vaccinations: unvaccinated people are infected with highly contagious infections like measles with a 100 percent chance. In 2018, according to WHO, more than 82,000 children and adults in Europe were infected with measles, the epidemy began in 2017: then the number of cases increased to 13,000 per year. Compare: in 2016, there were only 5,273 registered cases in Europe. There are many rumors around vaccination, fake information and false research. And the rare side effects that all drugs have are artificially exaggerated.\n\nAccording to WHO, messages about danger of vaccines in most cases are fake in nature. At the same time rare negative aspects of vaccination are widely publicized in mass media, while many positive aspects are often silenced and cause less interest in people.\n\nScientists who conducted inaccurate researches are to be blamed for hysteria against vaccinations as well. In 1998, the British magazine The Lancet published a study by Dr. Andrew Wakefield, that vaccines against measles, mumps and rubella cause autism. The study was widely reported, and its findings were widely spoken of. However, the work was withdrawn after other scientists recognized Wakefield's findings unsubstantiated. Later the doctor was deprived of his license.\n\nRefusal of vaccinations is also associated with belief in conspiracy theory, primarily in the conspiracy of pharmaceutical companies to make a profit. However, the mass vaccination campaign is almost 10 times cheaper than the treatment of all patients if it is not carried out.\n\nAnti-vaccinators are also benefit to adherents of unproven alternative medicine. After all, in addition to drugs for the treatment of diseases, refusal of vaccination allows you to sell a lot of other drugs, for example, dietary supplements for improving immunity and antivirals. That's just unlike vaccines such supplements have no proven effectiveness, no one checks them, and some of them are just homoeopathy, which is equal to the placebo effect and is not recommended for patients in developed countries for a long time, for example, in the UK and the United States.\n\nThe world health organization website lists vaccines for thirty-five diseases. Some of them are difficult and dangerous with complications, others simply do not have treatment. In the long term, vaccinated people create strong collective immunity. If around one unvaccinated and ill person there are ten vaccinated, the epidemic simply can not break out. For such a barrier against the disease, 95% of the population must be vaccinated.\n\nThere are people who can’t be vaccinated because of contraindications (infants, people with immunodeficiency or other severe chronic conditions), therefore, it is necessary to achieve 100% vaccination, among those who can be vaccinated in principle.\n\nStatistics is affected by anti-vaccinators who, knowingly or because of fear, do not vaccinate themselves and their children. German doctors wrote an article in which they identified several types of anti-vaccinators. They are classified for reasons of refusal:\n\"Careless\" do not take the threat seriously and do not think about diseases.\n\"Lazy\" just don't want to mess with it.\n\"Careful\" are always at a crossroads and will weigh all the\" pros \"and\" cons\" to the last.\n\"Suspicious\" fanatical against vaccinations and don't believe even the most common arguments from doctors.","developer_score":0.0,"id":"healthylife","image":{"large":"https://assets.coingecko.com/coins/images/8392/large/viV6ui6B_400x400.jpg?1557980650","small":"https://assets.coingecko.com/coins/images/8392/small/viV6ui6B_400x400.jpg?1557980650","thumb":"https://assets.coingecko.com/coins/images/8392/thumb/viV6ui6B_400x400.jpg?1557980650"},"links":{"bitcointalk_thread_identifier":5123078,"blockchain_site":["https://etherscan.io/token/0x349c14bca4e70d5ea4a4c08e7cffce51708b4887"],"homepage":["http://heliweb.info/"],"twitter_screen_name":"Healthy_vaccin"},"liquidity_score":1.0,"market_cap_rank":4427,"name":"HealthyLife","public_interest_score":25.7,"symbol":"heli","tickers":[{"base":"HELI","market":{"identifier":"livecoin","name":"Livecoin"},"target":"BTC"},{"base":"HELI","market":{"identifier":"livecoin","name":"Livecoin"},"target":"ETH"}]}