{"address":"0x369eb6821C94a78428f7c86c768590F53950068f","coingecko_rank":3264,"coingecko_score":7.816,"community_score":7.827,"description":"ATFS Project is the world’s first decentralized AgriTech & Food Science crowdfunding project built on Ethereum Blockchain and Smart Contracts.\n\nWe are bringing Industrial Revolution 4.0 to the crypto world with ATFS Token. The issuance of ATFS Token finances the establishment of Smart Farm 2.0, development of Disruptive Decentralized Platform, and production of Plant-Based Meat. The project is an all-around solution to the world’s growing food crisis by providing relevant technological advances in agriculture, new revenue base and supply systems, and a socially-acceptable alternative to meat consumption.\n\nATFS Project and its team members vow to enhance people’s quality of life all around the world by revolutionizing the current food system. Therefore, it is necessary and critical to secure funding during our crowdfunding period. By participating, you are joining a group of like-minded pioneers who knows of the benefits that the next agricultural revolution will generate. The profits from all stages of the ATFS Project will be shared based on ATFS Token’s smart contracts.\n\nWe are fully confident that the ATFS Project is a win-win model for both agriculture industry and the crypotoworld.","developer_score":12.261,"id":"atfs","image":{"large":"https://assets.coingecko.com/coins/images/3772/large/ATFS_logo_500.png?1547038862","small":"https://assets.coingecko.com/coins/images/3772/small/ATFS_logo_500.png?1547038862","thumb":"https://assets.coingecko.com/coins/images/3772/thumb/ATFS_logo_500.png?1547038862"},"links":{"bitcointalk_thread_identifier":2612592,"blockchain_site":["https://enjinx.io/eth/token/0x369eb6821c94a78428f7c86c768590f53950068f","https://etherscan.io/token/0x369eb6821C94a78428f7c86c768590F53950068f","https://ethplorer.io/address/0x369eb6821C94a78428f7c86c768590F53950068f"],"facebook_username":"atfslab","homepage":["https://www.atfslab.io/"],"repos_url":{"github":["https://github.com/ATFSLAB/ICO"]},"telegram_channel_identifier":"ATFS_ICO","twitter_screen_name":"AtfsLab"},"liquidity_score":1.0,"market_cap_rank":3191,"name":"ATFS LAB","public_interest_score":25.936,"symbol":"atfs","tickers":[]}