{"address":"0x37D40510a2F5Bc98AA7a0f7BF4b3453Bcfb90Ac1","coingecko_rank":3033,"coingecko_score":8.391,"community_score":23.971,"description":"BELUGA aims to leverage blockchain technologies to develop an open source asset transferring platform. By thus providing the tools for small businesses and their customers in developing countries to go digital, it is BELUGA’s mission to help the unbanked billions become part of a newer, better, and fairer global financial system.\n\nHow it Works\n\nBELUGA Point of Sale, BELUGA Restaurant Edition, BELUGA Peer 2 Peer and BELUGA Payment Data suite platforms will enable transactions in Fiat and Crypto currencies. You can buy or sell your products and services in Fiat and Crypto currencies in Beluga more efficiently than ever before. All of our platforms are made to run on a common BELUGA Blockchain in order to give a unified experience to merchants and to make their life easier.\n\n1. Consumer buys a product or consumes a service from a merchant using one of our products. For example a customer orders food in a restaurant using BELUGA’s Restaurant Edition Application.\n2. Consumer makes payment for the product or service using Fiat Currency (ex. $USD) or Crypto currency (Bitcoin, Ether or BBI.)\n3. If the payment is made using a credit card in Fiat Currency, the merchant can decide to use BBI tokens in order to receive an Instant Merchant Deposit* instead of having to wait the traditional two working days for the settlement to occur.\n4. If the payment is made using cryptocurrency, the settlement process is initiated and the payment to the merchant in the form of the respective cryptocurrency is transferred instantly.\n5. Loyalty points are accumulated for consumers on every purchase of a product and service. Loyalty points for merchants are accumulated on every sale of a product and service.\n6. Loyalty points can be redeemed when the consumer or merchant collect enough points.\n7. Loyalty points are redeemed in the form Fiat currencies or BELUGA’s BBI crypto currency or other cryptocurrency.\n8. The ratio of points with currencies is calculated using built-in configurators and Oracles based on the market dynamics.","developer_score":0.0,"id":"belugapay","image":{"large":"https://assets.coingecko.com/coins/images/3914/large/2636.png?1547038957","small":"https://assets.coingecko.com/coins/images/3914/small/2636.png?1547038957","thumb":"https://assets.coingecko.com/coins/images/3914/thumb/2636.png?1547038957"},"links":{"announcement_url":["https://medium.com/@BelugaPay"],"blockchain_site":["https://etherscan.io/token/0x37d40510a2f5bc98aa7a0f7bf4b3453bcfb90ac1"],"facebook_username":"BelugaPay","homepage":["https://belugapay.com/"],"subreddit_url":"https://www.reddit.com/r/belugapay/","telegram_channel_identifier":"belugapay","twitter_screen_name":"belugapay"},"liquidity_score":0.0,"market_cap_rank":2432,"name":"BelugaPay","public_interest_score":23.986,"symbol":"bbi","tickers":[]}