{"address":"0x37BB1A64d81d6373A467A0683bA709c2998086CB","coingecko_rank":4212,"coingecko_score":5.162,"community_score":6.578,"description":"The flower of life is a geometrical shape composed of multiple evenly-spaced, overlapping circles arranged in a flower like pattern with six fold symmetry like a hexagon. The perfect form, proportion and harmony of the FOLI has been known to philosophers, architects and artist around the world.\n\nThe flower of life is the core of the ancient Egyptian school of mysticism, an all-encompassing geometric symbol, known as the first language of the universe, with pure shapes and proportions. It is consistent with the perfect shape and frequency of the universe. It is a mysterious mathematical figure that has not been fully cracked so far, and it is the language and symbol that make up the mysterious relationship between life and the universe. The flower of life is not the expression of two dimensional space, but the derivative process of three dimensional space, including gene, cell, meiosis of time cycle.\n\nThe petals in its sphere are continuously extending in equal proportion, repeating 7 times and rotating outward at the same time, creating a \"cell\" pattern. And every eighth division is a new outward rotation, the cycle repeats until the matrix is created. The geometry of this mysterious natural creation, like the arrangement and combination of genetic material and DNA, covers every aspect of life in its scale structure. It represents all the mathematical equations, geometric data, laws of physics, musical rhythms, and the origins of life, It implies the cosmic laws of light wave propagation, atomic motion, molecular structure and quantum energy in the development of the universe. It contains everything in the fluctuating universe, including every atom, all levels of dimensions.","developer_score":0.0,"id":"flower-of-life","image":{"large":"https://assets.coingecko.com/coins/images/7150/large/3gqEDSuE_400x400.jpg?1547043657","small":"https://assets.coingecko.com/coins/images/7150/small/3gqEDSuE_400x400.jpg?1547043657","thumb":"https://assets.coingecko.com/coins/images/7150/thumb/3gqEDSuE_400x400.jpg?1547043657"},"links":{"blockchain_site":["https://etherscan.io/token/0x37bb1a64d81d6373a467a0683ba709c2998086cb"],"facebook_username":"Floweroflife.one","homepage":["http://www.floweroflife.one/"],"telegram_channel_identifier":"floweroflife_foli","twitter_screen_name":"foli_flowerlife"},"liquidity_score":0.0,"market_cap_rank":3291,"name":"Flower of Life","public_interest_score":35.18,"symbol":"foli","tickers":[]}