{"address":"0x3833ba8FCA0082E5A04126F20988149B9529298d","coingecko_rank":4815,"coingecko_score":4.374,"community_score":2.213,"description":"The IDEAS Platform is a blockchain-based idea product development platform aimed at protecting intellectual property and content copyrights and distributing profits fairly. The IDEAS CASH(IDC) is a reward token that is compensated according to the activities of the platform participants.\n\nThe IDEAS Cash (IDC) starts with the rewarding to platform participants who are joining voting and ultimately extends to concepts such as voting rights, auction participation rights and crowdfunding participation rights.\n\n\nIDEAS CASH TOKEN has features which are;\n\n1) The IDC Cash can be exchanged to IDC Point  at a rate of IDC * Market Price (MP) *120%, and the 17% of IDC CASH exchanged is burned.\n\n2) The exchange can be made by 3.5% per month for the total volume and is limited to maximum 15% per annum. (*depending on MP)\n\n3) Of the exchanged IDC Point, the IDC is bought-back at market price with the rate amount of IDC Point * 5% used for the Voting and the lockup is set for 1 month.\n\n4) The introduction of this system will be carried out in accordance with the global platform release schedule, and the schedule could be changed depending on market conditions.","developer_score":0.0,"id":"ideas-cash","image":{"large":"https://assets.coingecko.com/coins/images/8959/large/Ideas_Cash.png?1563771114","small":"https://assets.coingecko.com/coins/images/8959/small/Ideas_Cash.png?1563771114","thumb":"https://assets.coingecko.com/coins/images/8959/thumb/Ideas_Cash.png?1563771114"},"links":{"blockchain_site":["https://etherscan.io/token/0x3833ba8fca0082e5a04126f20988149b9529298d"],"homepage":["http://idscoin.io/"],"twitter_screen_name":"ideas_channel"},"liquidity_score":1.0,"market_cap_rank":5630,"name":"Ideas Cash","public_interest_score":36.202,"symbol":"idc","tickers":[{"base":"IDC","market":{"identifier":"coinfinit","name":"Coinfinit"},"target":"KRW"}]}