{"address":"0x3883f5e181fccaF8410FA61e12b59BAd963fb645","coingecko_rank":98,"coingecko_score":47.783,"community_score":38.038,"description":"Theta is a decentralized video delivery network, powered by users and an innovative new blockchain. Theta is an open source protocol purpose-built to power the decentralized streaming network and will allow for vertical decentralized apps (DApps) to be built on top of the platform to enable esports, music, TV/movies, education, enterprise conferencing, peer-to-peer streaming, and more. SLIVER.tv’s DApp will be the first application built on the Theta network leveraging its existing user base of millions of esports viewers.\n\nDSN and the Theta protocol solve various challenges the video streaming industry faces today. First, Theta tokens are used as an incentive to encourage individual users to share their redundant memory and bandwidth resources as caching nodes for video streams. This improves the quality of stream delivery and solves the “last-mile” delivery problem, the main bottleneck for traditional stream delivery pipelines, especially for high resolution high bitrate 360° virtual reality (VR) streams. Second, with sufficient amount of caching nodes, the majority of viewers will pull streams from peering caching nodes. This significantly reduces content delivery network (CDN) bandwidth costs, which is a major concern for video streaming sites.\n\nLastly, the Theta network greatly improves the streaming market efficiency by streamlining the video delivery process. For example, advertisers can target end viewers at a lower cost and reward influencers more transparently.The Theta blockchain introduces three novel concepts: Reputation Dependent Mining: In the Theta protocol, the caching nodes play the role of miners in the blockchain. The block reward is not a constant, but depends on the reputation score of the caching node that mined the block. To obtain more mining rewards, miners not only spend computation power to mine blocks, but also relay video streams to downstream viewers to increase their reputation scores.\n\nGlobal Reputation Consensus: We propose a mechanism for the Theta network to reach the global consensus on the reputation scores for each caching node. Proof-of-Engagement: We introduce a novel Proof-of-Engagement scheme to prove that viewers legitimately consume the video streams, providing better transparency to advertisers and a basis for viewers to earn Theta tokens for engaging with the content.","developer_score":54.756,"id":"theta-token","image":{"large":"https://assets.coingecko.com/coins/images/2538/large/theta-token-logo.png?1548387191","small":"https://assets.coingecko.com/coins/images/2538/small/theta-token-logo.png?1548387191","thumb":"https://assets.coingecko.com/coins/images/2538/thumb/theta-token-logo.png?1548387191"},"links":{"announcement_url":["https://medium.com/@ThetaLabs"],"bitcointalk_thread_identifier":2451089,"blockchain_site":["https://explorer.thetatoken.org"],"facebook_username":"ThetaToken","homepage":["https://www.thetatoken.org/"],"repos_url":{"github":["https://github.com/thetatoken/theta-infrastructure-ledger-explorer","https://github.com/thetatoken/theta-infrastructure-vault","https://github.com/thetatoken/theta-protocol-delivery-lib","https://github.com/thetatoken/theta-protocol-ledger"]},"subreddit_url":"https://www.reddit.com/r/thetatoken","twitter_screen_name":"thetatoken"},"liquidity_score":37.075,"market_cap_rank":50,"name":"Theta Network","public_interest_score":27.953,"symbol":"theta","tickers":[{"base":"THETA","market":{"identifier":"wazirx","name":"WazirX"},"target":"BTC"}]}