{"address":"0x38c6A68304cdEfb9BEc48BbFaABA5C5B47818bb2","coingecko_rank":380,"coingecko_score":32.598,"community_score":38.959,"description":"High-Performance Blockchain tackles the concept of scalability from a completely different angle. Rather than just looking at the software side of things, the project also tackles the hardware aspect. To realize the optimal performance of blockchain applications, things will need to change in the near future. As such, this team is building an architecture which uses thousands of CPU and FPGA resources to create a more versatile and scalable ecosystem.\n\nThere are a few aspects of the High-Performance Blockchain project to take into account. First of all, there is the chip-level acceleration engine which provides accelerated hardware chips to power this entire ecosystem. Secondly, the software side of the High-Performance Blockchain is integrated with the new dedicated hardware accelerated engine and focuses on depth and scaling customization. Third, the project claims it can produce a throughput in the millions of transactions without any major problems.\n\nWhile all of this sounds amazing, it is difficult to come by any real information regarding the technical aspects of either the hardware or the software side of High-Performance Blockchain. While the team mainly focuses on blockchain integration for real-world business cases, it remains to be seen how their chips will operate and how their algorithms are created. It seems the High-Performance Blockchain project is closely connected to the <a href=\"https://www.coingecko.com/en/coins/neo\">NEO</a> infrastructure, which could introduce some interesting developments down the line.\n\nBuilding the High-Performance Blockchain infrastructure will take a lot of time and money. As such, the roadmap is filled with milestones which the team aims to achieve in the coming years. A testnet version of this project will be launched at some point in 2018, which will undergo further improvements for several months. The actual manner will launch in Q2 of 2018 if things go according to plan. However, the official version will not go live until mid-2019 at the earliest.","developer_score":0.0,"id":"high-performance-blockchain","image":{"large":"https://assets.coingecko.com/coins/images/2363/large/high-performance-blockchain.png?1547744791","small":"https://assets.coingecko.com/coins/images/2363/small/high-performance-blockchain.png?1547744791","thumb":"https://assets.coingecko.com/coins/images/2363/thumb/high-performance-blockchain.png?1547744791"},"links":{"blockchain_site":["https://etherscan.io/token/0x38c6a68304cdefb9bec48bbfaaba5c5b47818bb2","https://hpbscan.org/"],"facebook_username":"HPBGlobal","homepage":["https://www.hpb.io/"],"repos_url":{"github":["https://github.com/hpb-project/go-hpb"]},"subreddit_url":"https://www.reddit.com/r/HPB_Global","telegram_channel_identifier":"hpbglobal","twitter_screen_name":"HPB_Global"},"liquidity_score":36.781,"market_cap_rank":417,"name":"High Performance Blockchain","public_interest_score":39.007,"symbol":"hpb","tickers":[{"base":"HPB","market":{"identifier":"bibox","name":"Bibox"},"target":"BIX"},{"base":"HPB","market":{"identifier":"bit_z","name":"Bit-Z"},"target":"BTC"},{"base":"HPB","market":{"identifier":"bit_z","name":"Bit-Z"},"target":"ETH"},{"base":"HPB","market":{"identifier":"kucoin","name":"KuCoin"},"target":"ETH"},{"base":"HPB","market":{"identifier":"mxc","name":"MXC"},"target":"USDT"},{"base":"HPB","market":{"identifier":"okex","name":"OKEx"},"target":"ETH"},{"base":"HPB","market":{"identifier":"okex_korea","name":"OKEx Korea"},"target":"ETH"}]}