{"address":"0x3893b9422Cd5D70a81eDeFfe3d5A1c6A978310BB","coingecko_rank":328,"coingecko_score":33.495,"community_score":26.159,"description":"Mithril is a decentralized ecosystem on the ethereum blockchain. It is a system that rewards users who engage in “social mining”. Mithril rewards users for the impact their content may have in viewers and the popularity it attracts, such as number of likes and views.  In the blockchain network and cryptocurrency, Mithril is a very innovative idea that aims to change the way we think about social media entirely. This particular innovation will decentralize and reward social media content creators in a fair and open way.The process of building a social media platform from the scratch is a long, rigorous and exhausting one. Even though blockchain based social media platforms are not new innovations, they usually cannot interact with existing platforms. The Mithril integration protocol permits MITH mining on all social media networks. Therefore, Mithril can also leverage existing sites for their own purposes. In addition, it permits content influencers to make use of their pre-existing followers network to mine Mithril. This acts as a big plus to the Mithril ecosystem. It requires less stress and work than establishing followers on an entirely new platform. It also helps Mithril to have an edge and a bigger pool of users. This means that, content providers only need to start making use of the Mithril integration protocol in order to make more money.\n\nInstead of an ICO, Mithril held a private crowdsale where 400,000,000 MITH was distributed and 50,000,000 was retained by the Mithril team for development and marketing. Mithril MITH tokens are mined by participating on partner applications and this social mining is a gamechanger. Creating and sharing content earns Mithril MITH, which can then be spent with partner applications. Because mythril is a crafting ingredient in the Final Fantasy video game series, online searches for how to spend MITH have these pages mixed in, which will likely continue for several years until the platform gains enough big-name retail spending partners to rise up SEO rankings.\n\nMITH is currently available on Bithumb and OKEx, but more exchanges will likely list the token soon. Although exchanges are never the best place to store your cryptocurrencies due to security concerns, this is one possibility. Better would be to store them using an ERC-20 wallet that allows you to add custom tokens, such as MyEtherWallet, <a href=\"https://www.coingecko.com/buzz/how-to-use-mycrypto-desktop-app?locale=en\">MyCrypto</a>, or Coinfy.\n\nAlthough the Mithril platform and its flagship social network Lit are still in fairly early development, as an early mover, they are poised to be a leader in the decentralized social networking space. If Mithril gets its way, centralized social networking companies may soon have worthy competitors that offer users more control of their data while rewarding people for creating the content that is ultimately the life-blood of all social networks.","developer_score":16.643,"id":"mithril","image":{"large":"https://assets.coingecko.com/coins/images/3484/large/mithril.png?1548085086","small":"https://assets.coingecko.com/coins/images/3484/small/mithril.png?1548085086","thumb":"https://assets.coingecko.com/coins/images/3484/thumb/mithril.png?1548085086"},"links":{"announcement_url":["https://medium.com/mithriltoken"],"bitcointalk_thread_identifier":3108554,"blockchain_site":["https://enjinx.io/eth/token/0x3893b9422cd5d70a81edeffe3d5a1c6a978310bb","https://etherscan.io/token/0x3893b9422cd5d70a81edeffe3d5a1c6a978310bb","https://ethplorer.io/address/0x3893b9422cd5d70a81edeffe3d5a1c6a978310bb"],"facebook_username":"MithrilToken","homepage":["https://mith.io/"],"repos_url":{"github":["https://github.com/mithio/mithril-smart-contract"]},"subreddit_url":"https://www.reddit.com/r/MithrilToken/","telegram_channel_identifier":"MithrilChat","twitter_screen_name":"MithrilToken"},"liquidity_score":35.865,"market_cap_rank":269,"name":"Mithril","public_interest_score":33.143,"symbol":"mith","tickers":[{"base":"MITH-C76","market":{"identifier":"binance_dex","name":"Binance DEX"},"target":"BNB"},{"base":"MITH","market":{"identifier":"coin_exchange","name":"CoinExchange.io"},"target":"BTC"},{"base":"MITH","market":{"identifier":"coin_exchange","name":"CoinExchange.io"},"target":"ETH"},{"base":"MITH","market":{"identifier":"dove_wallet","name":"Dove Wallet"},"target":"BTC"},{"base":"MIT","market":{"identifier":"ethfinex","name":"Ethfinex"},"target":"BTC"},{"base":"MIT","market":{"identifier":"ethfinex","name":"Ethfinex"},"target":"ETH"},{"base":"MIT","market":{"identifier":"ethfinex","name":"Ethfinex"},"target":"USD"},{"base":"MITH","market":{"identifier":"hitbtc","name":"HitBTC"},"target":"USD"}]}