{"address":"0x400b1d8a7dd8C471026B2c8CBe1062b27d120538","coingecko_rank":3258,"coingecko_score":3.734,"community_score":10.141,"description":"We believe that to build a smart and efficient city, the city first needs to be understood. It starts by having a digital ecosystem that allows real time analysis of living and moving data. The end result is a greener city through optimal energy production, enhanced security via distributed ledger technology and an urban civilization that provides efficiency yet with simplicity.\n\nThrough the expertise of the team and their network in the industry, Limestone Technology aims to build a smart-city ecosystem for real estate developments and infrastructure across South East Asia\n\nThis will be accomplished through the digitalisation of the city via the development of a blockchain infrastructure – Limestone Network.\n\nOur team envisioned Limestone Network to be the final solution that resolves existing challenges faced by governments, real estate developers and estate management service providers. When Limestone Network is implemented into a real estate project or existing infrastructure, we allow the facilities management to be taken to a simpler yet more secured level. Businesses, retail shops, building facilities, consumers, tourists and the daily visitors would be able to interact with each other in a smarter and more effective manner to provide a meaningful Smart City experience.\n\nLimestone Network, an initiative of Global Tech Exchange, South East Asia real estate developer, will first be deployed in a city centre with up to 10,000 business tenants and 190,000 daily population, spanning across 20 hectares of work spaces, encompassing shopping malls, schools, retail outlets and housing the largest exhibition hall for business, it aims to be the financial hub, convention centre and go-to business place in the capital of Cambodia and thus giving this blockchain project a mandatory use case.","developer_score":0.0,"id":"limestone-network","image":{"large":"https://assets.coingecko.com/coins/images/11907/large/nw1FE_f4_400x400.png?1596074376","small":"https://assets.coingecko.com/coins/images/11907/small/nw1FE_f4_400x400.png?1596074376","thumb":"https://assets.coingecko.com/coins/images/11907/thumb/nw1FE_f4_400x400.png?1596074376"},"links":{"blockchain_site":["https://etherscan.io/token/0x400b1d8a7dd8C471026B2c8CBe1062b27d120538","https://ethplorer.io/address/0x400b1d8a7dd8C471026B2c8CBe1062b27d120538"],"chat_url":["https://www.linkedin.com/company/limestone-network/"],"facebook_username":"LimestoneNetwork","homepage":["https://limestone.network/"],"repos_url":{"github":["https://github.com/limestone-network"]},"telegram_channel_identifier":"limestone_en","twitter_screen_name":"limestonenetwo1"},"liquidity_score":7.514,"market_cap_rank":null,"name":"Limestone Network","public_interest_score":0.001,"symbol":"limex","tickers":[]}