{"address":"0x40bB36a54Bf28872B6ffdfa7fbC6480900e58448","coingecko_rank":2047,"coingecko_score":13.506,"community_score":0.0,"description":"Wowoo aims to be at the forefront of the service content-type token platforms in the blockchain. Wowoo provides various user-friendly services on the Wowoo Platform and forms the Wowoo virtual community and sustainable ecosystem. The medium as a lubricant is the Wowoo Token itself, and that is Wowbit (WWB) being issued this time as the first Wowoo Token. WWB is scheduled to be issued on the NEO blockchain.\n\nWowoo is a virtual ecosystem, which is consisted of Wowoo Platform as the core service, Wowoo Tokens as proprietary crypto-assets that supports the ecosystem, and Wowoo System as the computer infrastructure. Wowoo platform is a virtual service foundation, which is designed to create value towards inspiring contents. Wowers and Wowees of the platform can represent their gratitude in forms of crypto-assets and Wowoo Tokens. Wowoo system administrates the generation of wowoo Tokens and controls multiple functions of Wowoo Platform, including related products and its users. This system generates all Wowoo Tokens including the series of WowBit.\n\nBenefits of Wowoo\nWowoo platform is designed as a virtual service foundation, which enable to create value towards inspiring events. The service foundation will be built on NEO’s platform, to accelerate the smart economy and acquire fast and secure transactions within each community that our service is used in.\n\nWowoo Wallet\nWowoo Wallet were developed for its users to casually and securely manage variety of tokens inside their smartphones. Using Wowoo Wallet, users will be able to store and manage over 100 types of cryptocurrencies and tokens, including Bitcoin, Ethereum, BitcoinCash, etc., without entrusting any third parties for its care within their mobile devices.\n\nWowBit (WWB) is the first token generated by the Wowoo System, and are distributed in this token sale. In order to achieve the decentralized ecosystem, the framework of Wowoo has the following three features;\n\n1. Applicable – designable rights by Smart-Active-Control (SAC)\nThe biggest feature of Wowoo Token issued by Wowoo platform is the applicability of the design of inherent rights in Wowoo Token and its derivative new token. It is possible to design not only rights such as real estate with economic value but also voting rights of popularity vote. Escrow settlement in commercial transactions is also possible. Token Sale users who use the Wowoo platform can easily include their industry characteristics and design intent. However, in order to maintain soundness the design requires review and approval by the Wowoo Council (\"Counsil”).\n\n2. Stabilized – Reserve System\nThe Wowoo stores reserves to conserve the monetary value of Wowoo Token. We will save the minimum reserves by the Base Cryptocurrency at a certain conversion rate (“CR”) to stabilise the monetary value. In case of the WowBit, the default CR is 20%. The Wowoo Operator always operates new WowBit issue volume so that the reserved value of the Base Cryptocurrency is kept 20% of the total value of WowBit. This system allows maintaining the equivalent and fair balance between buyer and seller.\n\n3. Autonomous – Special Resolution\nEven if we design a perfect token, we might be forced to revise the fundamental rules someday in the future. It might be a revision of the issue amount upper limit of Wowoo Tokens or a revision of reserve ratio. The Wowoo Operator believes that such important agendas should be decided by the vote of the token holders, which is considered as a merit of the decentralized ecosystem. For this reason, we have inhered the special resolution function from the beginning.\nThe proposed agenda shall be approved by the Committee and will be passed by 2/3 of the number of votes of the respective Wowoo holders. Token Sale users generating derivative tokens using the Wowoo platform can also use this special resolution function.\n\nThese three functions will be built by developing Wowoo System, Wowoo Token and related products such as a secure Wowoo wallet.","developer_score":0.0,"id":"wowbit","image":{"large":"https://assets.coingecko.com/coins/images/4204/large/wowoo_tokenicon.png?1547039505","small":"https://assets.coingecko.com/coins/images/4204/small/wowoo_tokenicon.png?1547039505","thumb":"https://assets.coingecko.com/coins/images/4204/thumb/wowoo_tokenicon.png?1547039505"},"links":{"announcement_url":["http://wowoonet.com/news.html"],"blockchain_site":["https://neotracker.io/asset/40bb36a54bf28872b6ffdfa7fbc6480900e58448"],"chat_url":["https://t.me/bitzCN"],"homepage":["http://wowoonet.com/"],"telegram_channel_identifier":"wowooofficial"},"liquidity_score":0.0,"market_cap_rank":438,"name":"Wowbit","public_interest_score":20.355,"symbol":"wwb","tickers":[]}