{"address":"0x419D0d8BdD9aF5e606Ae2232ed285Aff190E711b","coingecko_rank":380,"coingecko_score":32.571,"community_score":45.199,"description":"FunFair is an <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a>-based platform for online casino gaming. Targeting the $47B online gambling market, FunFair isn’t actually a casino. Instead, the underlying gaming technology is licensed out to casinos and other gambling platforms. The FunFair team is attempting to solve some of the biggest problems online casinos face: slow performance, high operating costs, and lack of user trust. Through the use of blockchain technology and Fate Channels, an in-house built version of state channels, the products they license have the potential fix all of them.\n\nFUN is an ERC-20 token that you use in every part of the FunFair platform. It’s the only token accepted for in-game credits, how game creators in the marketplace are paid, what casinos must pay their licensing with and receive revenues in, and all fees on the platform must be paid in FUN. A total of 11,000,000,000 FUN tokens were created on June 22, 2017, and no more will be created. With a fixed supply, the token is deflationary and should experience sharp increases in price over time as demand for it increases. Furthermore, the FUN that’s paid as fees will be burned for the first two years which should further drive price upwards. Casinos can also stake the FUN tokens in their bankrolls to receive additional dividends.\n\nThe 30+ person FunFair team is based out of London and is led by Jez San, OBE. San’s entire career has revolved around entrepreneurship and the computer gaming industry. He founded Argonaut Software as a teen and created the first chip to power 3D games like Star Fox and Harry Potter. Rounding out his resume, San also founded the 3D online poker room, PKR, and is an investor in one of the world’s leading cryptocurrency exchanges, Kraken. Other members of the team are just as impressive. Jeremy Longley, founder and CTO, co-founded PKR with San and has over 15 years of experience managing development teams. FunFair COO, David Greyling, was previously the International Director of William Hill – a worldwide betting and gaming company.\n\nFunFair is attempting to enter the gigantic online gaming market by providing a solution that’s unique to the blockchain industry. Instead of acting as a casino, the company is licensing out their technology to other casinos which helps to mitigate their liability and risk. The project already has a working product and plans to launch early this year. With the wealth of experience that the team has in the gaming space, it’s hard to see this project failing. If FunFair can overcome the market domination of current incumbents using traditional technology, blockchain-based casino games could be the new industry paradigm.","developer_score":0.0,"id":"funfair","image":{"large":"https://assets.coingecko.com/coins/images/761/large/funfair.png?1548126630","small":"https://assets.coingecko.com/coins/images/761/small/funfair.png?1548126630","thumb":"https://assets.coingecko.com/coins/images/761/thumb/funfair.png?1548126630"},"links":{"bitcointalk_thread_identifier":1968383,"blockchain_site":["https://enjinx.io/eth/token/0x419d0d8bdd9af5e606ae2232ed285aff190e711b","https://etherscan.io/token/0x419d0d8bdd9af5e606ae2232ed285aff190e711b","https://ethplorer.io/address/0x419d0d8bdd9af5e606ae2232ed285aff190e711b"],"homepage":["https://funfair.io/"],"subreddit_url":"https://www.reddit.com/r/FunfairTech","twitter_screen_name":"FunFairTech"},"liquidity_score":25.811,"market_cap_rank":146,"name":"FunFair","public_interest_score":30.087,"symbol":"fun","tickers":[{"base":"FUN","market":{"identifier":"altilly","name":"Altilly"},"target":"DOGE"},{"base":"FUN","market":{"identifier":"forkdelta","name":"ForkDelta"},"target":"ETH"},{"base":"FUN","market":{"identifier":"hitbtc","name":"HitBTC"},"target":"USD"},{"base":"FUN","market":{"identifier":"idex","name":"Idex"},"target":"ETH"},{"base":"FUN","market":{"identifier":"latoken","name":"LATOKEN"},"target":"BTC"},{"base":"FUN","market":{"identifier":"latoken","name":"LATOKEN"},"target":"ETH"},{"base":"FUN","market":{"identifier":"livecoin","name":"Livecoin"},"target":"BTC"},{"base":"FUN","market":{"identifier":"wazirx","name":"WazirX"},"target":"BTC"},{"base":"FUN","market":{"identifier":"wazirx","name":"WazirX"},"target":"USDT"}]}