{"address":"0x41dBECc1cdC5517C6f76f6a6E836aDbEe2754DE3","coingecko_rank":405,"coingecko_score":32.09,"community_score":26.037,"description":"Medicalchain uses blockchain technology to securely store health records and maintain a single version of the truth. The different organizations such as doctors, hospitals, laboratories, pharmacists and health insurers can request permission to access a patient’s record to serve their purpose and record transactions on the distributed ledger. Medicalchain provides solutions to today’s health record problems. The platform is built to securely store and share electronic health records. By digitizing health records and empowering users we can leverage countless industry synergies.\n\nMedicalchain is building a platform for secure storage and utilization of electronic health records on the blockchain. The company is also building a telemedicine platform to allow users to directly connect with healthcare professionals, share their records and get consultations, second opinions, online through a secure channel.The company was originally founded in February 2016 to provide a software solution inside hospitals. The solution is known as ‘Discharge Summary’ and it uses a workflow tool to accurately write an assessment of a patient as they are being discharged from surgery or a long hospital visit. The software is currently being used by hospitals in UK and the team decided to extend this project and go further with Medicalchain.\n\nMedicalchain wants people to have access to their health records everywhere. Today, you can travel far and wide and you will have access to your phone, contacts, photos, files, bank accounts but not your health records - probably the most important and life saving information you need. In most developed countries around the world you, as a patient, have a legal right to request your records. Medicalchain is providing you with a platform to do that. But more importantly, Medicalchain wants its users to be able to use it immediately by communicating and sharing (on a time limited basis) with other doctors. The bigger vision is to allow pharmaceutical, insurance and other healthcare organisations and stakeholders to be able to interact with health records on patients' terms. Medicalchain believes that health records should be a part of everyone’s life and not just referred to when someone is ill.","developer_score":39.019,"id":"medicalchain","image":{"large":"https://assets.coingecko.com/coins/images/2850/large/medicalchain.png?1547037019","small":"https://assets.coingecko.com/coins/images/2850/small/medicalchain.png?1547037019","thumb":"https://assets.coingecko.com/coins/images/2850/thumb/medicalchain.png?1547037019"},"links":{"announcement_url":["https://medicalchain.com/en/news/"],"bitcointalk_thread_identifier":2113942,"blockchain_site":["https://enjinx.io/eth/token/0x41dbecc1cdc5517c6f76f6a6e836adbee2754de3","https://etherscan.io/token/0x41dbecc1cdc5517c6f76f6a6e836adbee2754de3","https://ethplorer.io/address/0x41dbecc1cdc5517c6f76f6a6e836adbee2754de3"],"facebook_username":"medicalchain","homepage":["https://medicalchain.com/en/"],"repos_url":{"github":["https://github.com/medicalchain/medicalchain-api-docs"]},"subreddit_url":"https://www.reddit.com/r/medicalchain/","telegram_channel_identifier":"medicalchain","twitter_screen_name":"medical_chain"},"liquidity_score":13.17,"market_cap_rank":682,"name":"Medicalchain","public_interest_score":24.566,"symbol":"mtn","tickers":[{"base":"MTN","market":{"identifier":"coinbene","name":"CoinBene"},"target":"ETH"},{"base":"MTN","market":{"identifier":"forkdelta","name":"ForkDelta"},"target":"ETH"},{"base":"MTN","market":{"identifier":"gate","name":"Gate.io"},"target":"ETH"},{"base":"MTN","market":{"identifier":"gate","name":"Gate.io"},"target":"USDT"},{"base":"MTN","market":{"identifier":"huobi_korea","name":"Huobi Korea"},"target":"BTC"}]}