{"address":"0x4257D36dF231DC71F7B7a6E1bE3Ef9C99B9181fD","coingecko_rank":1866,"coingecko_score":15.816,"community_score":11.256,"description":"SuperStarLink — Redefines the approach to credential building and background verification checks using blockchain technology.\n\nSuperstarlink — Blockchain, is being developed to plug all these leakages in the recruitment processes while also creating an ecosystem for all participants be it an Individual, Institution or organization to connect and find the best fit matching their credentials and requirements for the job. Definitely an ecosystem to link the past, present and future.\n\nFor the Organization, Automated pre-screening of employee credentials (using smart resume) using state of the art AI-DPL, big data and decentralized background verification checks (BVC) using Blockchain through only a few clicks, gets the right employees for the hiring managers. Thereby, saving millions that can route back into their core business.\n\nFor the Individuals, Credentials score builder, digitally certified credentials and peer reviewed smart resumes add a fourth dimension while choosing their employer of choice.\n\nFor the Institutions/Universities, ecosystem allows issuance of digitally verified certificates for the individuals in a decentralized platform while still maintaining the confidentiality and reliability of the information.\n\nYes, while there’s always a an opportunity for you to go the trial and error route in the recruitment process, through SUPERSTARLINK, we want you to get it right first time, every time.","developer_score":0.0,"id":"superstar","image":{"large":"https://assets.coingecko.com/coins/images/6362/large/SST_256x256.png?1547042458","small":"https://assets.coingecko.com/coins/images/6362/small/SST_256x256.png?1547042458","thumb":"https://assets.coingecko.com/coins/images/6362/thumb/SST_256x256.png?1547042458"},"links":{"announcement_url":["https://medium.com/@SuperStarLink"],"blockchain_site":["https://enjinx.io/eth/token/0x4257d36df231dc71f7b7a6e1be3ef9c99b9181fd","https://etherscan.io/token/0x4257d36df231dc71f7b7a6e1be3ef9c99b9181fd","https://ethplorer.io/address/0x4257d36df231dc71f7b7a6e1be3ef9c99b9181fd"],"chat_url":["https://superstarlink.slack.com/"],"facebook_username":"superstarlink","homepage":["https://superstarlink.com/"],"telegram_channel_identifier":"SuperStarLink","twitter_screen_name":"superstarlinks"},"liquidity_score":1.0,"market_cap_rank":1157,"name":"SuperStar","public_interest_score":32.752,"symbol":"sst","tickers":[]}