{"address":"0x42BEdD647E387daBeC65A7dc3A3bAbCc68BB664d","coingecko_rank":1569,"coingecko_score":17.056,"community_score":32.464,"description":"Blockmason is excited to announce the creation of our second blockchain industry revolutionizing product: Blockmason Link!\n\nAt its core, Link removes the barriers to interact with smart contracts, allowing developers to instantly turn smart contracts on any programmatic blockchain into user-friendly applications. We’ll use Ethereum smart contracts as the example throughout this whitepaper, but Link is main-chain agnostic and is architected in a manner that is adaptable to the leading smart contract supporting main-chains without a native Web API layer.\n\nLink solves some of the most persistent and pervasive problems plaguing the blockchain community: ease-of-use and accessibility. While Bitcoin and Ethereum have grown in the public consciousness, blockchain still primarily functions as a vehicle for cryptocurrency trading and other financial applications.\n\nAt Blockmason, we are true blockchain believers — it is only a matter of time until blockchain spurs the healthcare revolution, empowers economic freedom in developing countries, and stabilizes our fragile mass payment systems. However, it is impossible to realize this beautiful crypto-future until the completion of essential components of blockchain infrastructure.\n\nBlockchain has a high barrier to entry. From a development perspective, it requires learning Solidity, cryptography APIs, and the nuances of esoteric decentralized systems. From a user perspective, the hesitation is even simpler: decentralized applications are too damn tough to use! In a world that increasingly values convenience, it’s difficult to convince people to increase their DApp usage when usage necessitates so many prerequisites, including creating and learning to use an Ethereum wallet, MetaMask, safely storing your private keys, and so on. Just try explaining to someone the long-term benefits of decentralized contracts when even those in charge of regulating new technologies have no idea how they work. All the public thinks is: why use a “smart contract,” when dumb contracts work just fine? Why use Lndr, when I could use Venmo?\n\nWhich brings us to one of Blockmason’s core beliefs: for an emerging technology to succeed, it must value the user. For too long, the blockchain community has ignored functionality, in favor of niche technical development, finance, or profit — hindering mass adoption. This is not to say we don’t love nerdy, precise technical advancement (we do!), but rather that we believe a smooth, exciting user experience is a necessary part of technological growth.\n\nFully realizing the potential of blockchain technology requires the mass adoption of blockchain technology. Mass adoption requires an enhanced user experience, which itself requires technological innovation. Conversely, any technical breakthrough, regardless of its importance, is squandered if it does not solve the user experience. Greater access to technology leads to greater technological advancement. Just think of us as blockchain’s “Typhoid Mary.”\n\nBlockmason Link — the missing block in blockchain’s ever growing tower. An innovation that sparks innovation.","developer_score":0.0,"id":"blockmason-link","image":{"large":"https://assets.coingecko.com/coins/images/8525/large/link-by-blockmason.jpg?1559103173","small":"https://assets.coingecko.com/coins/images/8525/small/link-by-blockmason.jpg?1559103173","thumb":"https://assets.coingecko.com/coins/images/8525/thumb/link-by-blockmason.jpg?1559103173"},"links":{"announcement_url":["https://medium.com/@blockmason"],"blockchain_site":["https://etherscan.io/token/0x42bedd647e387dabec65a7dc3a3babcc68bb664d","https://ethplorer.io/address/0x42bedd647e387dabec65a7dc3a3babcc68bb664d","https://explorer.binance.org/asset/BLINK-9C6"],"facebook_username":"blockmasonio","homepage":["https://blockmason.link/"],"repos_url":{"github":["https://github.com/blockmason/link-token"]},"subreddit_url":"https://www.reddit.com/r/blockmason/","telegram_channel_identifier":"blockmasonlink","twitter_screen_name":"blockmasonio"},"liquidity_score":31.108,"market_cap_rank":4001,"name":"BlockMason Link","public_interest_score":27.183,"symbol":"blink","tickers":[{"base":"BLINK-9C6","market":{"identifier":"binance_dex","name":"Binance DEX"},"target":"BNB"},{"base":"BLINK","market":{"identifier":"bitsonic","name":"Bitsonic"},"target":"KRW"}]}