{"address":"0x4289c043A12392F1027307fB58272D8EBd853912","coingecko_rank":1478,"coingecko_score":18.082,"community_score":6.229,"description":"AiLink is a trusted user-friendly open social platform based on blockchain. In AiLink Ecology, the user's behavior data will be recorded on the node of blockchain, which can not be tampered with, and the transaction behaviors of participants in all social networks are realized and constrained by smart contract technology. Under the premise of ensuring the privacy of users, anyone can depict the user's digital portraits through the data on the blockchain, and determine whether the person is credible by the blockchain score, thereby greatly reduce the trust cost between people and build a highly trusted ecosystem.\n\nOn the basis of trust, AiLink will directly break through six degrees of separation. Users can directly connect to or conclude transactions with any node on the network at a low cost, so that information and value can be effectively spread throughout the blockchain network. Then, publishers will achieve their goals, communicators will get token rewards, benefiting all nodes spread throughout the network.\n\nIn addition, AiLink capture and process massive users open data on blockchain networks with AI operations, design unique formulas, match users with high affinity, to achieve the desired results, such as in the same crowd of music lovers, the probability of the person matching the music preferences matches is higher depending on the user's preference for the genre of music. The frequency of interaction between users will also be used to calculate friends degree, so as to continuously improve the relationship between friends.\n\nAt the same time, AiLink will provide more user-friendly applications, AiLink will start with social games, let users get the concept and value of blockchain more simply and directly, then improve the entire social ecosystem gradually.","developer_score":12.0,"id":"ailink-token","image":{"large":"https://assets.coingecko.com/coins/images/5917/large/ailink-token.png?1547041855","small":"https://assets.coingecko.com/coins/images/5917/small/ailink-token.png?1547041855","thumb":"https://assets.coingecko.com/coins/images/5917/thumb/ailink-token.png?1547041855"},"links":{"blockchain_site":["https://enjinx.io/eth/token/0x4289c043a12392f1027307fb58272d8ebd853912","https://etherscan.io/token/0x4289c043a12392f1027307fb58272d8ebd853912","https://ethplorer.io/address/0x4289c043a12392f1027307fb58272d8ebd853912"],"chat_url":["https://t.me/ailinkofficial2"],"facebook_username":"ailinkofficial","homepage":["http://ailink.in/pc.html"],"repos_url":{"github":["https://github.com/ailinkofficial/ailink"]},"telegram_channel_identifier":"ailinkofficial","twitter_screen_name":"ailinkofficial"},"liquidity_score":5.397,"market_cap_rank":1019,"name":"AiLink Token","public_interest_score":24.557,"symbol":"ali","tickers":[{"base":"ALI","market":{"identifier":"bilaxy","name":"Bilaxy"},"target":"ETH"},{"base":"ALI","market":{"identifier":"coinbene","name":"CoinBene"},"target":"ETH"},{"base":"ALI","market":{"identifier":"coineal","name":"Coineal"},"target":"ETH"},{"base":"ALI","market":{"identifier":"lbank","name":"Lbank"},"target":"ETH"}]}