{"address":"0x4672bAD527107471cB5067a887f4656D585a8A31","coingecko_rank":493,"coingecko_score":29.773,"community_score":27.537,"description":"Dropil offers a full investing suite including financial planning, retirement savings, and of course trading. Their primary target market is inexperienced investors who are looking for an easy way to enter into the cryptocurrency markets, but they also have something to offer the more experienced investor, cryptocurrency and otherwise. And they claim to be able to set-up investment planning for anyone, regardless of their risk tolerance or background. Of course the main selling point of Dropil is the automation of the cryptocurrency trading process. The platform requires little input from investors and claims it will deliver high profit margins and minimal risk of losses.\n\nA second part of the Dropil platform is the Arthur bot. This bot is the risk management bot, which manages investor portfolios and also provides arbitrage analysis. While it is less complex than Dex, it is still important as it will monitor up to 13 different exchanges and 10 different coins to find arbitrage opportunities for you. What is most important to note is that this can all be done without the use of an API as well as no user accounts needed. Future plans include expanding this functionality.\n\nThe final aspect of the Dropil ecosystem is the DROP token, which is an <a href=\"https://www.coingecko.com/en/coins/ethereum\">ERC-20</a> token that was created to help ensure privacy, while also powering the internal economy of Dropil. The team chose to use the ERC20 protocol to help foster compatibility and quick exchange executions to benefit the entire community. The DROP token has a total supply of 30 billion coins, which was determined to be an optimal amount for asset management by the developers. It was also chosen with the optimal user base in mind, as well as the need for coins to be traded and achieve widespread adoption. The need to use the DROP token to access the feature of Dropil should ensure a good implementation and demand for the token.\n\nDropil looks like an interesting project that is tackling the complexity of investing in cryptocurrencies. The idea of automated trading, investing and arbitrage is a compelling one, but it does sound familiar. Stocks, commodities and forex all have these types of automated systems, or robots, that promise guaranteed returns. I have yet to come across one that is reliable in the long term. Perhaps the artificial intelligence algorithm is advanced enough to change that. Perhaps cryptocurrency market movements are easier to analyze and predict.","developer_score":12.415,"id":"dropil","image":{"large":"https://assets.coingecko.com/coins/images/2587/large/drop.png?1547036723","small":"https://assets.coingecko.com/coins/images/2587/small/drop.png?1547036723","thumb":"https://assets.coingecko.com/coins/images/2587/thumb/drop.png?1547036723"},"links":{"bitcointalk_thread_identifier":2795128,"blockchain_site":["https://enjinx.io/eth/token/0x4672bad527107471cb5067a887f4656d585a8a31","https://etherscan.io/token/0x4672bad527107471cb5067a887f4656d585a8a31","https://ethplorer.io/address/0x4672bad527107471cb5067a887f4656d585a8a31"],"facebook_username":"DropilCoin","homepage":["https://dropil.com/"],"repos_url":{"github":["https://github.com/Dropil/Token"]},"subreddit_url":"https://www.reddit.com/r/Dropil/","telegram_channel_identifier":"dropil","twitter_screen_name":"dropilcoin"},"liquidity_score":27.027,"market_cap_rank":369,"name":"Dropil","public_interest_score":24.577,"symbol":"drop","tickers":[{"base":"DROP","market":{"identifier":"idax","name":"Idax"},"target":"BTC"},{"base":"DROP","market":{"identifier":"idax","name":"Idax"},"target":"ETH"},{"base":"DROP","market":{"identifier":"idex","name":"Idex"},"target":"ETH"},{"base":"DROP","market":{"identifier":"tidex","name":"Tidex"},"target":"BTC"},{"base":"DROP","market":{"identifier":"tidex","name":"Tidex"},"target":"ETH"}]}