{"address":"0x4946Fcea7C692606e8908002e55A582af44AC121","coingecko_rank":748,"coingecko_score":26.437,"community_score":35.852,"description":"FOAM is an open protocol for proof of location on Ethereum. Our mission is to build a consensus driven map of the world, empowering a fully decentralized web3 economy with verifiable location data. FOAM incentivizes the infrastructure needed for privacy-preserving and fraud-proof location verification. The starting point for FOAM is static proof of location, where a community of Cartographers curate geographic Points of Interest on the FOAM map. Through global community-driven efforts, FOAM’s dynamic proof of location protocol will enable a permissionless and privacy-preserving network of radio beacons that is independent from external centralized sources and capable of providing secure location verification services.\n\nFOAM Token Functionality\n1. Add and Curate Geographic Points of Interest\nThe FOAM Spatial Index Visualizer allows Cartographers to participate in interactive TCR POIs on a map. Users can add points to the map, validate new candidates and verify the map by visiting real world locations. The FOAM Token Curated Registry unlocks mapping in a secure and permissionless fashion and allows locations to be ranked and maintained by token balances. Users can deposit FOAM Tokens into POIs on the map to increase attention those POIs might receive.\n\n2. Signal for Zone Incentivisation\nA further potential use of the FOAM Token by Cartographers is to stake their FOAM Tokens to Signal. Signaling is a mechanism designed to allow Cartographers to incentivize the expansion and geographic coverage of the FOAM network. To Signal, a Cartographer stakes FOAM Tokens to a Signaling smart contract by reference to a particular area. These staked tokens serve as indicators of demand, and are proportionate to (i) the length of time staking (the earlier, the better), and (ii) the number of tokens staked (the less well-served areas, the better). In the context of the contingent Dynamic Proof of Location concept (described further in the Product Whitepaper), these indicators are the weighted references that determine the spatial mining rewards.\n\n3. Contribute to Potential Secure Location Services as Zone Anchor or Verifier\nThe FOAM protocol may allow users to provide work and secure localization services and location verification for smart contracts and be rewarded for their own efforts with new FOAM Tokens in the form of mining rewards. Devices and real world contracts can be programmed to designate attestations and track interactions and transactions on the map. With the addition of necessary radio hardware by individual users and the grass roots expansion of the FOAM network, it may be possible for location status to be proved in a different manner. Location could be proved through a time synchronization protocol that would ensure continuity of a distributed clock, whereby specialized hardware could synchronize nodes’ clocks over radio to provide location services in a given area. As explained further in the following paragraph, this ‘Dynamic Proof of Location’ is contingent on a number of factors outside of Foamspace’s control.","developer_score":0.0,"id":"foam-protocol","image":{"large":"https://assets.coingecko.com/coins/images/3345/large/K51lJQc.png?1547037959","small":"https://assets.coingecko.com/coins/images/3345/small/K51lJQc.png?1547037959","thumb":"https://assets.coingecko.com/coins/images/3345/thumb/K51lJQc.png?1547037959"},"links":{"announcement_url":["https://t.me/Foamprotocol"],"blockchain_site":["https://enjinx.io/eth/token/0x4946fcea7c692606e8908002e55a582af44ac121","https://etherscan.io/token/0x4946fcea7c692606e8908002e55a582af44ac121","https://ethplorer.io/address/0x4946fcea7c692606e8908002e55a582af44ac121"],"chat_url":["https://gitter.im/f-o-a-m/"],"facebook_username":"foamprotocol","homepage":["https://www.foam.space/"],"official_forum_url":["http://discourse.foam.space"],"repos_url":{"github":["https://github.com/f-o-a-m/","https://github.com/f-o-a-m/foam.css","https://github.com/f-o-a-m/plasma-demo"]},"subreddit_url":"https://www.reddit.com/r/foamprotocol/","telegram_channel_identifier":"foamspace","twitter_screen_name":"foamspace"},"liquidity_score":7.34,"market_cap_rank":219,"name":"FOAM","public_interest_score":33.043,"symbol":"foam","tickers":[{"base":"FOA","market":{"identifier":"ethfinex","name":"Ethfinex"},"target":"ETH"},{"base":"FOA","market":{"identifier":"ethfinex","name":"Ethfinex"},"target":"USD"},{"base":"FOAM","market":{"identifier":"uniswap","name":"Uniswap"},"target":"ETH"}]}