{"address":"0x49bD2DA75b1F7AF1E4dFd6b1125FEcDe59dBec58","coingecko_rank":5751,"coingecko_score":2.51,"community_score":0.0,"description":"Linkey Blockchain World Bank (simple as Linkey), is the first decentralized financial services institution supplies professional digital asset related product in the world. Based on the advanced public chain and community of technicians and financial elites from the world, Linkey provides comprehensive, safe, convenient and professional asset management and value-added services to customers. Linkey covers the business scope like savings, investment banking, insurance trust, futures, investment management and wealth management of the digital asset area and promotes the development of digital asset investment. With abundant digital financial services, Linkey provides a safe, convenient and decentralized one-stop digital asset investment management program. Customers can join the lower risk business, like saving and deposit in traditional bank; otherwise, customers can also invest financial products with low to medium level risk; even more, future products, private funds and ICO related products with high risk and profits are also supplied to customers. Through the comprehensive digital asset investing services, customers can choose and allocate their digital asset investment plan freely, which will greatly enhance the professional and effectiveness of their digital asset investment.","developer_score":0.0,"id":"linkey","image":{"large":"https://assets.coingecko.com/coins/images/5540/large/linkey.png?1547041332","small":"https://assets.coingecko.com/coins/images/5540/small/linkey.png?1547041332","thumb":"https://assets.coingecko.com/coins/images/5540/thumb/linkey.png?1547041332"},"links":{"blockchain_site":["https://etherscan.io/token/0x49bd2da75b1f7af1e4dfd6b1125fecde59dbec58","https://ethplorer.io/address/0x49bd2da75b1f7af1e4dfd6b1125fecde59dbec58"],"chat_url":["https://0.plus/#/joinchat/IF_0PxImgca99nuTloLNeQ"],"facebook_username":"wix","homepage":["https://www.linkey.info/"]},"liquidity_score":0.0,"market_cap_rank":2434,"name":"Linkey","public_interest_score":25.1,"symbol":"lky","tickers":[{"base":"LKY","market":{"identifier":"bcex","name":"BCEX"},"target":"CKUSD"},{"base":"LKY","market":{"identifier":"bcex","name":"BCEX"},"target":"USDT"}]}