{"address":"0x4A42d2c580f83dcE404aCad18dab26Db11a1750E","coingecko_rank":2439,"coingecko_score":10.894,"community_score":25.951,"description":"Relex is the world's first real estate development cryptocurrency. We have multiple development projects already running, such as Cocobay Danang and Marine City in Vietnam, and we are offering the world's first real estate pre-IPO blockchain offering before the fund lists on the New York Stock Exchange. For transparency, all of our contracts are posted on our website.\n\nRelex is a blockchain based funding vehicle creation of the parent company Squawk Advisors Inc. Squawk Advisors has an FDI development portfolio across multiple countries in the world. The Squawk group of companies has been contracting with FDI projects since 2014, and this Fall 2017, we are bringing our offerings onto the blockchain, such as Cocobay Danang, with its iconic tower seen here.\n\nRelex is the world's first cryptocurrency based real estate developer opportunity. RLX holders have the opportunity to invest in projects during the development phase, which results in exciting opportunities such as proxy ownership of resorts, shopping malls, offices, and more. And gain more rights as a proxy developer, having your voice heard regarding design and implementation of the final master plan.\n\nThere is now a better way to access yield, while retaining your standards for high transparency and high accountability for your investable capital. Introducing Relex, the world's first real estate development focused cryptocurrency, designed to provide better and simplified access for investors to high-yield projects around the world, while qualifying real estate projects to a higher level of transparency in order to be eligible for institutional capital consideration. We support projects in both developed and developing markets that strive to set the bar higher in the interest of project integrity.\n\nAccording to Jones Lang Lasalle's Global Real Estate Transparency Index 2016, almost 75% of global capital invested in commercial real estate is in the Top 10 most transparent countries in the world. That means that projects in countries with low transparency scores are considered ineligible projects for investment. What if transparency scores in projects located in developing countries were improved, upgrading these projects and making them eligible for a wider stream of capital consideration? Relex is solving this problem by increasing transparency and accountability standards for real estate development projects in developing nations with low transparency scores, and aligns itself with projects that are committed to transparency, integrity, and accountability in their real estate projects. With Relex, the projects that we partner with agree to fund their development projects on the Relex blockchain, and agree to a more strict line of transparency and accountability standards.\n\nIn turn, projects on the Relex blockchain get an increased transparency and accountability score, and become eligible for a wider stream of investable capital into their projects. This is a win-win situation for both the investor and the project owners, in which there is better capital access, and better access to real estate development projects with a high degree of yield.","developer_score":0.0,"id":"relex","image":{"large":"https://assets.coingecko.com/coins/images/1799/large/relex.jpg?1547036103","small":"https://assets.coingecko.com/coins/images/1799/small/relex.jpg?1547036103","thumb":"https://assets.coingecko.com/coins/images/1799/thumb/relex.jpg?1547036103"},"links":{"bitcointalk_thread_identifier":2075473,"blockchain_site":["https://enjinx.io/eth/token/0x4a42d2c580f83dce404acad18dab26db11a1750e","https://etherscan.io/token/0x4a42d2c580f83dce404acad18dab26db11a1750e","https://ethplorer.io/address/0x4a42d2c580f83dce404acad18dab26db11a1750e"],"chat_url":["https://t.me/relex_rus"],"facebook_username":"RelexTalk","homepage":["https://relex.io/"],"subreddit_url":"https://www.reddit.com/r/RelexRLX/","telegram_channel_identifier":"relex_core","twitter_screen_name":"RelexTalk"},"liquidity_score":1.0,"market_cap_rank":4751,"name":"Relex","public_interest_score":42.062,"symbol":"rlx","tickers":[{"base":"RLX","market":{"identifier":"idex","name":"Idex"},"target":"ETH"},{"base":"RLX","market":{"identifier":"latoken","name":"LATOKEN"},"target":"BTC"},{"base":"RLX","market":{"identifier":"latoken","name":"LATOKEN"},"target":"ETH"}]}