{"address":"0x4CC19356f2D37338b9802aa8E8fc58B0373296E7","coingecko_rank":121,"coingecko_score":44.161,"community_score":31.816,"description":"SelfKey provides organizations and individuals with complete ownership over their own digital identity, empowering them to discover additional privacy and freedom. SelfKey is a self-sovereign identity system that is based on the blockchain and can provide control and management of digital identities to users. Additionally, users can utilize SelfKey to securely manage a crypto portfolio and instantly onboard immigration, cryptocurrency, and financial services. One of the unique aspects of SelfKey is its ability to work as an all-in-one identity solution for self-sovereignty. SelfKey utilizes a novel approach to identity management while also resolving the issues related to existing centralized identity management systems. These include the lack of accessibility to financial services and the tedious KYC processes that are paper based.\n\nOne of the standout features of SelfKey is the self-hosted data storage. This lets you secure your identity documents and assets locally, so there is no risk of a major data breach as with other similar systems. The KYC processes within SelfKey also stand out for their efficiency. Qualified certifiers can provide you with reusable identity authentication upon request. You can then share this authentication multiple times with several service providers. This, in turn, prevents you from wasting time and effort with a traditional KYC onboarding process that is typically tedious. SelfKey additional minimizes data because of its blockchain-based verifiable claims protocol. This protocol lets you as an identity owner prove you meet the ID attributes required for a specific service or product without any need to actually share your identity document. In other words, you can provide proof of your ID without sharing the ID, keeping the data you send to a minimum. Of course, SelfKey also provides the full functionality you want from a cryptocurrency wallet, including the ability to securely manage cryptocurrency assets like ETH, KEY, and the other ERC-20 tokens.Edmund Lowell is the founder of SelfKey.\n\nOn his LinkedIn page, Edmund describes himself as an entrepreneur whose “skill sets lie at the crossroads of finance, technology, and law/regulations.” Additionally, he has been involved with other projects related to personal data protection, self-sovereign digital identity systems, blockchains, and distributed ledgers. Terry Lin is the product manager for this venture. In the past, Terry has been associated with many established projects including, AMZ Tracker, UBS and Build My Online Store. Lastly, Ari Propis is the accounting backbone of SelfKey. He has been in the crypto domain for more than five years and has previously worked as a consultant for various blockchain and international accounting startups. It was introduced into the market earlier this year, KEY tokens were initially traded at a modest price of US$0.08 per token.","developer_score":56.963,"id":"selfkey","image":{"large":"https://assets.coingecko.com/coins/images/2034/large/selfkey.png?1548608934","small":"https://assets.coingecko.com/coins/images/2034/small/selfkey.png?1548608934","thumb":"https://assets.coingecko.com/coins/images/2034/thumb/selfkey.png?1548608934"},"links":{"bitcointalk_thread_identifier":2310691,"blockchain_site":["https://enjinx.io/eth/token/0x4cc19356f2d37338b9802aa8e8fc58b0373296e7","https://etherscan.io/token/0x4cc19356f2d37338b9802aa8e8fc58b0373296e7","https://ethplorer.io/address/0x4cc19356f2d37338b9802aa8e8fc58b0373296e7"],"facebook_username":"SelfKeyNetwork","homepage":["https://selfkey.org"],"repos_url":{"github":["https://github.com/SelfKeyFoundation/Identity-Wallet"]},"subreddit_url":"https://www.reddit.com/r/selfkey","telegram_channel_identifier":"selfkeyfoundation","twitter_screen_name":"SelfKey"},"liquidity_score":37.019,"market_cap_rank":317,"name":"SelfKey","public_interest_score":26.027,"symbol":"key","tickers":[{"base":"KEY","market":{"identifier":"bilaxy","name":"Bilaxy"},"target":"BTC"},{"base":"KEY","market":{"identifier":"crex24","name":"CREX24"},"target":"BTC"},{"base":"KEY","market":{"identifier":"latoken","name":"LATOKEN"},"target":"ETH"},{"base":"KEY","market":{"identifier":"latoken","name":"LATOKEN"},"target":"USDT"},{"base":"179DE71E-4637-4241-B944-C6DD0F0CD88B","market":{"identifier":"lykke","name":"Lykke"},"target":"BTC"},{"base":"KEY","market":{"identifier":"p2pb2b","name":"P2PB2B"},"target":"BTC"},{"base":"KEY","market":{"identifier":"p2pb2b","name":"P2PB2B"},"target":"ETH"},{"base":"KEY","market":{"identifier":"p2pb2b","name":"P2PB2B"},"target":"USD"},{"base":"KEY","market":{"identifier":"tidex","name":"Tidex"},"target":"ETH"}]}