{"address":"0x4D8bfe7EA0f46486Fd40FC4df60CF39f7568BEE8","coingecko_rank":3607,"coingecko_score":6.837,"community_score":3.953,"description":"Incodium provides a rational way for investors to cope with the threat of exchange hacking by providing a ‘smart compensation protection’ service for eligible victims. Incodium connectivity platform is a revenue model for Incodium as well as an exclusive offering provided to INCO coin holders. It is accessible through the Incodium Mobile Wallet App. Incodium is a decentralized application (DApp) developed based on Ethereum with smart contract technology to provide exchange hacking protection – is the Incodium Wallet app, a personal mobile application that securely stores Incodium coins owned by individuals. The wallet communicates and interacts with the blockchain via the Ethereum Virtual Machine (EVM) as well as the Incodium API & ABI. By storing Incodium coins in the wallet, “smart compensation protection” automatically takes effect, and can be executed without the need for any intermediary. If a user holds Incodium coin in the Incodium Mobile Wallet and is the victim of an exchange hacking incident (an exchange where Incodium coin is listed), the user will be reimbursed in Incodium coin with the lowest of the following three values: 30 times the amount of Incodium coin held in the Incodium Mobile Wallet, the amount of actual damages or 10,000 USD.","developer_score":12.0,"id":"incodium","image":{"large":"https://assets.coingecko.com/coins/images/5126/large/incodium.png?1547973893","small":"https://assets.coingecko.com/coins/images/5126/small/incodium.png?1547973893","thumb":"https://assets.coingecko.com/coins/images/5126/thumb/incodium.png?1547973893"},"links":{"announcement_url":["https://medium.com/@incodiummate"],"bitcointalk_thread_identifier":4750004,"blockchain_site":["https://etherscan.io/token/0x4d8bfe7ea0f46486fd40fc4df60cf39f7568bee8","https://ethplorer.io/address/0x4d8bfe7ea0f46486fd40fc4df60cf39f7568bee8"],"facebook_username":"incodium.coin.33","homepage":["http://incodium.io"],"repos_url":{"github":["https://github.com/nemolab-project/incodium/"]},"telegram_channel_identifier":"incodium","twitter_screen_name":"IncodiumPte"},"liquidity_score":1.0,"market_cap_rank":5842,"name":"Incodium","public_interest_score":26.488,"symbol":"inco","tickers":[{"base":"INCO","market":{"identifier":"bitmart","name":"BitMart"},"target":"BTC"}]}