{"address":"0x4D9e23a3842fE7Eb7682B9725cF6c507C424A41B","coingecko_rank":1334,"coingecko_score":19.285,"community_score":6.705,"description":"CarBlock is the world’s first blockchain-based transportation solution built on data generated by smart devices. This circulation of car data on the blockchain is set to disrupt the entire connected car industry.\n\nP2P Car Rental\n\nThrough hardware enabled data collection and smart contracts, CarBlock eliminates unnecessary conflicts, any ambiguity in responsibilities and the loss of potential property for P2P rental transactions. CarBlock also provides greater safety and ease of use for P2P rental applications.\n\nAuto Insurance\n\nAuto insurance companies can boost their competitive edge by using CarBlock data to optimize their premium modeling and offer more tailored and flexible packages to customers. Car owners can also enjoy better pricing by authorizing insurance companies access to their car’s data and pay with CAR tokens to get their insurance coverage.\n\nUsed Car Dealerships and Car Reports\n\nThe immutability of the data on the CarBlock blockchain allows for the creation of trustworthy vehicle reports for used car transactions. Data owners can earn CAR tokens in exchange for granting third parties access to their data. Used car buyers and sellers can form better deals and enjoy safer transactions, knowing that the vehicle’s conditions have been verified with real data and smart contracts.\n\nWorking with amazing partners\nCarBlock is working with the US Connected Car Leader nonda as its anchor partner in order to leverage nonda's community and expand its current business services.","developer_score":12.679,"id":"carblock","image":{"large":"https://assets.coingecko.com/coins/images/5244/large/carblock.png?1547040731","small":"https://assets.coingecko.com/coins/images/5244/small/carblock.png?1547040731","thumb":"https://assets.coingecko.com/coins/images/5244/thumb/carblock.png?1547040731"},"links":{"announcement_url":["https://medium.com/carblock"],"blockchain_site":["https://enjinx.io/eth/token/0x4d9e23a3842fe7eb7682b9725cf6c507c424a41b","https://etherscan.io/token/0x4d9e23a3842fe7eb7682b9725cf6c507c424a41b","https://ethplorer.io/address/0x4d9e23a3842fe7eb7682b9725cf6c507c424a41b"],"homepage":["https://www.carblock.io/"],"repos_url":{"github":["https://github.com/carblock-io/IPFS-Mobile-JS"]},"telegram_channel_identifier":"CarBlockGlobal","twitter_screen_name":"carblock_io"},"liquidity_score":9.043,"market_cap_rank":877,"name":"CarBlock","public_interest_score":24.142,"symbol":"car","tickers":[]}