{"address":"0x4FE9f52Ec23f6805F2Fd0332a34Da4F1c135b024","coingecko_rank":863,"coingecko_score":25.309,"community_score":12.221,"description":"CAI.TODAY aims to build the world's largest quiz platform, with a cumulative number of registered users reaching 800,000 in just a few months. It is expected that more than 3 million people will participate in the quiz during the World Cup and will continue to grow rapidly.\n\n1. CAI.TODAY quiz platform, using blockchain technology, based on Ethereum ecological and smart contract, combined with the blockchain quiz platform built by industries such as sports events, finance, entertainment, games, etc., the world's first user to create quiz event business model .\n2. The CAI.TODAY quiz platform is based on the decentralized concept and it will not be controlled by any direct stakeholder group. Ensure that all users are in a fair, open and fair game environment. At the same time, CAI.TODAY has created a unique mining and dividend model, and 80% of the platform’s revenue rewards users who participate in the contest, ensuring that all participants’ interests are maximized.\n3. CAI.TODAY has reached strategic cooperation with many top agencies and media around the world, such as: FunCity Capital, OK Blockchain, Node Capital, Dragoon Capital, etc., which will promote CAI.TODAY to the world and create a globally valuable core product.\n\nIndustry&Facts & figures:\n1. The official PC version and H5 version have been put into operation (official website address: https://cai.today/);\n2. The content of the quiz has been part of the sporting events, including the five European leagues, the NBA, and the upcoming World Cup;\n3. At present, ETH and CAI Token have been supported for quiz, and more types of tokens will be accessed later;\n4. Later, more sports events and games, finance, entertainment and other quiz projects will be launched and the online APP version will be released.","developer_score":12.416,"id":"cai-token","image":{"large":"https://assets.coingecko.com/coins/images/4650/large/cai-token-logo.png?1547039916","small":"https://assets.coingecko.com/coins/images/4650/small/cai-token-logo.png?1547039916","thumb":"https://assets.coingecko.com/coins/images/4650/thumb/cai-token-logo.png?1547039916"},"links":{"announcement_url":["https://medium.com/@caitoday"],"blockchain_site":["https://enjinx.io/eth/token/0x4fe9f52ec23f6805f2fd0332a34da4f1c135b024","https://etherscan.io/token/0x4fe9f52ec23f6805f2fd0332a34da4f1c135b024","https://ethplorer.io/address/0x4fe9f52ec23f6805f2fd0332a34da4f1c135b024"],"facebook_username":"caitodayteam","homepage":["https://cai.today/#/"],"repos_url":{"github":["https://github.com/caitodayofficial/cai.today"]},"telegram_channel_identifier":"teamcaitoday","twitter_screen_name":"cai_today"},"liquidity_score":26.232,"market_cap_rank":751,"name":"Cai Token","public_interest_score":30.948,"symbol":"cai","tickers":[]}