{"address":"0x501262281B2Ba043e2fbf14904980689CDDB0C78","coingecko_rank":2702,"coingecko_score":9.382,"community_score":14.776,"description":"Mithril Ore Token serves as a decentralized, novel utility for advanced mining/staking. It is first in the market to be backed by Ethereum. As a result, it will serve as the first ‘Casper’ mining/staking pool to the digital token Market. ‘Casper’ is known as the ‘Proof of Stake’ or POS upgrade of the Ethereum blockchain. This particular upgrade goes green regarding energy usage, in which the Ethereum blockchain no longer uses energy-wasting ‘Proof of Work’ mining, but rather, more secure, energy saving POS. In order for POS to be profitable for those with limited Ether, they will need to pool Ether with others. Mithril Ore is the first advanced staking pool to the market, providing access to POS mining, and will utilize this service in a crowd-friendly way.\n\nOne hundred percent of the Ethereum raised in the Mithril Ore token crowdsale will be placed into the Ether Mining/Staking Pool – with none taken as profits. As an additional feature of the Mithril Ore token, all Ethereum created as a result of advanced staking from ‘Casper’ will be returned to the Mithril Ore Ether Pool; thereby, adding more Ethereum to the Mithril Ore Mining/Staking Pool.\n\nMithril Ore tokens are limited in number and therefore scarce. In future years, token holders may elect to offer and consolidate tokens with the “blacksmith option.” With consolidation, ‘blacksmith minted’ item tokens offer annual, limited time, limited edition tokens that connote concentrated values and voting privileges at the option of current token holders.","developer_score":12.0,"id":"mithril-ore","image":{"large":"https://assets.coingecko.com/coins/images/5783/large/Logo-Dark-Icon.png?1547041653","small":"https://assets.coingecko.com/coins/images/5783/small/Logo-Dark-Icon.png?1547041653","thumb":"https://assets.coingecko.com/coins/images/5783/thumb/Logo-Dark-Icon.png?1547041653"},"links":{"blockchain_site":["https://etherscan.io/token/0x501262281b2ba043e2fbf14904980689cddb0c78","https://ethplorer.io/address/0x501262281b2ba043e2fbf14904980689cddb0c78"],"facebook_username":"mithrilore","homepage":["http://www.mithrilore.io/"],"repos_url":{"github":["https://github.com/mithrilore/browser-solidity"]},"subreddit_url":"https://www.reddit.com/r/MithrilOre/","twitter_screen_name":"mithrilore"},"liquidity_score":0.0,"market_cap_rank":5847,"name":"Mithril Ore","public_interest_score":26.881,"symbol":"more","tickers":[]}