{"address":"0x543Ff227F64Aa17eA132Bf9886cAb5DB55DCAddf","coingecko_rank":219,"coingecko_score":37.528,"community_score":25.734,"description":"DAOstack is an operational stack for DAOs, a comprehensive toolkit for decentralized collaboration at scale. It provides the governance and economic framework needed for collectives to self-organize around shared goals and interests. DAOstack is based on a fully open, modular and upgradable architecture.\n\nDAOs are open, self-organized collectives coordinated by economic incentives and self-executing code, cooperating around shared goals. Powered by the network effect, DAOs provide a revenue model and incentive for the production of open, shareable resources (such as open-source code and a music file). With the creation of more open resources, the DAO will be able to scale indefinitely while keeping its agility and coherence,and in many cases out compete existing corporate structures. DAOs have attracted top talents in the blockchain space, holding promise for more efficient and resilient organizations. Despite this, they have lacked critical elements to be ​successfully ​deployed ​so ​far, ​and ​in ​particular ​an ​adequate ​decentralized ​governance ​system.\n\nDAOstack is an operating system for DAOs. With DAOstack, thousands of open-source creators can jointly produce decentralized applications (DApps), while distributing individual ownership in the product to contributors of value. Crowd curators can cooperatively own and manage multi-valued ranking systems to compete with Yelp, TripAdvisor, or YouTube. And autonomous networks can run their collective investment or insurance fund. We believe DAOs will radically change the way people organize, from startups to corporations, to nonprofits and even nation-states. DAOstack develops the foundational elements needed to enable ​this ​transition ​to ​the ​future ​of ​work.","developer_score":59.356,"id":"daostack","image":{"large":"https://assets.coingecko.com/coins/images/3479/large/gen.png?1547038215","small":"https://assets.coingecko.com/coins/images/3479/small/gen.png?1547038215","thumb":"https://assets.coingecko.com/coins/images/3479/thumb/gen.png?1547038215"},"links":{"bitcointalk_thread_identifier":3334795,"blockchain_site":["https://enjinx.io/eth/token/0x543ff227f64aa17ea132bf9886cab5db55dcaddf","https://etherscan.io/token/0x543ff227f64aa17ea132bf9886cab5db55dcaddf","https://ethplorer.io/address/0x543ff227f64aa17ea132bf9886cab5db55dcaddf"],"homepage":["https://daostack.io/"],"repos_url":{"github":["https://github.com/daostack/arc"]},"subreddit_url":"https://www.reddit.com/r/daostack","telegram_channel_identifier":"daostackcommunity","twitter_screen_name":"daostack"},"liquidity_score":7.094,"market_cap_rank":289,"name":"DAOstack","public_interest_score":26.797,"symbol":"gen","tickers":[{"base":"GEN","market":{"identifier":"bitfinex","name":"Bitfinex"},"target":"ETH"},{"base":"GEN","market":{"identifier":"bitfinex","name":"Bitfinex"},"target":"USD"},{"base":"GEN","market":{"identifier":"hotbit","name":"Hotbit"},"target":"ETH"},{"base":"GEN","market":{"identifier":"quoine","name":"Liquid"},"target":"ETH"}]}