{"address":"0x54325E3946c3f558162F8A7E79A5DC89e3Fbb2f4","coingecko_rank":6184,"coingecko_score":0.2,"community_score":0.0,"description":"Global Currency development /GCD is created with a purpose of presenting GCD coins that functions as a store of value and a medium of exchange combined with blockchain technology to potential investors.\n\nGCD (IEO) is a unique platform of fund raising machanism in which the Global Currency Development project sells its underlined Crypto tokens in exchange of Bitcoin and ether. Global currency development plans to start its trading from September 2019. GCD aims to connect anyone and anything to decentralize services. Having ERC token allows users to issue a means of payment by a payment coins to ease and the currency basket approach brings exposures to the 15 largest economies in the world including Gold.\n\n GCD coins are meant for trading on the GCD platform. The users have to use the GCD coins for buying\nany type of Crypto currency from the decentralised exchange or the DEX platform (-) minus who have mined the crypto currency and wanted to trade for the same on the DEX platform need to pay for the transaction fees and gas charges using the GCD tokens. GCD has integrated the GCD coins on the DEX platform to ensure that the traders get to complete the trading as and when required. Those who are holding the GCD coins will get the opportunity to make a considerable fortune when the prices increase at the exchange. This is how the flow will occur on the DAX platform to help Transact using the GCD coins. Get ready to invest on GCD IEO'S AND GET A HIGH RETURN ON INVESTMENT","developer_score":0.0,"id":"global-currency-development","image":{"large":"missing_large.png","small":"missing_small.png","thumb":"missing_thumb.png"},"links":{"blockchain_site":["https://etherscan.io/token/0x54325E3946c3f558162F8A7E79A5DC89e3Fbb2f4"],"homepage":["https://www.gcdcoin.io/"]},"liquidity_score":1.0,"market_cap_rank":4139,"name":"GLOBAL CURRENCY DEVELOPMENT","public_interest_score":0.0,"symbol":"gcd","tickers":[]}