{"address":"0x558EC3152e2eb2174905cd19AeA4e34A23DE9aD6","coingecko_rank":136,"coingecko_score":43.143,"community_score":4.706,"description":"Blockchains are quickly becoming the modern equivalent of what apps were to smartphones when they took off a decade ago. There’s a blockchain for everything - from cloud storage <a href=\"https://www.coingecko.com/en/coins/siacoin\">(Siacoin)</a> to identity verification <a href=\"https://www.coingecko.com/en/coins/civic\">(Civic)</a>. But the original point of Bitcoin, the very cryptocurrency was to overturn the traditional banking system. An interestingly named token - Bread, is here to bring us back on track for this original goal. Bread technology intends to reinvent and revolutionize banking as we know it. By building a blockchain synced, Bitcoin-based wallet, the idea here is to decentralise banking and make it accessible to everyone.\n\nWith a blockchain connected, easy to use Bitcoin wallet, Bread makes it easy for you to transition to a truly decentralised banking service.It also provides portfolio management tools to offer a comprehensive banking experience. Purchases made using its BRD token attract loyalty points and rewards, giving customers another lucrative reason to use the Bread wallet app.\n\nBread was officially launched in 2014 itself and even raised VC funding to the tune of $7 million in August 2017. It then went the ICO route in December 2017, where it made available 88 million BRD tokens. $32 million was raised in the price, with BRD being valued at the rate of 900 for every 1 ETH at the time. As of June 2018, just over 6 months later, its value had fallen to above 1600 for every 1 ETH.\n\nA decentralised banking system was <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin’s</a> original vision that is either taking too long to fruition, or we’ve become an impatient audience. Whatever the case, Bread wants to accelerate the transition. A significant decision the Bread team took was to introduce the BRD token - which, with its cheap rates and loyalty/discount offerings, may emerge as the primary incentive for users joining the platform. If this is indeed the case, expect a spike in the value of the BRD cryptocurrency, something investors right now would be eyeing closely. Having said that, its fall in value since the ICO is certainly a cause for concern, and investors are advised to do their research and analyse before taking decisions.","developer_score":78.064,"id":"bread","image":{"large":"https://assets.coingecko.com/coins/images/1440/large/bread.png?1547563238","small":"https://assets.coingecko.com/coins/images/1440/small/bread.png?1547563238","thumb":"https://assets.coingecko.com/coins/images/1440/thumb/bread.png?1547563238"},"links":{"blockchain_site":["https://enjinx.io/eth/token/0x558ec3152e2eb2174905cd19aea4e34a23de9ad6","https://etherscan.io/token/0x558ec3152e2eb2174905cd19aea4e34a23de9ad6","https://ethplorer.io/address/0x558ec3152e2eb2174905cd19aea4e34a23de9ad6"],"facebook_username":"breadapp","homepage":["https://token.breadapp.com/en/"],"repos_url":{"github":["https://github.com/breadwallet/breadwallet-core"]},"subreddit_url":"https://www.reddit.com/r/breadwallet","twitter_screen_name":"breadapp"},"liquidity_score":29.906,"market_cap_rank":165,"name":"Bread","public_interest_score":36.676,"symbol":"brd","tickers":[]}