{"address":"0x5732046A883704404F284Ce41FfADd5b007FD668","coingecko_rank":252,"coingecko_score":36.091,"community_score":10.081,"description":"Bluzelle is a decentralized, scalable database service that aims to provide an effective data storage solution for the newly emerging blockchain ecosystem. It provides a solution to the scaling problems that developers of decentralized applications (dApps) face while using centralized infrastructure and traditional cloud-based databases.\n\nBluzelle uses reliable ”swarm” technology, in which it stores tiny bits of data in groups of nodes or “swarms” which are distributed across the globe. Since this makes it independent of single data centres, Bluzelle’s scaling ability is limitless. Bluzelle adjusts the number of nodes and their location dynamically, reducing request time and improving overall performance. Bluzelle's swarm technology makes it extremely reliable as it redundantly stores pieces of data across the globe, eliminating a single point of failure. Since there are no data centres, Bluzelle’s resources are provided by network “producers”, who earn funds and pass on the savings to users.\n\nBluzelle held an ICO from January to February 2018, selling 33% of its total supply of 500 million BLZ tokens and earning $19.5 million USD in the process. As of July 2018, Bluzelle has a circulating supply of about 183.02 million BLZ, with an individual price of $0.328 and consequently a market cap of around $60.25 million USD.\n\nThe potential of an endlessly scalable storage service which is quick in its scaling, which is capable of storing any amount of data in a decentralized manner, is one that many investors may have an eye for. BLZ is still new and in its beginning stages, but its experienced team and excellent advisors work in its favour and are indicative of a bright future for the BLZ token. Investing in the token may not give high returns in a short period (since the cryptocurrency is so new and difficult to predict). So some more research is advised.","developer_score":61.224,"id":"bluzelle","image":{"large":"https://assets.coingecko.com/coins/images/2848/large/bluzelle.png?1547351698","small":"https://assets.coingecko.com/coins/images/2848/small/bluzelle.png?1547351698","thumb":"https://assets.coingecko.com/coins/images/2848/thumb/bluzelle.png?1547351698"},"links":{"blockchain_site":["https://enjinx.io/eth/token/0x5732046a883704404f284ce41ffadd5b007fd668","https://etherscan.io/token/0x5732046a883704404f284ce41ffadd5b007fd668","https://ethplorer.io/address/0x5732046a883704404f284ce41ffadd5b007fd668"],"homepage":["https://bluzelle.com/"],"repos_url":{"github":["https://github.com/njmurarka/bluzelle"]},"subreddit_url":"https://www.reddit.com/r/Bluzelle/","telegram_channel_identifier":"bluzelle","twitter_screen_name":"BluzelleHQ"},"liquidity_score":20.004,"market_cap_rank":361,"name":"Bluzelle","public_interest_score":24.938,"symbol":"blz","tickers":[{"base":"BLZ","market":{"identifier":"forkdelta","name":"ForkDelta"},"target":"ETH"},{"base":"BLZ","market":{"identifier":"gate","name":"Gate.io"},"target":"ETH"},{"base":"BLZ","market":{"identifier":"kyber_network","name":"Kyber Network"},"target":"ETH"}]}