{"address":"0x58b6A8A3302369DAEc383334672404Ee733aB239","coingecko_rank":145,"coingecko_score":42.723,"community_score":24.3,"description":"The Livepeer project aims to deliver a live video streaming network protocol that is fully decentralized, highly scalable, crypto token incentivized, and results in a solution which can serve as the live media layer in the decentralized development (web3) stack. In addition, Livepeer is meant to provide an economically efficient alternative to centralized broadcasting solutions for any existing broadcaster. In this document we describe the Livepeer Protocol - a delegated stake based protocol for incentivizing participants in a live video broadcast network in a game-theoretically secure way. We present solutions for the scalable verification of decentralized work, as well as the prevention of useless work in an attempt to game the token allocations in an inflationary system.\n\nThe Livepeer Token (LPT) is the protocol token of the Livepeer network. But it is not the medium of exchange token. Broadcasters use Ethereum's Ether (ETH) to broadcast video on the network. Nodes who contribute processing and bandwidth earn ETH in the form of fees from broadcasters. LPT is a staking token that participants who want to perform work on the network stake in order to coordinate how work gets distributed on the network, and to provide security that the work will get done honestly and correctly. LPT has the following purposes:\n\nIt serves as a bonding mechanism in a delegated proof of stake system, in which stake is delegated towards transcoders (or validators) who participate in the protocol to transcode video and validate work. The token, and potential slashing that occurs due to protocol violation, is necessary in order to secure the network against a number of attacks. More below.\nIt routes work through the network in proportion to the amount of staked and delegated token, essentially serving as a coordination mechanism.\n\nIt is a unit of account that is specific to the Livepeer ecosystem, which forms the basis of a SectorCoin concept, applicable to additional functionality to be introduced in the future. Services such as DVR, closed captioning, ad insertion/monetization, and analytics can all plug into the Livepeer ecosystem and potentially make use of the security provided by staking LPT.\n\nAn initial allocation of Livepeer Token will be distributed so that stakeholders can fulfill various roles in, and use the network, and then additional token will be issued according to algorithmically programmed issuance over time.\n\nFollowing the conventions of Ethereum and many popular ERC20 tokens, LPT will be divisible by 10 ^ 18, with larger denominations such as the LPT itself intended to be used for user level transactions such as staking, and smaller denominations intended to be used for protocol accounting.","developer_score":75.634,"id":"livepeer","image":{"large":"https://assets.coingecko.com/coins/images/7137/large/livepeer.png?1547976208","small":"https://assets.coingecko.com/coins/images/7137/small/livepeer.png?1547976208","thumb":"https://assets.coingecko.com/coins/images/7137/thumb/livepeer.png?1547976208"},"links":{"announcement_url":["https://forum.livepeer.org/","https://medium.com/livepeer-blog"],"blockchain_site":["https://etherscan.io/token/0x58b6a8a3302369daec383334672404ee733ab239","https://ethplorer.io/address/0x58b6a8a3302369daec383334672404ee733ab239"],"chat_url":["https://discord.gg/RR4kFAh"],"facebook_username":"livepeer","homepage":["https://livepeer.org/"],"repos_url":{"github":["https://github.com/livepeer/go-livepeer","https://github.com/livepeer/livepeerjs","https://github.com/livepeer/protocol"]},"subreddit_url":"https://www.reddit.com/r/livepeer","twitter_screen_name":"LivepeerOrg"},"liquidity_score":11.22,"market_cap_rank":187,"name":"Livepeer","public_interest_score":26.886,"symbol":"lpt","tickers":[{"base":"LPT","market":{"identifier":"bitcratic","name":"Bitcratic"},"target":"ETH"},{"base":"LPT","market":{"identifier":"idex","name":"Idex"},"target":"ETH"},{"base":"LPT","market":{"identifier":"radar_relay","name":"Radar Relay"},"target":"WETH"}]}