{"address":"0x595832F8FC6BF59c85C527fEC3740A1b7a361269","coingecko_rank":266,"coingecko_score":36.013,"community_score":46.326,"description":"Power Ledger (POWR) is an Australian blockchain-based cryptocurrency and energy trading platform that allows for decentralized selling and buying of renewable energy. The platform provides consumers with access to a variety of energy markets around the globe and is meant to be scalable to various energy infrastructures and regulations. The market is based on a dual-token ecosystem operating on two blockchain layers, POWR and Sparkz. POWR tokens allow consumers and hosts providing energy to interface with the ecosystem and are protected through Smart Bond technology. POWR tokens can be converted into Sparkz tokens, which can be used for frictionless transactions in the energy exchange market. The initial coin offering for POWR tokens became the largest crowd funding project in Australia and the 14th highest in the world.\n\nPower Ledger’s team has immense expertise in both blockchain and electricity markets. They’re comprised of six Board of Directors in addition to over ten full time-team members. Power Leger’s five co-founders make up five of the six Board of Director seats of the company. The sixth board seat belongs to venture capitalist Bill Tai. Receiving his MBA from Harvard, Yai is a world-renowned venture capitalist. Tai’s experience is quite extensive; he is currently the Chairman of Treasure Data and also a Board Member of Bitfury and Boxer.\n\nPower Ledger’s POWR Presale sold out in just three days and raised over thirteen million dollars (AUD) in exchange for 190,000,000 tokens. After the presale, Power Ledger held an ICO to sell the remaining 160,000,000 POWR tokens allocated to Token Generation Event.  After both rounds, funds raised totaled thirty-four million dollars (AUD). In addition to money raised from its presale and ICO, the Australian Government also awarded Power ledger a grant for 8 million dollars (AUD) to develop its technology and concept further. (Australia has one of the highest costs of electricity in the world and thus has a large stake in the overall success the company).\n\nPower Ledger provides a blockchain-based marketplace that can truly change the world. Taking power away from large energy companies, Power Ledger gives local communities the ability to sell their excess solar power to neighbors. Power Ledger has created an energy distribution and tracking platform that allows consumers buy carbonless, sustainable energy at lower prices than what’s offered by traditional electric companies. Power Ledger has plans to expand its operations to three continents worldwide and has amassed an army of powerful strategic partners to help achieve its goals.  With the planned release of multiple applications for its platform in the immediate future, the project has positioned itself to disrupt multiple energy markets throughout the world creating a bright future for all participants involved in this green revolution.","developer_score":0.0,"id":"power-ledger","image":{"large":"https://assets.coingecko.com/coins/images/1104/large/power-ledger.png?1547035082","small":"https://assets.coingecko.com/coins/images/1104/small/power-ledger.png?1547035082","thumb":"https://assets.coingecko.com/coins/images/1104/thumb/power-ledger.png?1547035082"},"links":{"announcement_url":["https://medium.com/power-ledger"],"bitcointalk_thread_identifier":2003922,"blockchain_site":["https://enjinx.io/eth/token/0x595832f8fc6bf59c85c527fec3740a1b7a361269","https://etherscan.io/token/0x595832f8fc6bf59c85c527fec3740a1b7a361269","https://ethplorer.io/address/0x595832f8fc6bf59c85c527fec3740a1b7a361269"],"homepage":["https://powerledger.io/"],"subreddit_url":"https://www.reddit.com/r/PowerLedger/","telegram_channel_identifier":"powerledger","twitter_screen_name":"PowerLedger_io"},"liquidity_score":45.087,"market_cap_rank":157,"name":"Power Ledger","public_interest_score":24.362,"symbol":"powr","tickers":[{"base":"POWR","market":{"identifier":"btcmarkets","name":"BTCMarkets"},"target":"BTC"},{"base":"POWR","market":{"identifier":"crypto_bridge","name":"CryptoBridge"},"target":"BTC"},{"base":"POWR","market":{"identifier":"gate","name":"Gate.io"},"target":"BTC"},{"base":"POWR","market":{"identifier":"gate","name":"Gate.io"},"target":"ETH"},{"base":"POWR","market":{"identifier":"gate","name":"Gate.io"},"target":"USDT"},{"base":"POWR","market":{"identifier":"huobi_korea","name":"Huobi Korea"},"target":"BTC"},{"base":"POWR","market":{"identifier":"idex","name":"Idex"},"target":"ETH"},{"base":"POWR","market":{"identifier":"latoken","name":"LATOKEN"},"target":"ETH"},{"base":"POWR","market":{"identifier":"p2pb2b","name":"P2PB2B"},"target":"USD"},{"base":"POWR","market":{"identifier":"p2pb2b","name":"P2PB2B"},"target":"USDT"},{"base":"POWR","market":{"identifier":"upbit","name":"Upbit"},"target":"BTC"},{"base":"POWR","market":{"identifier":"upbit_indonesia","name":"Upbit Indonesia "},"target":"BTC"}]}