{"address":"0x5cAc3991e1d10d62dF007A3559f652887735AEDb","coingecko_rank":4363,"coingecko_score":1.575,"community_score":7.16,"description":"SpaceGold Corporation is an off-world mining company based in the United States that engineers proven patented hardware solutions to commercially and autonomously mine Asteroids for precious metals. SpaceGold Corporation was founded by rocket scientist William Mook and metallurgical engineer Hamidreza Jalilian. William and Reza have teamed up with other engineers to design, build, launch and operate satellites that can mine and refine Gold from Asteroids that periodically cross paths with Earth. \nPart of the project is being funded through a new ERC20 Ethereum based token called SpaceGold, ticker SGOLD. While cryptocurrency isn’t unique anymore, this token is actually fully redeemable for 240 milligrams of gold after the first 70 metric tons are delivered back to Earth, making it the first series of its kind. For every satellite we send up, there will be a new SGOLD series to follow. Alternatively, SGOLD can be swapped for equity in the total value of the Asteroid reserves we own. SpaceGold Corporation is expected to be valued at a whopping $44 billion by the end of our second year of production. \nSpaceGold is registered as a money services provider under FinCen. SGOLD trades at .0041 eth and rises and falls with the price of Ether. We anticipate SGOLD to start trading on our full valuation upon our first successful return. We also further anticipate Etherium to trade in correlation with the price of gold as our project moves forward.","developer_score":0.0,"id":"spacegold","image":{"large":"https://assets.coingecko.com/coins/images/11138/large/logo-new-1.jpg?1588909497","small":"https://assets.coingecko.com/coins/images/11138/small/logo-new-1.jpg?1588909497","thumb":"https://assets.coingecko.com/coins/images/11138/thumb/logo-new-1.jpg?1588909497"},"links":{"announcement_url":["https://medium.com/@mokmedical/spacegold-6dafbc38be4a"],"blockchain_site":["https://etherscan.io/token/0x5cac3991e1d10d62df007a3559f652887735aedb","https://ethplorer.io/address/0x5cac3991e1d10d62df007a3559f652887735aedb"],"chat_url":["https://www.linkedin.com/company/spacegold/"],"facebook_username":"SpaceGold","homepage":["https://spacegold.online/"],"telegram_channel_identifier":"spacegoldcorp","twitter_screen_name":"SpaceGoldcorp"},"liquidity_score":0.0,"market_cap_rank":null,"name":"SpaceGold","public_interest_score":0.001,"symbol":"sgold","tickers":[]}