{"address":"0x5d65D971895Edc438f465c17DB6992698a52318D","coingecko_rank":54,"coingecko_score":52.531,"community_score":49.003,"description":"Nebulas is a next generation public blockchain, aiming for a continuously improving ecosystem. Based on its blockchain valuation mechanism, Nebulas proposes future-oriented incentive and consensus systems, and the ability to self-evolve without forking. Many in the crypto community are referring to Nebulas as “the new Google”. While the two are similar in a sense, they hold different use cases. Google is intended for day to day internet information searches, while Nebulas focuses on searches among decentralized applications (DApps), smart contracts, and user’s blockchain assets.\n\nNebulas is being built on a decentralized search framework with open-source algorithms, verifiable computing, and distributed data stores.” Nebulas has three core features of its tech such as Nebulas Rank (NR), it is an Open source, core ranking algorithm based on “liquidity, propagation of users’ assets, and the interactivity between users.” and Nebulas Force (NF): “Nebulas Force (NF) provides the Nebulas blockchain & its distributed applications built on top, the capability to self-evolve”.\n\nNebulas’s official website shows an international team of 14 core members, including Hitters Xu, founder and CEO of Nebulas (who also happens to be the founder of AntShares, now known as NEO). Xu is considered a pioneer in the blockchain industry, founding BitsClub (the very first Blockchain/Bitcoin community in China) in 2013 as well as popular ICO platform ICO 365. He also founded the crypto funds firm, FBG capital. On top of that, he directed an Alibaba financial arm (Ant Financial’s Blockchain Platform) and aided Google’s Search & Anti-Fraud team.","developer_score":63.547,"id":"nebulas","image":{"large":"https://assets.coingecko.com/coins/images/2431/large/Webp.net-resizeimage_%289%29.png?1547036577","small":"https://assets.coingecko.com/coins/images/2431/small/Webp.net-resizeimage_%289%29.png?1547036577","thumb":"https://assets.coingecko.com/coins/images/2431/thumb/Webp.net-resizeimage_%289%29.png?1547036577"},"links":{"blockchain_site":["https://etherscan.io/token/0x5d65d971895edc438f465c17db6992698a52318d","https://explorer.nebulas.io/#/","https://nas.tokenview.com/"],"facebook_username":"nebulasproject","homepage":["https://nebulas.io/"],"repos_url":{"github":["https://github.com/nebulasio/go-nebulas"]},"subreddit_url":"https://www.reddit.com/r/nebulas","telegram_channel_identifier":"nebulasio","twitter_screen_name":"nebulasio"},"liquidity_score":42.298,"market_cap_rank":135,"name":"Nebulas","public_interest_score":29.387,"symbol":"nas","tickers":[{"base":"NAS","market":{"identifier":"bcex","name":"BCEX"},"target":"USDT"},{"base":"NAS","market":{"identifier":"biki","name":"Biki"},"target":"USDT"},{"base":"NAS","market":{"identifier":"forkdelta","name":"ForkDelta"},"target":"ETH"},{"base":"NAS","market":{"identifier":"huobi_korea","name":"Huobi Korea"},"target":"ETH"},{"base":"NAS","market":{"identifier":"okex_korea","name":"OKEx Korea"},"target":"ETH"}]}