{"address":"0x5e55a1705ED1313629BB2Cc842019C8DEB2f643B","coingecko_rank":3085,"coingecko_score":8.034,"community_score":16.144,"description":"\"The SUBAJ Global Network forms a unique global blockchain ecosystem for online/offline payments, promotions and reward sharing programs using mobile-based methods. It’s a distributed blockchain platform which creates an enormous marketplace where different types of businesses, retailers, merchants and service providers can participate for their mutual benefits. The SUBAJ platform is fueled by the groundbreaking technologies like Social Gamification, Augmented Reality and GeoDrop Technology. The platform aims at revolutionizing the shopping experience of millions of customers through its state-of-the-art loyalty reward sharing methodology.\n\n It provides an advanced utility model and sophisticated infrastructure where all kinds of retailers,\nmerchants, clubs, and communities can participate to create their own business tokens and offer them to the customers as loyalty rewards. For example, a college or University can release its own tokens for the students and staff members using SUBAJ Blockchain Platform (SBP). In the same way, a Fitness Club can offer its membership tokens to the global community. Above all, SUBAJ strives to create a more meaningful world through the SUBAJ Charity Foundation which is dedicated to the upliftment and betterment of the underprivileged kids from different corners of the world. \"","developer_score":0.0,"id":"subaj-global-network","image":{"large":"https://assets.coingecko.com/coins/images/4694/large/0lQ4TiC5_400x400.jpg?1559619799","small":"https://assets.coingecko.com/coins/images/4694/small/0lQ4TiC5_400x400.jpg?1559619799","thumb":"https://assets.coingecko.com/coins/images/4694/thumb/0lQ4TiC5_400x400.jpg?1559619799"},"links":{"bitcointalk_thread_identifier":4455911,"blockchain_site":["https://etherscan.io/token/0x5e55a1705ed1313629bb2cc842019c8deb2f643b"],"chat_url":["https://subaj.slack.com/"],"facebook_username":"subajtoken","homepage":["https://www.subaj.com/"],"subreddit_url":"https://www.reddit.com/r/SUBAJ/","telegram_channel_identifier":"subajofficial","twitter_screen_name":"subajtoken"},"liquidity_score":0.0,"market_cap_rank":5541,"name":"Subaj Global Network","public_interest_score":39.976,"symbol":"sbj","tickers":[]}