{"address":"0x607F4C5BB672230e8672085532f7e901544a7375","coingecko_rank":92,"coingecko_score":48.352,"community_score":33.55,"description":"iExec is an open-source, decentralized cloud computing platform, running on <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> blockchain. iExec allows decentralized applications (dApps) an on-demand access to computing resources and technologies on iExec cloud. iExec has built a blockchain network where dApps can take advantage of cost effective and high-performance resources such as servers, databases, SaaS applications, web hosting and computer farms. iExec’s native cryptocurrency — The RLC token is the primary asset used to access services in iExec infrastructure. RLC is short for “Run on Lots of Computers.”\n\niExec is headquartered at Lyon, France. It was founded by Gilles Fedak and Haiwu He, both are serving as Chief Executive Officer and Head of Asian-Pacific Region of iExec, respectively. Oleg Lodygensky is the Chief Technical Officer. Gilles Fedak received his PhD from the University of Paris Sud in 2003, and has been working as INRIA (Inventeurs du Monde Numerique) research scientist at ENS in Lyon, France. Similarly, Haiwu completed his M.Sc. and PhD from the University of Sciences and Technologies of Lille, France. On April 19, 2017, iExec launched its token sale and raised more than $12 million in exchange for 86,999,784 RLC.\n\nIn order to support dApps, smart contracts, and their platforms, iExec takes processing-intensive computations off-chain so as to keep a blockchain’s on-chain functions running smoothly. To do this, iExec makes use of XtremWeb-HEP, an open-sourced Desktop Grid Software.  Desktop Grid computing (also known as Volunteer Computing) pools unused computing resources to be used by applications and platforms, and according to iExec’s whitepaper, XtremWeb-HEP “implements all the needed features” to make this possible on a global scale, including “fault-tolerance, multi-applications, multi-users, hybrid public/private infrastructure, deployment of virtual images, data management, security and accountability, and many more.” Essentially, with this software, dApps can utilize any computing resource in the iExec framework to run their programs.\n\nIn their whitepaper, the iExec team lays out the project’s competitive landscape and explains these competitors in relation to iExec. They’re quick to note that decentralized cloud storage providers like <a href=\"https://www.coingecko.com/en/coins/filecoin\">Filecoin</a>, <a href=\"https://www.coingecko.com/en/coins/storj\">Storj</a>, and <a href=\"https://www.coingecko.com/en/coins/siacoin\">Siacoin</a> are not direct competitors, and it’s easy to see why.  While iExec could theoretically take a step in this direction as it matures, it’s not a storage platform; it’s a computing platform. This does put it in competition with other decentralized computing protocols like <a href=\"https://www.coingecko.com/en/coins/golem\">Golem</a> and <a href=\"https://www.coingecko.com/en/coins/golem\">SONM</a>. Both of these, however, are taking aim at a different animal.  Essentially, they’re both building a decentralized supercomputer on blockchain technology, while iExec is targeting dApp development and sustainability.  Both look towards a future of a blockchain-powered, decentralized internet, but their functions, while sometimes similar, are more complementary than conflicting.","developer_score":71.318,"id":"iexec-rlc","image":{"large":"https://assets.coingecko.com/coins/images/646/large/iExec_RLC.png?1547034373","small":"https://assets.coingecko.com/coins/images/646/small/iExec_RLC.png?1547034373","thumb":"https://assets.coingecko.com/coins/images/646/thumb/iExec_RLC.png?1547034373"},"links":{"bitcointalk_thread_identifier":1746241,"blockchain_site":["https://enjinx.io/eth/token/0x607f4c5bb672230e8672085532f7e901544a7375","https://etherscan.io/token/0x607F4C5BB672230e8672085532f7e901544a7375","https://ethplorer.io/address/0x607f4c5bb672230e8672085532f7e901544a7375"],"facebook_username":"iexecteam","homepage":["http://iex.ec/"],"repos_url":{"github":["https://github.com/iExecBlockchainComputing/PoCo","https://github.com/iExecBlockchainComputing/iexec-sdk","https://github.com/iExecBlockchainComputing/iexec-stack"]},"subreddit_url":"https://www.reddit.com/r/iexec","twitter_screen_name":"iEx_ec"},"liquidity_score":30.798,"market_cap_rank":111,"name":"iExec RLC","public_interest_score":25.586,"symbol":"rlc","tickers":[{"base":"RLC","market":{"identifier":"bitfinex","name":"Bitfinex"},"target":"BTC"},{"base":"RLC","market":{"identifier":"bitfinex","name":"Bitfinex"},"target":"ETH"},{"base":"RLC","market":{"identifier":"bitfinex","name":"Bitfinex"},"target":"USD"},{"base":"RLC","market":{"identifier":"forkdelta","name":"ForkDelta"},"target":"ETH"},{"base":"RLC","market":{"identifier":"gate","name":"Gate.io"},"target":"ETH"},{"base":"RLC","market":{"identifier":"gate","name":"Gate.io"},"target":"USDT"},{"base":"RLC","market":{"identifier":"idex","name":"Idex"},"target":"ETH"},{"base":"RLC","market":{"identifier":"livecoin","name":"Livecoin"},"target":"ETH"},{"base":"RLC","market":{"identifier":"livecoin","name":"Livecoin"},"target":"USD"},{"base":"RLC","market":{"identifier":"uniswap","name":"Uniswap"},"target":"ETH"},{"base":"RLC","market":{"identifier":"upbit","name":"Upbit"},"target":"BTC"},{"base":"RLC","market":{"identifier":"upbit_indonesia","name":"Upbit Indonesia "},"target":"BTC"}]}