{"address":"0x6096d2460CF5177E40B515223428DC005ad35123","coingecko_rank":2787,"coingecko_score":9.386,"community_score":5.214,"description":"Powered by Influencer Marketing Company \"KCENT\" with 200 exclusive top 5% Korean Influencers with about 10 million followers and Software development company HANKY&PARTNERS with core members from highly educated institutions (Ph.D. and Masters).\n\nPrecium have been running an Influencer Marketing company for more than 2 years and Precium also own 12 subsidiary brands in different industries such as Beauty, Health Care and Life Style. Precium make use of our exclusive influencers to viral our products through media commerce and make leverage of our influencers.\n\nIn 2018, Precium achieved annual revenue of 16 million dollars in Korea.\n\nIn 2019, Precium are planning to open our commerce/marketing platform to gather all our brands into a single platform and also help other influencers to open up their personal market in our platform.\n\nParticipants of Precium Platform will be Brands, Influencers and Reviewers (Customers).\n\nThe Platform will be opened to all Brands also so that they will be able to promote or group-sell their products through influencers and also achieve viral reviews from Reviewers.\n\nInfluencers can gain revenue by making use of their influencing power to help brands to sell their products. Initial influencers will be consisted of our own exclusive influencers.\n\nReviewers will be rewarded for writing honest reviews of the products and gain influencing power which can be used to become an influencer according to their contribution. \n\nPrecium will create a secure and transparent commerce/marketing platform where all our platform participants are satisfied. Moreover Precium is planning to expand our business to overseas, and we believe that blockchain will lower the barriers of entering the global market.","developer_score":0.0,"id":"precium","image":{"large":"https://assets.coingecko.com/coins/images/9490/large/pcm.PNG?1568015318","small":"https://assets.coingecko.com/coins/images/9490/small/pcm.PNG?1568015318","thumb":"https://assets.coingecko.com/coins/images/9490/thumb/pcm.PNG?1568015318"},"links":{"announcement_url":["https://t.me/precium_announce"],"blockchain_site":["https://etherscan.io/token/0x6096d2460cf5177e40b515223428dc005ad35123"],"chat_url":["https://t.me/preciumkr","https://www.instagram.com/precium_foundation/"],"homepage":["https://precium.io"],"telegram_channel_identifier":"preciumen","twitter_screen_name":"Precium_io"},"liquidity_score":28.258,"market_cap_rank":2647,"name":"Precium","public_interest_score":24.311,"symbol":"pcm","tickers":[]}