{"address":"0x61D24Aabb3e5E800D8f3d3D43dcBD66AE6caB51E","coingecko_rank":3160,"coingecko_score":8.287,"community_score":13.575,"description":"Rabbit Coin (BRB) is the universal point of \"BitRabbit Exchange\" and \"BunnyPub Community\". It is a point system issued and managed on the basis of blockchain. Its total amount is 200 million, of which 20% has been released to early investors, 30% to the team (locked for four years), and the remaining 50% is for strategic reserve. In the early stage of development, BitRabbit will take a certain proportion from the team's BRB share for promotions, such as Exchange marketing and BunnyPub mining.\n\nTo get BRB, we encourage users to do interactive mining on BunnyPub community, such as post, reply and like; for certain activities, we will also reward BRB, such as invitation rewards, rewards sharing, the first crptocurrency influence contest, etc.\n\nIn the future, the value of BRB will be linked with the traffic of the BitRabbit Exchange and BunnyPub community, and be supported by different “converting traffic into BRB” behaviors, such as charging BRB for listing on BitRabbit Exchange, service fee deduction, or advertising position on BunnyPub community.","developer_score":0.0,"id":"rabbit-coin","image":{"large":"https://assets.coingecko.com/coins/images/8614/large/312c7330-ffbb-4a29-9cd0-7336170bb8f9.png?1559628544","small":"https://assets.coingecko.com/coins/images/8614/small/312c7330-ffbb-4a29-9cd0-7336170bb8f9.png?1559628544","thumb":"https://assets.coingecko.com/coins/images/8614/thumb/312c7330-ffbb-4a29-9cd0-7336170bb8f9.png?1559628544"},"links":{"blockchain_site":["https://etherscan.io/token/0x61d24aabb3e5e800d8f3d3d43dcbd66ae6cab51e"],"chat_url":["https://t.me/bitrabbit_official"],"facebook_username":"BitRabbitTeam","homepage":["https://bitrabbit.io/"],"telegram_channel_identifier":"bitrabbit_en","twitter_screen_name":"Bitrabbit_Team"},"liquidity_score":4.361,"market_cap_rank":2859,"name":"Rabbit Coin","public_interest_score":40.214,"symbol":"brb","tickers":[]}