{"address":"0x642F4bE6DA9d9Daa9076F8D161B15A166e966069","coingecko_rank":5761,"coingecko_score":0.0,"community_score":0.0,"description":"Endorsed by credibility of individual and institution data, JAC applies blockchain technology to build education admission communities in the world, promoting distributed dissemination of premium education information!\nEveryone is recruiter! JAC: Global Education Flow EntranceUnicorn!\n\nFlow entrance admission is the key to educational institutions. As shown in annual financial reports of the listed companies of Tarena Technology and 51TAIK, admission expenses in educational institutions generally account for 20% to 40% of total tuition; in this project, admission incentive fee of JAC Chinese cooperative agencies for many years is basically 25% to 40% of tuition. It may reach 50% to 60% in some private universities, professional schools and training agencies. Educational institutions suffer from not only information that can be easily obtained by learners, but also high admission costs.\n\nWhy JAC will be the unicorn of flow entrance in education industries? JAC operator, Beijing Joint Admissions Institution, has been working in this industry for 16 years. It established and operated China Joint Admissions Organization and Joint Admissions Organization. Therefore, it understands education and students very well. Four stages are involved:","developer_score":0.0,"id":"joint-admissions-chain","image":{"large":"https://assets.coingecko.com/coins/images/10660/large/jac.PNG?1581462600","small":"https://assets.coingecko.com/coins/images/10660/small/jac.PNG?1581462600","thumb":"https://assets.coingecko.com/coins/images/10660/thumb/jac.PNG?1581462600"},"links":{"blockchain_site":["https://etherscan.io/token/0x642f4be6da9d9daa9076f8d161b15a166e966069"],"homepage":["http://www.jac.work/"],"telegram_channel_identifier":"JAC_CN"},"liquidity_score":0.0,"market_cap_rank":null,"name":"Joint Admissions Chain","public_interest_score":0.0,"symbol":"jac","tickers":[]}