{"address":"0x66149b85cbd202EAf4A93713702A7E94fC1121a7","coingecko_rank":6118,"coingecko_score":2.298,"community_score":9.192,"description":"Cryptoxygen is blockchain-based ecosystem that comprises of an exchange and a multi-blockchain mobile wallet for iOS and Android platforms, to provide secure, fast and advanced crypto trading solutions at lowest rates. The Cryptoxygen exchange platform allows fiat-crypto and crypto-crypto trading. It comes with an easy-to-use interface, data charts and real-time price tracking, making it easier for users to manage their cryptocurrency portfolio. The wallet, on the other hand, allows users to store, buy and sell cryptocurrencies while ensuring the highest security. In addition, Cryptoxygen offers online news and social trading, where crypto beginners can follow successful traders on the platform and copy their trading patterns. Detailed online courses will also be provided to those who need extensive knowledge of crypto trading platform principles, strategies and lot more.\nCryptoxygen envisions to come up with a lab to support startups with innovative solutions to mitigate all types of pollution and development of artificial intelligence projects.","developer_score":0.0,"id":"cryptoxygen","image":{"large":"https://assets.coingecko.com/coins/images/10140/large/logo_%2834%29.png?1576359614","small":"https://assets.coingecko.com/coins/images/10140/small/logo_%2834%29.png?1576359614","thumb":"https://assets.coingecko.com/coins/images/10140/thumb/logo_%2834%29.png?1576359614"},"links":{"blockchain_site":["https://etherscan.io/token/0x66149b85cbd202eaf4a93713702a7e94fc1121a7"],"chat_url":["https://www.linkedin.com/company/cryptoxygen/"],"facebook_username":"Cryptoxygen","homepage":["https://www.cryptoxygen.io/"],"repos_url":{"github":["https://github.com/cryptoxygenofficial"]},"telegram_channel_identifier":"cryptoxygentalks","twitter_screen_name":"cryptoxygencoin"},"liquidity_score":0.0,"market_cap_rank":null,"name":"Cryptoxygen","public_interest_score":0.0,"symbol":"oxy2","tickers":[]}