{"address":"0x6868639d07eA11402A57AADeebE0598346a80AEe","coingecko_rank":6136,"coingecko_score":2.091,"community_score":8.363,"description":"AMUSE Platform is an integrated business platform of arts and culture based on blockchain technology. It supports performance arts, leads to the active participation of the public, and enables the creation of contents, videos, and digital records from various creators. In addition, the platform enables to distribute and provide registered contents created by creators easily, and guarantees business activities of high trust and protection of copyrights through blockchain technology. Creators can provide various digital contents and videos.\n\nCreators themselves provide a consistent procedure that they can do business through arts activities. Moreover, through the activation of performance arts, the platform makes it possible for the public to ascertain transparent funding, artist cultivation and produced contents so it can enhance the participation of public and proceed business through the global distribution of produced contents.\n\nA series of such procedure makes it possible to implement contract based on trust and transparency using blockchain technology and global single payment through AMUSE COIN, Distribution of contents whose copyright is protected by blockchain hash algorithm.","developer_score":0.0,"id":"amuse","image":{"large":"https://assets.coingecko.com/coins/images/10022/large/tW3VxXDd_400x400.png?1574857670","small":"https://assets.coingecko.com/coins/images/10022/small/tW3VxXDd_400x400.png?1574857670","thumb":"https://assets.coingecko.com/coins/images/10022/thumb/tW3VxXDd_400x400.png?1574857670"},"links":{"announcement_url":["https://blog.naver.com/amuse2019"],"blockchain_site":["https://etherscan.io/token/0x6868639d07ea11402a57aadeebe0598346a80aee"],"facebook_username":"amuseworld","homepage":["https://amuseworld.io/"],"repos_url":{"github":["https://github.com/amuse2019/amuse"]},"telegram_channel_identifier":"amusecoin","twitter_screen_name":"amuse2019"},"liquidity_score":0.0,"market_cap_rank":null,"name":"AMUSE","public_interest_score":0.0,"symbol":"ams","tickers":[]}