{"address":"0x70c621f949b6556c4545707a2d5d73A776b98359","coingecko_rank":2922,"coingecko_score":9.253,"community_score":26.126,"description":"Skychain is an open infrastructure, based on blockchain, which provides the possibility to create, train and use high-quality medical neural networks. IBM estimates the artificial intelligence market in the healthcare sector to reach $200 billion in a few years. Skychain’s goal is to control more than 70% of that market! The way to achieve this goal is to create the best open infrastructure that will accumulate the resources of the majority of participants of this industry and surpass any closed corporate product.\n\nThe mission of Skychain is to save 10 million patients from premature death due to medical errors within 10 years. Medical errors are the third leading cause of death, but artificial intelligence can dramatically reduce the number of such errors!\n\nSkychain intends to provide an infrastructure to radically increase the efficiency of healthcare AI development and training. It will make diagnostic AI systems far more accessible and affordable for the consumer by using blockchain technologies to facilitate safe transactions between the key parties.\n\nSkychain is unique. The project is based on the revolutionary approach of using smart contracts to bring together many healthcare big data providers whose data is vital for AI training, thousands of independent AI developers, computational resource providers (crypto miners), and millions of consumers.","developer_score":0.0,"id":"skychain","image":{"large":"https://assets.coingecko.com/coins/images/1849/large/skch.png?1547036165","small":"https://assets.coingecko.com/coins/images/1849/small/skch.png?1547036165","thumb":"https://assets.coingecko.com/coins/images/1849/thumb/skch.png?1547036165"},"links":{"announcement_url":["https://www.facebook.com/groups/skychain/"],"bitcointalk_thread_identifier":2511994,"blockchain_site":["https://enjinx.io/eth/token/0x70c621f949b6556c4545707a2d5d73a776b98359","https://etherscan.io/token/0x70c621f949b6556c4545707a2d5d73a776b98359","https://ethplorer.io/address/0x70c621f949b6556c4545707a2d5d73a776b98359"],"homepage":["http://skychain.global/"],"repos_url":{"github":["https://github.com/Skychainglobal/MVP"]},"subreddit_url":"https://www.reddit.com/r/Skychain/","telegram_channel_identifier":"skychaingroup","twitter_screen_name":"skychainglobal"},"liquidity_score":1.0,"market_cap_rank":4302,"name":"Skychain","public_interest_score":25.211,"symbol":"skch","tickers":[{"base":"SKCH","market":{"identifier":"idex","name":"Idex"},"target":"ETH"},{"base":"SKCH","market":{"identifier":"livecoin","name":"Livecoin"},"target":"ETH"}]}