{"address":"0x71944c7953c93dBc0cd977e0ee1bBd9C2494B7B1","coingecko_rank":7381,"coingecko_score":0.05,"community_score":0.0,"description":"The Almeela token is a blockchain-based decentralized funding platform(Almee Up) for high tech projects that is backed by physical gold. Almeela is based on the Ethereum blockchain protocol which is secure, and cost effective way to utilise gold as an asset. It enables the transformation of physical gold into a modern digital asset, making  it the perfect medium to record and transfer ownership by using smart contract. Its being indexed to gold also guarantees that the price stays above a certain level.\n\nThe Almeela is designed to be used as a generally accepted electronic payment means for all who consider gold as a traditional, true, secure and value-stable medium.  Gold that can be digitally traded. So the gold return to our real life again. You’ll have full ownership of your gold and it will be stored in our gold refinery. Investors will be able to trade Almeela with real-time pricing 24/7, 365 days a year, by using our mobile wallet.\n\nAlmeela is the best alternative way to invest in and trade physical gold. On this count, Almeela’s value is determined not by speculative price movements but by supply and demand on the market. The Almeela. Therefore, it is safe, cost-efficient and fast, and allows for The Almeela can be transferred borderless, cost-efficiently, securely and in real-time. Its value is predictable because  the  value  of  gold  has  a  long  tradition,  and  everybody  has  an  idea  about  its  stability. Therefore, the Almeela can become generally accepted.","developer_score":0.0,"id":"almeela","image":{"large":"https://assets.coingecko.com/coins/images/5692/large/3671.png?1576969969","small":"https://assets.coingecko.com/coins/images/5692/small/3671.png?1576969969","thumb":"https://assets.coingecko.com/coins/images/5692/thumb/3671.png?1576969969"},"links":{"announcement_url":["https://medium.com/@almeela"],"blockchain_site":["https://etherscan.io/token/0x71944c7953c93dBc0cd977e0ee1bBd9C2494B7B1","https://ethplorer.io/address/0x71944c7953c93dBc0cd977e0ee1bBd9C2494B7B1"],"chat_url":["https://t.me/almeeChannel","https://t.me/criptocommunityturkey","https://www.linkedin.com/in/almeela/"],"facebook_username":"almeelatoken-256098291783931","homepage":["https://www.almeela.com/"],"telegram_channel_identifier":"almeelacommunity","twitter_screen_name":"almeelatoken"},"liquidity_score":0.0,"market_cap_rank":null,"name":"Almeela","public_interest_score":0.993,"symbol":"kze","tickers":[]}