{"address":"0x74cE17209d3a7cd057BeB1Ce1BaB705e17b164F7","coingecko_rank":4272,"coingecko_score":5.155,"community_score":1.056,"description":"Since the founding of NP5 Foundation, it has reached cooperation agreements with many casinos to realize landing application in casinos and obtain investment income. The income is used for NP5 development, road show publicity, incentive policy and operation maintenance. Therefore, NP5 does not need private placement, and the existing ecosystem is sufficient to support its operation. The underlying value of NP5 depends on the main difference between it and many existing encrypted currencies, which lack this intrinsic value, so prices fluctuate dramatically due to psychological expectations.\n\nNP5 is indeed an encrypted currency, so it inherits several striking features of these new digital currencies: the ability to transfer money quickly, security through encryption, and easy and free cross-border transfer of funds. Just as people in today's world can use mobile phones to send messages to friends anytime and anywhere, we can also manage funds instantly, safely and economically through NP5.\n\nAnyone who holds NP5 has a high degree of assurance that they can convert their digital currency into local currency based on the exchange rate, just as they would convert one currency into another while traveling. This approach is similar to the way other currencies were introduced in the past: to ensure that they can be used in exchange for real assets, such as gold. The purpose is to help cultivate people's trust in the new currency, and to achieve widespread use in the early days of the birth of the currency.\n\nThe benefits of landing applications and investment will be used to pay for the cost of the system, ensure low transaction costs, stimulate ecosystem development, and support further growth and popularization.","developer_score":0.0,"id":"new-pay-five","image":{"large":"https://assets.coingecko.com/coins/images/9664/large/logo_%2815%29.png?1570485506","small":"https://assets.coingecko.com/coins/images/9664/small/logo_%2815%29.png?1570485506","thumb":"https://assets.coingecko.com/coins/images/9664/thumb/logo_%2815%29.png?1570485506"},"links":{"blockchain_site":["https://etherscan.io/token/0x74ce17209d3a7cd057beb1ce1bab705e17b164f7"],"facebook_username":"newpay.pay","homepage":["http://www.np5g.com/"],"twitter_screen_name":"NewPay1"},"liquidity_score":1.0,"market_cap_rank":6139,"name":"New Pay Five","public_interest_score":46.911,"symbol":"np5","tickers":[]}