{"address":"0x75231F58b43240C9718Dd58B4967c5114342a86c","coingecko_rank":419,"coingecko_score":31.136,"community_score":0.0,"description":"<a href=\"https://www.coingecko.com/en/exchanges/okex\">OKEx</a>, the 2nd most popular cryptocurrency exchange by trading volume, launched its platform token ‘OKB‘ today with 10 trading pairs. On its official support page, OKEx describes OKB is a global utility token issued by the OK Blockchain Foundation. The total available supply of OKB will be one billion tokens (1,000,000,000), with a distribution model that allocates 60% of the supply will be given out to OKEx customers for community building and during marketing campaigns. According to OKEx, the company had officially issued OKB on ERC20 protocol earlier this month.\n\nThe company denied ICO (initial coin offering) and public fundraising. Reportedly the company had stated that it would be soon shifting the token to its official OK chain and subsequently it will be applied not only on OKEx’s platform but also on other related projects. There will be in total 1 billion tokens supplied globally out of which 600 million coins will be distributed to OKEx customers for community building and marketing campaigns. Rest will be locked up for a period of 1 year to 3 years.\n\nAccording to OKEx, the company had officially issued OKB on ERC20 protocol earlier this month. The company denied ICO (initial coin offering) and public fundraising. Reportedly the company had stated that it would be soon shifting the token to its official OK chain and subsequently it will be applied not only on OKEx’s platform but also on other related projects. There will be in total 1 billion tokens supplied globally out of which 600 million coins will be distributed to OKEx customers for community building and marketing campaigns. Rest will be locked up for a period of 1 year to 3 years.","developer_score":0.0,"id":"okb","image":{"large":"https://assets.coingecko.com/coins/images/4463/large/okb_token.png?1548386209","small":"https://assets.coingecko.com/coins/images/4463/small/okb_token.png?1548386209","thumb":"https://assets.coingecko.com/coins/images/4463/thumb/okb_token.png?1548386209"},"links":{"announcement_url":["https://t.me/okex_announcements"],"blockchain_site":["https://etherscan.io/token/0x75231f58b43240c9718dd58b4967c5114342a86c","https://ethplorer.io/address/0x75231f58b43240c9718dd58b4967c5114342a86c"],"facebook_username":"okexofficial","homepage":["https://www.okex.com/pages/products/okb.html"],"telegram_channel_identifier":"okexofficial_en","twitter_screen_name":"okex_"},"liquidity_score":60.271,"market_cap_rank":17,"name":"OKB","public_interest_score":32.828,"symbol":"okb","tickers":[{"base":"WAVES","market":{"identifier":"okex","name":"OKEx"},"target":"OKB"},{"base":"DCR","market":{"identifier":"okex","name":"OKEx"},"target":"OKB"}]}