{"address":"0x75c5eE419331B6150879530D06f9Ba054755F1DA","coingecko_rank":3553,"coingecko_score":6.953,"community_score":18.235,"description":"Salarium and SALPay are an innovative payment ecosystem that provides companies with an e-wallet and debit Mastercard. We make these solutions available to both large and small companies in th Philippines for less that US $1 per month. With hundreds of companies and thousands of employees already on board, Salarium and SALPay are one of the best fintech solutions provider in Southeast Asia.\n\nSALPay Tokens will be used by our current and future clients to remit funds into the SALPay ecosystem from outside the Philippines. SALPay will establish or work with other exchanges in our clients' home countries, allowing everyone to provide fiat currency (USD, EUR, AUD, SGD, JPY) from their location and to simultaneously execute a buy-and-sell between exchanges. The funds will be automatically be available in SALPay in local currency with a minimal charge and nearly no forex loss.\n\nWith SALPay Tokens, we aim to give everyone a better and more seamless fiat-to-fiat remittance experience.\n\nWhat is SAL Pay and what can I do with it?\n\nA SAL Pay account comes with a Mastercard paired with an e-wallet. With SAL Pay, you can:\n\nWithdraw money from ATMs in the Philippines and abroad,\nMake over-the-counter purchases\nShop online\nTransfer funds to bank accounts\nApply for loans up to Php250k\nBuy prepaid mobile phone load\nPay bills\nSoon, you’ll also be able to budget, allocate funds, and manage your finances more effectively through the SAL Pay app. More useful features ahead!","developer_score":0.0,"id":"salpay","image":{"large":"https://assets.coingecko.com/coins/images/4530/large/2857.png?1547039826","small":"https://assets.coingecko.com/coins/images/4530/small/2857.png?1547039826","thumb":"https://assets.coingecko.com/coins/images/4530/thumb/2857.png?1547039826"},"links":{"blockchain_site":["https://etherscan.io/token/0x75c5ee419331b6150879530d06f9ba054755f1da","https://ethplorer.io/address/0x75c5ee419331b6150879530d06f9ba054755f1da"],"chat_url":["https://slack.salpay.com/"],"facebook_username":"Salarium.Solutions","homepage":["https://ico.salpay.com/","https://www.salpay.com"],"official_forum_url":["https://www.salpay.com/blog/"],"subreddit_url":"https://www.reddit.com/r/salarium/","twitter_screen_name":"SALPayTokens"},"liquidity_score":0.0,"market_cap_rank":3612,"name":"SalPay","public_interest_score":23.945,"symbol":"sal","tickers":[{"base":"SAL","market":{"identifier":"quoine","name":"Liquid"},"target":"BTC"}]}