{"address":"0x7aCB51E690301b114a2A65B2E557cC1B7e644ba8","coingecko_rank":4150,"coingecko_score":5.284,"community_score":7.642,"description":"Expo Token is an internal calculation unit of the Online Expo platform which users can exchange for all company products, services and but exhibitors products on Expo Market. Thanks to the closed chain of services on Online Expo, customers (exhibitors, sellers, traders of offline expo) by using Expo Token can significantly reduce the business processes costs, by freeing themselves from various external commissions.\n\nVirtual exhibition services payment are more profitable, since the discount from 10 to 50% for all services is provided in condition if Expo Token payment is done.\n\nIn ExpoMarket you can use tokens to purchase not even goods by end users of expo, but also raw materials, equipment for the same products production, which significantly reduces their cost and price for customers.\n\nCompanies can look for employees and vendors by paying for their Expo Token services. In turn, employees can exchange them for any currency or use to promote their resume.\n\nAll the company services are aimed at the cash cycle within one ecosystem, which maximally cover the majority of business processes and significantly saves their money and time.\n\nUsing the Expo Arbitrage service, customers can enter into secure transactions without commissions with help of EXPO token.","developer_score":0.0,"id":"online-expo","image":{"large":"https://assets.coingecko.com/coins/images/6548/large/t4GE48eH_400x400.png?1547042762","small":"https://assets.coingecko.com/coins/images/6548/small/t4GE48eH_400x400.png?1547042762","thumb":"https://assets.coingecko.com/coins/images/6548/thumb/t4GE48eH_400x400.png?1547042762"},"links":{"bitcointalk_thread_identifier":4350099,"blockchain_site":["https://etherscan.io/token/0x7acb51e690301b114a2a65b2e557cc1b7e644ba8","https://ethplorer.io/address/0x7acb51e690301b114a2a65b2e557cc1b7e644ba8"],"facebook_username":"onlineexpos","homepage":["https://online-expo.com/"],"twitter_screen_name":"Online_Expos"},"liquidity_score":1.0,"market_cap_rank":2796,"name":"Expo Token","public_interest_score":31.738,"symbol":"expo","tickers":[{"base":"EXPO","market":{"identifier":"hotbit","name":"Hotbit"},"target":"BTC"},{"base":"EXPO","market":{"identifier":"hotbit","name":"Hotbit"},"target":"ETH"}]}