{"address":"0x7a18919f0b05fA5e91F3eF43aFE8a72105C9d4B8","coingecko_rank":2674,"coingecko_score":10.102,"community_score":29.869,"description":"Blockchain and cryptocurrencies are changing the global financial landscape, providing new investment and trading opportunities to retail consumers who have up until now relied on traditional FinTech investment applications. Today, anybody can become a cryptocurrency investor or trader with a minimum investment. This has brought many newcomers to cryptocurrency markets who did not reviously possess the technical know-how in currency trading. For instance, a taxi driver or a pianist can trade or invest in cryptocurrencies and ICOs in their spare time with a small amount of funds and make higher returns than with traditional market retail investment applications.\n\nSuccessful cryptocurrency traders have one thing in common - they do not guess. To make consistently positive returns, they dedicate days, if not weeks, researching their first currency purchase. It can take them months or years to develop technical and market specific knowledge to invest in multiple cryptorelated assets effectively. It is important to note that this time is not free - aside from forfeited work and personal activities, this time can often mean missed opportunities, when an investor has been too slow to capitalize on profitable opportunities.\n\nThis is where WatermelonBlock comes in - making cryptocurrency, ICO investment and trading simple enough to fit any lifestyle, while being smarter and faster than traditional investment analysis.\n\nAs part of its Phase I implementation, WatermelonBlock will provide actionable insights in real time while making the whole investing and trading process simple, easy, reliable and trustworthy. This will be done with the help of proprietary algorithms and the robust, scalable processing power of IBM Watson Artificial Intelligence (AI).\n\nWatermelonBlock‚ s phase II implementation, targeted to be launched in the third quarter of 2019, intends to analyze information which would take human minds hundreds and thousands of hours to process. This makes the process faster, more efficient and accurate using AI and machine learning that factor in behavioral finance and economic methods of analysis. WatermelonBlock will be able to cleverly analyze market sentiment by combining technical and social big data sets. Utilizing the efficacy of AI, WatermelonBlock will not be vulnerable to the biases of any particular investor, group or strategy.","developer_score":0.0,"id":"watermelonblock","image":{"large":"https://assets.coingecko.com/coins/images/4668/large/wmb.png?1547039935","small":"https://assets.coingecko.com/coins/images/4668/small/wmb.png?1547039935","thumb":"https://assets.coingecko.com/coins/images/4668/thumb/wmb.png?1547039935"},"links":{"announcement_url":["https://medium.com/@watermelonblock"],"bitcointalk_thread_identifier":4565675,"blockchain_site":["https://etherscan.io/token/0x7a18919f0b05fa5e91f3ef43afe8a72105c9d4b8"],"facebook_username":"watermelonblock","homepage":["https://watermelonblock.io/"],"subreddit_url":"https://www.reddit.com/r/WatermelonBlock/","telegram_channel_identifier":"WMBcommunity","twitter_screen_name":"watermelonblock"},"liquidity_score":1.0,"market_cap_rank":3625,"name":"WatermelonBlock","public_interest_score":24.351,"symbol":"wmb","tickers":[{"base":"WMB","market":{"identifier":"idex","name":"Idex"},"target":"ETH"}]}