{"address":"0x83e2BE8d114F9661221384B3a50d24B96a5653F5","coingecko_rank":182,"coingecko_score":39.597,"community_score":32.343,"description":"0xcert is an open source, a permission-less protocol for certified non-fungible tokens on the blockchain. These tokens are stored in cryptographic wallets and are owned by users. In addition to common functions for managing and transferring standard non-fungible tokens, the 0xcert protocol provides conventions for creating certified non-fungible tokens from unique digital assets. These tokens are called Xcerts and are created through a custom minting process. Xcerts represent standard non-fungible tokens, which also hold information about a real-world digital asset. With 0xcert protocol, we can validate a proof of existence, authenticity, and ownership of these digital assets without third-party involvement.\n\nThe protocol also uses fungible tokens known as ZXC as utility tokens in the system and comply with the ERC20 standard on the <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> blockchain. The tokens are used to support decentralized applications that are built on top of the protocol. The role of the token is to be a mechanism used as an incentive and to support the entire ecosystem.\n\nThe flexible nature of the 0xcert protocol infrastructure ensures that interoperability is achieved among decentralized applications. The protocol is flexible enough to support a variety of business models.The availability of the protocol's pluggable framework allows for the reduction of the time used during the building of decentralized applications.The protocol contains a registry of issuers that have been verified on the network, which allows for the authentication of issuers as well as knowing their validity. A common registry reduces the time taken for verification and reduces business risk.","developer_score":66.441,"id":"0xcert","image":{"large":"https://assets.coingecko.com/coins/images/4552/large/0xcert.png?1547039841","small":"https://assets.coingecko.com/coins/images/4552/small/0xcert.png?1547039841","thumb":"https://assets.coingecko.com/coins/images/4552/thumb/0xcert.png?1547039841"},"links":{"bitcointalk_thread_identifier":4434967,"blockchain_site":["https://enjinx.io/eth/token/0x83e2be8d114f9661221384b3a50d24b96a5653f5","https://etherscan.io/token/0x83e2be8d114f9661221384b3a50d24b96a5653f5","https://ethplorer.io/address/0x83e2be8d114f9661221384b3a50d24b96a5653f5"],"facebook_username":"0xcert","homepage":["https://0xcert.org/"],"repos_url":{"github":["https://github.com/0xcert/ethereum-erc721","https://github.com/0xcert/framework"]},"subreddit_url":"https://www.reddit.com/r/0xcert","telegram_channel_identifier":"zeroxcert","twitter_screen_name":"0xcert"},"liquidity_score":11.888,"market_cap_rank":974,"name":"0xcert","public_interest_score":25.16,"symbol":"zxc","tickers":[{"base":"ZXC","market":{"identifier":"bitforex","name":"Bitforex"},"target":"ETH"},{"base":"ZXC","market":{"identifier":"bitforex","name":"Bitforex"},"target":"USDT"},{"base":"ZXC","market":{"identifier":"idex","name":"Idex"},"target":"ETH"}]}