{"address":"0x865D176351f287fE1B0010805b110d08699C200A","coingecko_rank":1002,"coingecko_score":22.095,"community_score":6.719,"description":"The Bananacoin Project was established by a group of professionals with over 3 years of experience in producing bananas in Laos, consulted by software development experts and professional lawyers, in order to take advantage of blockchain technology in addressing real business objectives.\n\nThe strategic goal of the project is a core modification of business and export relationships connected to the production and delivery of bananas. The initiators of the project have set a goal — to decentralize the process of business expansion and take it beyond the framework of traditional partnerships.\n\nThe Bananacoin Project will facilitate wider recognition of blockchain technology on the commodity market, forming a close connection with blockchain communities — Bitcoin, Ethereum, WAVES and others. Bananacoin will create tokens using blockchain (Ethereum), and tokens will be emitted based on the export price of 1 kilogram of bananas.\n\nProject Description\nBananacoin is blockchain project aiming to achieve a core modification of the global banana production industry, similar to how Uber has revolutionized the taxi industry or how Upwork has brought freelancing to a new level. In short, the initiators of the project create processes in the production of organic bananas through the implementation of an economic element in the seemingly completely understood export relations of the product.\n\nBananacoin is using the proven TGE crowdfunding model, allowing backers to invest in expansion of production and become holders of Bananacoin tokens (BCO), which can be exchanged after project launch for goods or funds and are expected to more than double in value in 18 months’ time.\n\nAfter the realisation of the project, Bananacoin tokens will be exchangeable for a certain amount of Lady Finger bananas or equivalent monetary compensation. Because the token is backed by the market value of 1 kilogram of bananas, participants can be certain of the success of the project, as the demand for bananas is constant. Furthermore, Lady Finger bananas are considered to be among the best banana varieties, and the environmentally friendly technologies used in our project ensure that the good will remain an attractive investment and that its price will grow constantly","developer_score":31.775,"id":"bananacoin","image":{"large":"https://assets.coingecko.com/coins/images/3709/large/25353901_371505116655449_7707345238136643950_n.png?1547038731","small":"https://assets.coingecko.com/coins/images/3709/small/25353901_371505116655449_7707345238136643950_n.png?1547038731","thumb":"https://assets.coingecko.com/coins/images/3709/thumb/25353901_371505116655449_7707345238136643950_n.png?1547038731"},"links":{"bitcointalk_thread_identifier":2112748,"blockchain_site":["https://enjinx.io/eth/token/0x865d176351f287fe1b0010805b110d08699c200a","https://etherscan.io/token/0x865d176351f287fe1b0010805b110d08699c200a","https://ethplorer.io/address/0x865d176351f287fe1b0010805b110d08699c200a"],"facebook_username":"bananacoinENG","homepage":["https://www.bananacoin.io/"],"repos_url":{"github":["https://github.com/banana-coin/website"]},"telegram_channel_identifier":"bananacoineng","twitter_screen_name":"Bananacoin_Eng"},"liquidity_score":1.0,"market_cap_rank":1123,"name":"BananaCoin","public_interest_score":26.379,"symbol":"bco","tickers":[{"base":"BCO","market":{"identifier":"ddex","name":"DDEX"},"target":"WETH"},{"base":"BCO","market":{"identifier":"forkdelta","name":"ForkDelta"},"target":"ETH"},{"base":"BCO","market":{"identifier":"thetokenstore","name":"Token.Store"},"target":"ETH"}]}