{"address":"0x8A2A3F3ffb78880838f9d7603601f837F72C2Ec9","coingecko_rank":5215,"coingecko_score":0.2,"community_score":0.0,"description":"When 5G is opened, everything will be connected to the Internet. In the future, we will come to a world in which we can control everything remotely, without latency, through sensors installed on objects.\n\nG-BOX wants to create a platform where you can enjoy offline arcade games anytime and anywhere in the new world. Through the G-BOX, RC racing, drones, Gacha games, and more, you can enjoy a world where you can enjoy anytime.\n\nThe G-BOX team has the idea that it is important to create real products that can be used. We have focused on creating games that are faster to play than creating dozens of white papers like the typical block-chain project and investing time designing the token economy.\n\nAs a result, we are now able to launch G-BOX's first project game, Remote Robot Crane Game.\n\nUsers can play Remote Robot Crane Game through the GBX token, and if they succeed in the game, they'll get the GBX token. GBX tokens are available through ETH.\n\nIn the future, G-BOX envisions expansion of various projects.We are also preparing games to draw and decorate our own characters through remote robot crane game. We will focus on moving offline games such as digital dice, RC racing, and drones online soon.\n\nWithin these G-BOX games, GBX tokens will be used as the platform's central payment method.","developer_score":0.0,"id":"g-box","image":{"large":"https://assets.coingecko.com/coins/images/9170/large/SzTm73O4_400x400.png?1564990770","small":"https://assets.coingecko.com/coins/images/9170/small/SzTm73O4_400x400.png?1564990770","thumb":"https://assets.coingecko.com/coins/images/9170/thumb/SzTm73O4_400x400.png?1564990770"},"links":{"announcement_url":["https://medium.com/@gboxgame"],"blockchain_site":["https://etherscan.io/token/0x8a2a3f3ffb78880838f9d7603601f837f72c2ec9"],"facebook_username":"gboxcoins","homepage":["https://www.g-boxcoin.com/index.html"],"telegram_channel_identifier":"gboxgame"},"liquidity_score":1.0,"market_cap_rank":null,"name":"G-BOX Coin","public_interest_score":0.0,"symbol":"gbx","tickers":[]}