{"address":"0x8B8a8A91d7b8EC2E6ab37Ed8FFbAcEE062C6F3C7","coingecko_rank":2416,"coingecko_score":11.015,"community_score":3.441,"description":"ECP would contribute to the expansion of the cryptocurrency industry to the public, and would strengthen popularization through forming partnerships with diverse industries; shopping centers, hotels, eco and global businesses. ECP makes a progress for utilization in various life style areas, in addition to achieving the largest number of users and affiliated stores.\nECP is aiming at utility maximization, simplifying transaction processes that are based on intensive new technologies. When we consider any general process, intermediaries are located between customers and sellers. Cryptocurrencies prove their real merits in a B2C transaction, which doesn’t require any intermediary. ECP suggests simple and convenient transaction processes by minimizing complex steps and additional charges. These would work as the great strength for both sellers and customers, because of reduced incidental costs and improved work efficiency. Moreover, these also contribute to the advancement of the industry and the market.\nECP+ is available at various affiliates that not only domestic but also hotels, franchises, online malls, and performance shows, etc. in China, USA, and Vietnam, etc.","developer_score":0.0,"id":"ecp-technology","image":{"large":"https://assets.coingecko.com/coins/images/8507/large/lhwmJl7R_400x400.png?1574931781","small":"https://assets.coingecko.com/coins/images/8507/small/lhwmJl7R_400x400.png?1574931781","thumb":"https://assets.coingecko.com/coins/images/8507/thumb/lhwmJl7R_400x400.png?1574931781"},"links":{"blockchain_site":["https://etherscan.io/token/0x8b8a8a91d7b8ec2e6ab37ed8ffbacee062c6f3c7"],"homepage":["https://epay-global.io/","https://kor.epay-global.io/"],"twitter_screen_name":"ECP_plus"},"liquidity_score":38.442,"market_cap_rank":2253,"name":"ECP+ Technology","public_interest_score":24.666,"symbol":"ecp","tickers":[{"base":"ECP","market":{"identifier":"p2pb2b","name":"P2PB2B"},"target":"ETH"}]}