{"address":"0x8DB90E3e7D04C875a51997092f9178FCac9DefdB","coingecko_rank":1260,"coingecko_score":19.74,"community_score":4.315,"description":"Portal aims to build a virtual reality ecosystem based on blockchain technology to connect virtual reality content, creators and users.\n\nVR/AR is recognized as the next-generation general-purpose computing platform. Portal will assume the important task of promoting the virtual reality industry's ecological development and accelerate the advent of the VR/AR era.\n\nPortal will solve three major problems in VR applications: trust mechanism, equity distribution and content circulation:\n\nThe Portal protocol, built on the basis of non-mutability, solves the trust problem in the virtual world and will become the cornerstone of the user relationship in the Portal virtual world.\n\nThe decentralization setup allows any user to create a reasonable distribution of benefits in the Portal, whether producing contents or providing services;\n\nPortal is a large ecology of virtual reality content. It will stimulate active behavior through unique ecological mechanisms and enhance the circulation of content.\n\nPortal is composed of industry elites from the field of virtual reality, while at the same time they are supported by experts and scholars from the blockchain field. Portal has reached strategic partnerships with leading VR companies in the world, and is actively promoting the layout and ecological construction of global virtual reality content.","developer_score":0.0,"id":"portal","image":{"large":"https://assets.coingecko.com/coins/images/6626/large/Nljbrphf_400x400.jpg?1547042827","small":"https://assets.coingecko.com/coins/images/6626/small/Nljbrphf_400x400.jpg?1547042827","thumb":"https://assets.coingecko.com/coins/images/6626/thumb/Nljbrphf_400x400.jpg?1547042827"},"links":{"blockchain_site":["https://enjinx.io/eth/token/0x8db90e3e7d04c875a51997092f9178fcac9defdb","https://etherscan.io/token/0x8DB90E3e7D04C875a51997092f9178FCac9DefdB","https://ethplorer.io/address/0x8db90e3e7d04c875a51997092f9178fcac9defdb"],"facebook_username":"Project-Portal-1638917542833085","homepage":["http://www.project-portal.io/"],"telegram_channel_identifier":"ProjectportalEN","twitter_screen_name":"contact2portal"},"liquidity_score":16.75,"market_cap_rank":674,"name":"Portal","public_interest_score":45.064,"symbol":"portal","tickers":[]}