{"address":"0x8f66A173696502A0aD280781C3e55928A06c1312","coingecko_rank":2793,"coingecko_score":8.715,"community_score":13.251,"description":"Peoplewave was born out of a deep frustration. Many smart and good people have become victims of corporate restructures, biased decision-making or been unfairly treated. The sad truth is that most managers are poorly trained in people management or have simply been thrust into these roles without guidance, mentoring or adequate support. At the same time, Human Resources teams often don’t play an active role in managing employees. The HR function has become overworked, compliance-driven and too focused on talent acquisition – not employee development and people management. Today, user data cannot be taken for granted due to the scandals we read in the papers. HR performance data is kept by your company and you should own it but don't.\n\n\nPeoplewave was created to fix this.\n\nLaunched in Singapore with a simple goal, to put people first in people management. We do this by championing transparency and data-driven decision-making through our onboarding, performance review and employee analytics products. Peoplewave has been named “Top 50 Most Promising Enterprise Start-ups in the Asia Pacific” by CIO Outlook Magazine and “Top 20 Hottest Startups 2018” by Singapore Business Review. Renowned ICO adviser, Simon Cocking has also joined the team in April 2018. \n\n\nPeoplewave will be rolling out a suite of blockchain ready products called Wavebase. a blockchain solution using a smart contract to tackle one of the greatest problems in HR – verifying an employee, their performance, their history and information across multiple companies, roles and managers.","developer_score":12.0,"id":"peoplewave","image":{"large":"https://assets.coingecko.com/coins/images/3837/large/Square-darkBG.png?1547038903","small":"https://assets.coingecko.com/coins/images/3837/small/Square-darkBG.png?1547038903","thumb":"https://assets.coingecko.com/coins/images/3837/thumb/Square-darkBG.png?1547038903"},"links":{"bitcointalk_thread_identifier":3298855,"blockchain_site":["https://etherscan.io/token/0x8f66a173696502a0ad280781c3e55928a06c1312","https://ethplorer.io/address/0x8f66a173696502a0ad280781c3e55928a06c1312"],"facebook_username":"PeoplewaveHR","homepage":["https://peoplewaveico.io/"],"repos_url":{"github":["https://github.com/peoplewave-ico/wavebase"]},"subreddit_url":"https://www.reddit.com/r/peoplewaveico","telegram_channel_identifier":"peoplewaveico","twitter_screen_name":"peoplewavehr"},"liquidity_score":0.0,"market_cap_rank":5768,"name":"Peoplewave","public_interest_score":24.023,"symbol":"pwv","tickers":[]}