{"address":"0x905E337c6c8645263D3521205Aa37bf4d034e745","coingecko_rank":606,"coingecko_score":28.442,"community_score":14.539,"description":"DOCADEMIC HAS CREATED FREE BASIC HEALTHCARE FOR THE WORLD TROUGH TELEMEDICINE. Docademic has created Free Basic Healthcare for the world through Telemedicine. Now offering its service in 20 countries in LatAm, Docademic has thousands of users and is putting all the data on an innovative healthcare blockchain. Docademic´s ICO token economics are amazing and were calculated based on how much money is needed to expand to the US and Europe. By providing Free Basic Healthcare for the world not only is Docademic revolutionizing helathcare access, its also one of the most significant blockchain and tech projects ever. Docademic is proud to be John McAfees choice for a Healthcare blockchain!\n\nThe DOCADEMIC PLATFORM is a single globally-sourced healthcare service platform for the public that begins with free Human Doctor-AI assisted Video Telemedicine service (DOCADEMIC APP) already in use in 20 countries by thousands of users and an associated suite of AI assisted tools and social network for the medical community (Docademic for Doctors). Combined, these produce the highest level of free basic quality healthcare allowing any individual to access the benefits and knowledge of healthcare that technology now permits.\n\nThe DOCADEMIC PLATFORM´s DOCADEMIC APP is built on top of DOCADEMIC´s existing, patient data routing and AI assisted technologies soon to be blockchain enabled. With its simplicity of use It becomes the ultimate resource for anyone who needs orientation in a health-related issue—a one touch system that connects any patient with a Doctor through Video Telemedicine for free, from any country a user is located in. All patient information will be secured on a blockchain and represents a perfect On-Ramp to healthcare services on a blockchain. In comparison, other healthcare related blockchain projects don’t have an effective On-Ramp to healthcare services. With our free Telemedicine service we can get the masses to benefit from blockchain technology in Healthcare.\n\nThe DOCADEMIC PLATFORM´s DOCADEMIC FOR DOCTORS social network offers Ongoing Medical education, Patient referrals, Tools for doctors everyday practice, and Real Time Reporting of epidemiological data for our clients and researchers. Serving all client sizes and requirements: The DOCADEMIC Platform combines it’s DOCADEMIC APP and DOCADEMIC FOR DOCTORS social network to derive high-end services such as real-time geographic epidemiological data reporting, Automated AI-Driven treatment and diagnosis suggestions for Doctors in institutions or private practice, massive access to patient populations for preventative campaigns, and DOCADEMIC´s advanced proprietary Tools such as\nits AI-assisted Electronic Health Record and Digital Vademecum.\n\nA universal native Token: the MEDICAL TOKEN CURRENCY, MTC is the fuel that will power all services DOCADEMIC provides. We are already in talks with Healthcare institutions, Governments and partners to make MTC the preferred Token for their own upcoming and existing medical services, as they migrate to decentralized platforms. We envision MTC will be used in the broader Healthcare industry and any other industries for various purposes including payment and remittance.\n\nThe end goal: DOCADEMIC is building a solid, global Healthcare utility—an advanced platform the entire patient population and medical community will use to great advantage; where anyone can participate as users and Token holders.\n\nDOCADEMIC will become a complete healthcare ecosystem for the worldwide patient/Doctor population with digital access.","developer_score":16.562,"id":"medical-token-currency","image":{"large":"https://assets.coingecko.com/coins/images/4177/large/Webp.net-resizeimage_%2832%29.png?1547039449","small":"https://assets.coingecko.com/coins/images/4177/small/Webp.net-resizeimage_%2832%29.png?1547039449","thumb":"https://assets.coingecko.com/coins/images/4177/thumb/Webp.net-resizeimage_%2832%29.png?1547039449"},"links":{"blockchain_site":["https://enjinx.io/eth/token/0x905e337c6c8645263d3521205aa37bf4d034e745","https://etherscan.io/token/0x905e337c6c8645263d3521205aa37bf4d034e745","https://ethplorer.io/address/0x905e337c6c8645263d3521205aa37bf4d034e745"],"facebook_username":"Docademic","homepage":["https://docademic.com/","https://ico.docademic.com/"],"repos_url":{"github":["https://github.com/Docademic/Docademic-ICO","https://github.com/Docademic/MTC"]},"twitter_screen_name":"docademic"},"liquidity_score":24.558,"market_cap_rank":271,"name":"Docademic","public_interest_score":34.062,"symbol":"mtc","tickers":[{"base":"MTC","market":{"identifier":"coinall","name":"CoinAll"},"target":"BTC"},{"base":"MTC","market":{"identifier":"coinbene","name":"CoinBene"},"target":"BTC"},{"base":"MTC","market":{"identifier":"idex","name":"Idex"},"target":"ETH"},{"base":"MTC","market":{"identifier":"latoken","name":"LATOKEN"},"target":"BTC"},{"base":"MTC","market":{"identifier":"latoken","name":"LATOKEN"},"target":"ETH"},{"base":"MTC","market":{"identifier":"sistemkoin","name":"Sistemkoin"},"target":"BTC"},{"base":"MTC","market":{"identifier":"sistemkoin","name":"Sistemkoin"},"target":"ETH"},{"base":"MTC","market":{"identifier":"sistemkoin","name":"Sistemkoin"},"target":"TRY"},{"base":"MTC","market":{"identifier":"sistemkoin","name":"Sistemkoin"},"target":"USDT"}]}