{"address":"0x9002D4485b7594e3E850F0a206713B305113f69e","coingecko_rank":3308,"coingecko_score":7.639,"community_score":19.481,"description":"HAT.Exchange allows users complete control over their crypto assets and offers the opportunity to purchase crypto with regular currencies.\n\nThe Hash Algorithmic Technologies (HAT) ecosystem is designed to cater to the needs of the average person. It's vision is to bring the benefits of crypto to the global audience using a simple, intuitive and reliable application. Based on the Ethereum blockchain, it aims to offer support for all ERC-20 tokens and major cryptocurrencies like BTC, ETH, LTC.\n\nIn order to provide users easy access to purchasing crypto, the HAT.CashCards will act like prepaid cards allowing users to simply load fiat money into their HAT.Wallet, which can then be used to purchase HAT tokens. Despite being an exchange, HAT does not hold user assets. All information is stored on user's device and encrypted for security.\n\nCash Cards\nHAT.CashCards let users purchase prepaid codes locally or online with the payment options available to them. Once the value is redeemed, it can be spent on purchasing either HAT tokens or BTC, LTC and ETH. Cash Cards are the cornerstone of true mass adoption, enabling users in territories with less advanced financial systems to buy into crypto with incredible ease.\n\nStaking with HAT.Wallet\nThe HAT.Wallet functions as an independent application, allowing users to stake their HAT tokens on the Ethereum network. The process is instant and incurs a small gas fee (charged in ETH). Staking is a crucial part of the IFS rewards system where users can earn HAT tokens, as rewards, at a fixed ARR every year.\n\nThe IFS model will continue to drop rewards to 'stakers' until the 7 million hard cap is reached. Once the total supply is achieved, users can continue to stake their tokens and receive rewards from the pool of tokens gathered through transaction fees. The IFS model is designed to offer rewards for an indefinite period of time. Interactions on the blockchain, such as adding and withdrawing stake or claiming rewards, incur small fees in ETH as gas.","developer_score":0.0,"id":"hawala-today","image":{"large":"https://assets.coingecko.com/coins/images/1171/large/HAT_Token.png?1547035201","small":"https://assets.coingecko.com/coins/images/1171/small/HAT_Token.png?1547035201","thumb":"https://assets.coingecko.com/coins/images/1171/thumb/HAT_Token.png?1547035201"},"links":{"bitcointalk_thread_identifier":2285591,"blockchain_site":["https://etherscan.io/token/0x9002d4485b7594e3e850f0a206713b305113f69e","https://ethplorer.io/address/0x9002d4485b7594e3e850f0a206713b305113f69e"],"facebook_username":"hawalatoday","homepage":["https://hat.exchange/"],"subreddit_url":"https://www.reddit.com/r/HATexchangeCommunity/","telegram_channel_identifier":"hat_public","twitter_screen_name":"HAT_Exchange"},"liquidity_score":0.0,"market_cap_rank":3041,"name":"HAT Token","public_interest_score":27.686,"symbol":"hat","tickers":[]}