{"address":"0x92736b3bFF1bBD72A72478D78f18A6ab9b68b791","coingecko_rank":2668,"coingecko_score":10.363,"community_score":31.317,"description":"The Sandblock ecosystem is designed to solve businesses’ reward programs pain points. The ecosystem is based on the blockchain and a cryptocurrency, the SAT, allowing merchants to create their own Branded token on top of it and emit coupons, vouchers, loyalty points, that customers can use or trade with each other and use freely.\n\nCustomers have access to the ecosystem using a simple mobile application. This application allows anyone to use and enjoy the power of the blockchain and cryptocurrencies. Customers can earn and redeem tokens from their merchants and barter them using the in-app marketplace as they wish. They can also answer surveys, engage with their favorite brands through games and contests directly within the application.\n\nMerchants can enjoy an access to a tremendous amount of anonymized data about their customers behaviours. Using this data, merchants have the ability to improve their services and better understand their customers. They can also quickly identify smarter co-branding strategies or detect drivers behind churn.","developer_score":0.0,"id":"sandblock","image":{"large":"https://assets.coingecko.com/coins/images/2791/large/sat.png?1547036970","small":"https://assets.coingecko.com/coins/images/2791/small/sat.png?1547036970","thumb":"https://assets.coingecko.com/coins/images/2791/thumb/sat.png?1547036970"},"links":{"bitcointalk_thread_identifier":2254884,"blockchain_site":["https://etherscan.io/token/0x92736b3bff1bbd72a72478d78f18a6ab9b68b791"],"facebook_username":"sandblock.io","homepage":["https://sandblock.io/"],"repos_url":{"github":["https://github.com/SandblockIO"]},"subreddit_url":"https://www.reddit.com/r/sandblock_io/","telegram_channel_identifier":"sandblock_io","twitter_screen_name":"sandblock_io"},"liquidity_score":0.0,"market_cap_rank":null,"name":"Sandblock","public_interest_score":25.338,"symbol":"sat","tickers":[]}