{"address":"0x9205C049C231DdA51bAce0ba569f047E3E1e9979","coingecko_rank":2201,"coingecko_score":8.917,"community_score":4.137,"description":"The goal of LATAM Cash is to provide an integrated crypto financial platform, a crypto bank for deposits, withdraws and loans for its users. LATAM Cash will provide simple payment platform through mobile, International remittance or exchange, offline payments and crypto invest funds. The platform will also provide blockchain base digital contents as games, Webtoon etc.\n\nThe main features of LATAM Cash will be its inexpensive cost with no exchange commission and a low payment fee between 5% and 1.5%. Also, the convenience of making payments using QR code without any connection to Payment Gateways, and real-time payment and monitoring. For last, it’s security and reliability with its blockchain technology.\nThe integrated crypto finance platform of LATAM Cash provides various crypto coins in one wallet specialized for multi coin. It’s safe as the platform secure your assets by End-To-End security technology provided by security experts, and the user does not have to worry about lost mnemonics with cloud backup. It’s easy to use as the platform uses a simple design that makes the management of multiple wallet addresses easy. The user can add and manage digital assets with a single click. Also it’s quick to make fast exchange of different coins between chains. The users are also able to exchange the desired coin easily.\n\nLATAM Cash market expansion strategy is to use E-commerce, offline franchises, YouTube creators and local PC Cafes. The current LATAM region game market size is of 4.2 billion dollars. The platform also aims to build a K-Coin synchronized system between Kaybo.com game platform virtual currency (K-Coin) and LATAM cash. In the virtual wallet of LATAM cash, users can store not only crypto currencies as Bitcoin and Ethereum, but also the virtual currency from Kaybo.com game platform.","developer_score":0.0,"id":"latamcash","image":{"large":"https://assets.coingecko.com/coins/images/10999/large/a2RfSSOz_400x400.jpg?1587027551","small":"https://assets.coingecko.com/coins/images/10999/small/a2RfSSOz_400x400.jpg?1587027551","thumb":"https://assets.coingecko.com/coins/images/10999/thumb/a2RfSSOz_400x400.jpg?1587027551"},"links":{"announcement_url":["https://medium.com/latamcash"],"blockchain_site":["https://etherscan.io/token/0x9205c049c231dda51bace0ba569f047e3e1e9979"],"facebook_username":"latamcash","homepage":["https://latamcash.io/"],"telegram_channel_identifier":"latamcashofficialgroup","twitter_screen_name":"latamcash"},"liquidity_score":40.032,"market_cap_rank":null,"name":"Latamcash","public_interest_score":0.0,"symbol":"lmch","tickers":[{"base":"LMCH","market":{"identifier":"crex24","name":"CREX24"},"target":"BTC"},{"base":"LMCH","market":{"identifier":"crex24","name":"CREX24"},"target":"ETH"},{"base":"LMCH","market":{"identifier":"crex24","name":"CREX24"},"target":"USDT"},{"base":"LMCH","market":{"identifier":"digifinex","name":"Digifinex"},"target":"BTC"},{"base":"LMCH","market":{"identifier":"velic","name":"Velic"},"target":"BTC"}]}