{"address":"0x926Be13B4d93F29eA254E4e518f33099e45d7f06","coingecko_rank":3376,"coingecko_score":7.478,"community_score":0.0,"description":"POC Chain is an innovative supply chain ﬁnancing ecosystem that focuses on resolving the ﬁnancing difﬁculties faced by small and medium-sized enterprises and emphasizing the application of the system in real-life scenarios, . Consulted by a group of renowned experts, such as the the former chief engineer of Shanghai Stock Exchange, the former vice chairman of Accenture, a Ph. D. advisor in ﬁnance as well as founders of e-commerce, logistics, Internet of things and factoring companies, POC Chain is founded by Intel's former deputy general manager in China and a team of experts in block chain technology, artiﬁcial intelligence, ﬁnancial technology andsupply chain. Based on block chain and artiﬁcial intelligence (NLP), POC Chain builds a highly efﬁcient and secure compound chain. The unique Token ecosystem expanded the core features of the blockchain experimentally.\n\nAs a function Token, POCC is the virtual “fuel” of the POC Chain platform and is an important part of the POC Chain ecosystem. They are used as the means of payment for using the various applications on the platform, such as the operation of\nsmart contracts, distributed applications, loan collateral, guarantee and etc. They encourage participants to make contribution to the ecosystem, maintain the ecosystem, and take part in the financing activities, thus ensuring that financial institutions, enterprises, employees and consumers can materialise their needs in raising, lending, and investing finances.","developer_score":0.0,"id":"poc-chain","image":{"large":"https://assets.coingecko.com/coins/images/7718/large/logo_%281%29.png?1549956313","small":"https://assets.coingecko.com/coins/images/7718/small/logo_%281%29.png?1549956313","thumb":"https://assets.coingecko.com/coins/images/7718/thumb/logo_%281%29.png?1549956313"},"links":{"blockchain_site":["https://etherscan.io/token/0x926Be13B4d93F29eA254E4e518f33099e45d7f06"],"homepage":["http://www.pocc.io/"]},"liquidity_score":23.397,"market_cap_rank":4855,"name":"POC Chain","public_interest_score":27.986,"symbol":"pocc","tickers":[]}