{"address":"0x946551DD05C5Abd7CC808927480225ce36D8c475","coingecko_rank":2055,"coingecko_score":9.761,"community_score":9.25,"description":"“ONE” is BigONE’s new platform token, issued at total number of 20 billion, and will be locked until mined, and gradually released through an innovative “Trade-Mining” Mechanism. ONE holders will receive 100 percent of trading fee on BigONE’s platform.\n\nONE is divided into two parts:\n\nCommunity-owned\n51% of all ONEs belong to community. The total amount is 10.2 billion. Once mined/released, these ONE tokens can circulate on BigONE.\n\nBIG token holders owned\n49% of all ONEs belong to existing BIG token holders. Total amount of this part is 9.8 billion ONEs, and will be released at the same rate as the community-owned part in proportion. These ONEs will be airdropped to all BIG token holders every day. However, these ONEs airdropped to BIG holders will be frozen till June 21st, 2022 UTC+8, and cannot be circulated on the BigONE trading platform or other platforms during this period.\n\nTrade cryptos in the “Trade-Mining” section, and get your trading fee rebated in ONEs of the equivalent value.\nRefer new users to complete registration, pass identity verification (KYC) on BigONE, and start trading in the “Trade-Mining” section. As incentive, you will receive 20% of your referred new user’s trading fee rebate in the form of ONEs.\nBIG tokens stored on BigONE platform will automatically be airdropped ONEs.\nHold ONEs, Share All Platform Trading Fee\n\nEveryday at 00:00 UTC+8, BigONE will take a snapshot according to the current ONE balance on the platform. All trading fee occurred on the platform during the past 24 hours will be airdropped to all ONE holders in the form of a number of crypto assets received by the platform. Allocation formula = number of ONE held / total number of ONE released\n\nAll ONEs are locked until mined, and will be gradually mined through “Trade-Mining” or “Referral-Mining” or “Airdrop to BIG token holders” until 20 billion ONEs are all mined.\n\n【Trade-Mining】\n\nTrade-Mining can only be achieved by trading crypto assets in the “Trade-Mining” section. Every midnight (or 00:00 UTC+8), the platform will calculate all trading fees occurred in the “Trade-mining” section during the last 24 hours (from the previous 00:00 AM to 24:00 PM UTC+8) and unlock equivalent worth of ONEs using the average price of ONE on the same day. On the following day’s 10:00 UTC+8, the trading platform will rebate these unlocked ONEs to users / miners who traded in the “Trade-mining” section in the previous day.\n\n【Referral-Mining】\n\nReferral-mining is the incentive mechanism for the platform’s existing users to invite new users to sign up BigONE. Every midnight (or 00:00 UTC+8), the trading platform will calculate the total trading fee from your referred new users’ tradings on the previous day (from 00:00 AM to 24:00 PM UTC+8) to the equivalent value of ONEs. BigONE will rebate 20% of your referred new user’s trading fee to you in ONE tokens. Such incentive will be given to you on the same day at 10:00 AM UTC+8.\n\nNote: The ONEs that are referral-mined are released in addition to the regular trade-mined portion, thus BIG token holders will also receive their equivalent proportion of referral-mined ONEs airdropped.\n\n【Airdrop ONEs to BIG Token Holders】\n\nEvery midnight (24:00 PM UTC+8) the platform will take a snapshot of the balance of BIG tokens, and airdrop mined ONEs to BIG holders’ according to the formula: [Previous day’s number of unlocked ONEs in the Community-owned part] / 51 x 49]. However, these ONEs given to BIG holders will be frozen until June 21st, 2022, and cannot be circulated on trading platform during this period, but the platform rebates continue to apply.\n\n【Friendly Tips】\n\nAs soon as the new “Trade-mining” rule applies and 100% of BigONE's revenue (trading fee) is rebated to ONE holders gradually, the previous BIG buy back scheme will be terminated, because BIG holders will get airdropped ONEs and receive related rebate and incentives.\n\nONE is a platform token of BigONE and is not traded on other platforms.\n\nPlease be reminded that crypto assets could be highly volatile with high risks. Any investment decisions should be made with caution.\n\n\n什么是ONE?\n\nONE 是 BigONE 平台推出的积分，发行总量恒定200亿，不增发，初始全部冻结，通过创新的“交易即挖矿”机制逐渐解冻。BigONE会将100%的交易手续费收入奖励给ONE的持有者。\n\nONE 的构成及分配机制\n\n【归属社区用户部分】占比51%，共计102亿个 ONE，解冻以后可以在 BigONE 平台流通；\n【归属BIG Token持有者部分】占比 49%，共计 98 亿个 ONE，将会随社区部分的解冻速度等比例解冻，每天空投给所有 BIG Token 持有者 ，用户因持有BIG Token所获得的ONE梯度解锁（方案待定），而BigONE平台通过持有的BIG Token获得的ONE将锁仓一年（自该部分ONE被自动解冻之日起）。\n获得 ONE 的方式\n\n【交易挖矿专区】交易手续费以等值的 ONE 返还用户。\n邀请新用户完成注册及身份认证，邀请者可获得被邀请者挖矿数量的额外的20%的 ONE奖励。\n存放于 BigONE 平台的 BIG Token 持有者，会获得逐渐解冻的 ONE 。\n持有 ONE 可共享平台全部交易手续费\n\n每天 00:00 按当时 BigONE 平台内的 ONE 持有快照，将前一天平台上产生的交易手续费（以平台交易币种形式），按「持有ONE的个数 / ONE的累积解冻数量」的比例空投到所有 ONE 持有者的账户。\n\nONE初始全部冻结，通过【交易挖矿】/【邀请挖矿】/ 【BIG Token 持有者空投】等方式逐步解冻，直至 200 亿个ONE全部解冻。\n\n【交易挖矿】\n\n只有在【交易挖矿专区】进行币币之间的交易才能实现交易挖矿。每天 0 点，将前一天（0-24点）用户交易时扣除的手续费，按前一天 ONE 的平均价格快照，换算为等值的若干个ONE解冻，并在当天10点，将解冻的ONE返给在专区内交易挖矿的用户。\n\n【邀请挖矿】\n邀请挖矿是平台给老用户介绍新用户的激励机制。每天 0 点，将前一天（0-24点）被邀请用户交易时扣除的手续费折算成等价的 ONE 之后，按 20% 的比例作为邀请返利，并解冻相应的ONE，在当天 10 点返利给邀请者。\n\n注意：邀请挖矿的 ONE 属于额外解冻部分，BIG Token 持有者部分也等比会获得解冻。\n\n【BIG Token 持有者接到空投ONE】\n\n每日 24 点将对 BigONE 平台上 BIG 余额进行快照，并以此数额为准在第二天上午 10 点空投前一日解冻的 ONE。空投标准为【（前一天【社区部分】ONE的解冻数量）/ 51*49】的 ONE，并按持有 BIG 比例，等比例空投给 BIG 持有者账户。\n\n\n【BigONE 温馨提示】\n\nBIG Token 将不继续回购、销毁。\n\nONE 为 BigONE 平台通用积分，未在其他平台流通。\n\n数字资产价格波动大，交易风险高。请您理性判断并结合自身能力审慎做出交易决策。","developer_score":0.0,"id":"one","image":{"large":"https://assets.coingecko.com/coins/images/4960/large/Screenshot_39.png?1561103318","small":"https://assets.coingecko.com/coins/images/4960/small/Screenshot_39.png?1561103318","thumb":"https://assets.coingecko.com/coins/images/4960/thumb/Screenshot_39.png?1561103318"},"links":{"announcement_url":["https://steemit.com/@bigoneexchange"],"blockchain_site":["https://etherscan.io/token/0x946551dd05c5abd7cc808927480225ce36d8c475"],"facebook_username":"exBigONE","homepage":["https://b1.run/","https://big.one/"],"telegram_channel_identifier":"B1_EN","twitter_screen_name":"BigONEexchange"},"liquidity_score":38.632,"market_cap_rank":null,"name":"One","public_interest_score":0.0,"symbol":"one","tickers":[{"base":"DOT","market":{"identifier":"bigone","name":"BigONE"},"target":"ONE"}]}