{"address":"0x95dAaaB98046846bF4B2853e23cba236fa394A31","coingecko_rank":1902,"coingecko_score":14.739,"community_score":26.44,"description":"ETHEREMON is a decentralized application/blockchain game built on the Ethereum network. It simulates a world of ether monsters (Etheremon) where you can capture, trade and evolve Etheremon to defeat others.\n\nAs a decentralized application, or dApp, no one controls the Etheremon world, and no one can take away your Etheremon or cheat you in this world. The game is immune to any outside influence as it’s guaranteed to execute only what Etheremon’s smart contracts were programmed to do. (The source code is verified and available for anyone to view. Nothing is hidden in this world). Moreover, because the Ethereum network runs on thousands of machines simultaneously, the services are provided with a 100% uptime guarantee.\n\nEtheremon can be traded or sold like any traditional collectible. Unlike traditional collectibles, in the Etheremon world, you can train your Etheremon, defeat others, and earn EMONT (an in-game currency ERC-20 token).\n\nEMONT is the in-game currency of Etheremon. Being an ERC20 token, it is transferable and limited. There are only 20 million EMONT created. They are distributed as follows:\n\n70% or 14 million: to be “mined” by players during in-game operations such as battling. After all tokens are mined, the game will be self-sustainable and operated entirely with EMONT tokens (no Ether is needed at that time).\n25% or 5 million: reserved for our User Growth Pool.\n5% or 1 million: reserved for the development team.\n\nPlayers will earn EMONTs from some game activities (winning battles, tournaments) and can use these tokens to perform others (buying eggs, sending monsters on adventures).","developer_score":21.259,"id":"etheremontoken","image":{"large":"https://assets.coingecko.com/coins/images/7272/large/Etheremon.jpg?1547043896","small":"https://assets.coingecko.com/coins/images/7272/small/Etheremon.jpg?1547043896","thumb":"https://assets.coingecko.com/coins/images/7272/thumb/Etheremon.jpg?1547043896"},"links":{"blockchain_site":["https://etherscan.io/token/0x95daaab98046846bf4b2853e23cba236fa394a31"],"chat_url":["https://discord.gg/xgJpuzc"],"facebook_username":"etheremon","homepage":["https://www.etheremon.com"],"repos_url":{"github":["https://github.com/Etheremon/emont-frenzy","https://github.com/Etheremon/frenzy-project","https://github.com/etheremon/smartcontract"]},"subreddit_url":"https://www.reddit.com/r/etheremon/","telegram_channel_identifier":"myetheremon","twitter_screen_name":"myetheremon"},"liquidity_score":1.0,"market_cap_rank":2561,"name":"EtheremonToken","public_interest_score":26.145,"symbol":"emont","tickers":[{"base":"EMONT","market":{"identifier":"radar_relay","name":"Radar Relay"},"target":"WETH"}]}