{"address":"0x960b236A07cf122663c4303350609A66A7B288C0","coingecko_rank":170,"coingecko_score":40.808,"community_score":33.559,"description":"Aragon is a decentralized app (dApp) on the <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> blockchain that allows anyone to create and manage a decentralized organization. The Aragon project is open source and led by the Aragon Foundation. It also includes a token, ANT, that grants voting rights to make decisions about the direction of future development. Eventually, Aragon hopes to be a fully decentralized autonomous organization and dApp that’s a neutral jurisdiction for anyone to create an organization on the blockchain.\n\nIn the early days of development, the project is relying on the nonprofit Aragon Foundation to provide direction and support as the project gets off the ground. The idea, however, is to eventually dissolve, scale back, or change the nature of the Foundation as community support grows. In the future, Aragon will be entirely decentralized and community led. Holders of the ANT token will have voting rights on all issues concerning Aragon. Aragon is an open source, non-profit project. It has many contributors. It also doesn’t technically have a CEO or CTO. Instead, it has a project lead. But don’t get it twisted, the lead is essentially the CEO. uis Cuende is leading the project. In 2011, he received a “Best Underage European Programmer” award, and he’s a recipient of Forbes’ 30 under 30 recognition. He’s a young guy, but with leadership and technical chops. He has advised the Vice President of the European Commission and is an MIT Innovators Under 35 awardee. He has founded several startups and created the first Linux distribution with face login.\n\nAragon offers several core features. It has a module for identity management and closely related modules for ownership and access control. Other modules include shareholder voting, fundraising through token generation, HR onboarding and payroll, and accounts payable/receivable. Taken together, the core functionality of Aragon covers the critical aspects of accounting, governance, and identity that make modern companies work. As you can see, these modules make up most of the administrative functions that a modern company or organization requires. It’s important to emphasize that these modules can individually be turned on and off, providing instant customization for the company’s needs. In addition, all of the code behind Aragon is open source. A company’s development team could edit them as needed to fulfill the company’s requirements.\n\nThe modular design of Aragon doesn’t stop with the core modules that come standard. Just as companies can edit existing modules, they’re free to develop completely new models as well. They can also develop atop the data and structures of existing models for extended functionality. The modular nature of Aragon, combined with its open source ethos, means we could see a whole ecosystem of free to use modules that extend capacity for organizations on Aragon. Aragon explicitly has the goal of creating a digital jurisdiction. Just like countries have jurisdiction over their citizens when it comes to courts of law, Aragon wants to create the first digital court of law. This court wouldn’t operate based on country boundaries. Instead, it would help enforce digital contracts between organizations on the Aragon platform.\n\nThe ANT token is the native token of Aragon and plays a critical role in the governance model and incentive structure of the platform. It represents the wealth of the decentralized economy and was initially sold during Aragon’s highly successful ICO in May 2017 that raised $24 million. Subsequently, the ANT token has come to represent a powerful share of the governance on the platform. ANT holders can vote on proposals, participate in arbitration and the decentralized court system, and help contribute to the non-profit Aragon Foundation or to research and development through the Aragon Nest program.","developer_score":63.312,"id":"aragon","image":{"large":"https://assets.coingecko.com/coins/images/681/large/aragon-logo.png?1547034433","small":"https://assets.coingecko.com/coins/images/681/small/aragon-logo.png?1547034433","thumb":"https://assets.coingecko.com/coins/images/681/thumb/aragon-logo.png?1547034433"},"links":{"bitcointalk_thread_identifier":1880338,"blockchain_site":["https://enjinx.io/eth/token/0x960b236a07cf122663c4303350609a66a7b288c0","https://etherscan.io/token/0x960b236A07cf122663c4303350609A66A7B288C0","https://ethplorer.io/address/0x960b236a07cf122663c4303350609a66a7b288c0"],"homepage":["https://aragon.one/"],"repos_url":{"github":["https://github.com/aragon/aragon-core"]},"subreddit_url":"https://www.reddit.com/r/aragonproject","twitter_screen_name":"AragonProject"},"liquidity_score":2.701,"market_cap_rank":170,"name":"Aragon","public_interest_score":32.221,"symbol":"ant","tickers":[{"base":"ANT","market":{"identifier":"bitfinex","name":"Bitfinex"},"target":"BTC"},{"base":"ANT","market":{"identifier":"bitfinex","name":"Bitfinex"},"target":"ETH"},{"base":"ANT","market":{"identifier":"bittrex","name":"Bittrex"},"target":"ETH"},{"base":"ANT","market":{"identifier":"credoex","name":"CredoEx"},"target":"CREDO"},{"base":"ANT","market":{"identifier":"gopax","name":"GoPax"},"target":"KRW"},{"base":"ANT","market":{"identifier":"radar_relay","name":"Radar Relay"},"target":"WETH"},{"base":"ANT","market":{"identifier":"upbit","name":"Upbit"},"target":"BTC"},{"base":"ANT","market":{"identifier":"upbit_indonesia","name":"Upbit Indonesia "},"target":"BTC"},{"base":"ANT","market":{"identifier":"vcc","name":"VCC Exchange"},"target":"BTC"},{"base":"ANT","market":{"identifier":"vcc","name":"VCC Exchange"},"target":"ETH"}]}