{"address":"0x971d048E737619884f2df75e31c7Eb6412392328","coingecko_rank":4425,"coingecko_score":4.997,"community_score":9.463,"description":"Sparkster is empowering you to bring your ideas to reality by enabling you to build software without writing code. Then run that software on the Sparkster Decentralized Cloud, a specialized blockchain that can support more than 10 Million TPS\n\nWhat if Decentralized Software could be built by anyone in Plain English, without knowledge of programming or blockchain architecture? That's the Sparkster Platform. What if this Smart Software could run at 10 Million TPS? That's the Sparkster Decentralized Cloud. We're accelerating blockchain adoption, and want you to join our revolution.\n\nThe Sparkster platform is to software what Uber was to the taxi industry - a seismic disruption. Competitors such as Microsoft®, SAP®, Oracle® will have their business models fundamentally disrupted by the advent of user generated software, empowered by the Sparkster platform. We present the fastest, cheapest, easiest, most democratic and personalized way to build software, period.\n\nNow, we’re building the world’s fastest Decentralized Cloud that enables people to execute this software across a network of our community’s cell phones. This combined packaged is not only the cheapest, most democratic and fastest way to build software, but to run software too. A high performance decentralized cloud, as proposed by Sparkster, is necessary to mainstream blockchain adoption.","developer_score":0.0,"id":"sparkster","image":{"large":"https://assets.coingecko.com/coins/images/4310/large/Sparkster.jpg?1547039672","small":"https://assets.coingecko.com/coins/images/4310/small/Sparkster.jpg?1547039672","thumb":"https://assets.coingecko.com/coins/images/4310/thumb/Sparkster.jpg?1547039672"},"links":{"announcement_url":["https://medium.com/sparkster","https://steemit.com/@sparkster"],"blockchain_site":["https://etherscan.io/token/0x971d048e737619884f2df75e31c7eb6412392328","https://ethplorer.io/address/0x971d048e737619884f2df75e31c7eb6412392328"],"chat_url":["https://t.me/SparksterNews"],"homepage":["https://sparkster.me/"],"repos_url":{"github":["https://github.com/sparkster-me/Decentralized-Cloud"]},"telegram_channel_identifier":"SparksterICO","twitter_screen_name":"Sparkster_Me"},"liquidity_score":1.0,"market_cap_rank":2754,"name":"Sparkster","public_interest_score":24.311,"symbol":"sprk","tickers":[{"base":"SPRK","market":{"identifier":"bilaxy","name":"Bilaxy"},"target":"ETH"},{"base":"SPRK","market":{"identifier":"latoken","name":"LATOKEN"},"target":"ETH"}]}