{"address":"0x983F6d60db79ea8cA4eB9968C6aFf8cfA04B3c63","coingecko_rank":94,"coingecko_score":48.499,"community_score":47.123,"description":"SONM is a global operating system that is also a decentralized worldwide fog supercomputer. With SONM, users have access to general-purpose computing services of a cloud-like nature, including IaaS and PaaS, all of which have fog computing as the backend. Hosts around the world can contribute computing power as part of the SONM marketplace. The leaders of SONM are co-founder Sergey Ponomarev and CTO Igor Lebedev. SONM uses the agile development framework with a self-organizing cross-functional team.\n\nThe Product Management Board defines the market needs to confirm that products meet business requirements. These include Node (Core), Smart Contracts, Wallet (Client), and Distributed Entity and Integration. Each of these teams has multiple developers, including a lead. Other teams include the Product & Analytics and QA teams.SONM always makes customer satisfaction its top priority. SONM studies the rental resource market to figure out exactly what customers need, delivering the advantages like scalability already mentioned. Additionally, customers will benefit from the Infrastructure-as-a-Service platform that supports all types of hardware resources, making it possible to find the exact resource you need. With SONM, consumers can instantly release and grow resources within the computing fog. In addition, security is always maintained regarding the supplier’s reputation. For added security, SONM is working toward hardware-enforced security, as well. Finally, consumers benefit from high market liquidity in purchasing resources and the ability to scale out their application.\n\n<a href=\"https://www.coingecko.com/en/ico/sonm\">SONM’s ICO</a> was held on June 15, 2017 and successfully raised $42,000,000. Paolo Tasca, a digital economist and blockchain expert, joined the SONM Advisory Board. Tasca is the Executive Director of the Centre for Blockchain Technologies at University College London, as well as a blockchain consultant to the United Nations and EU Parliament, and the co-editor of “Banking Beyond Banks and Money: A Guide to Banking Services in the Twenty-First Century.”\"","developer_score":73.784,"id":"sonm","image":{"large":"https://assets.coingecko.com/coins/images/861/large/sonm.png?1548609871","small":"https://assets.coingecko.com/coins/images/861/small/sonm.png?1548609871","thumb":"https://assets.coingecko.com/coins/images/861/thumb/sonm.png?1548609871"},"links":{"bitcointalk_thread_identifier":1763166,"blockchain_site":["https://enjinx.io/eth/token/0x983f6d60db79ea8ca4eb9968c6aff8cfa04b3c63","https://etherscan.io/token/0x983f6d60db79ea8ca4eb9968c6aff8cfa04b3c63","https://ethplorer.io/address/0x983f6d60db79ea8ca4eb9968c6aff8cfa04b3c63"],"homepage":["https://sonm.io/"],"repos_url":{"github":["https://github.com/sonm-io/core"]},"subreddit_url":"https://www.reddit.com/r/SONM","telegram_channel_identifier":"sonm_eng","twitter_screen_name":"sonmdevelopment"},"liquidity_score":18.634,"market_cap_rank":439,"name":"SONM","public_interest_score":28.439,"symbol":"snm","tickers":[{"base":"SNM","market":{"identifier":"coss","name":"COSS"},"target":"ETH"},{"base":"SNM","market":{"identifier":"yobit","name":"YoBit"},"target":"BTC"},{"base":"SNM","market":{"identifier":"yobit","name":"YoBit"},"target":"DOGE"},{"base":"SNM","market":{"identifier":"yobit","name":"YoBit"},"target":"ETH"},{"base":"SNM","market":{"identifier":"yobit","name":"YoBit"},"target":"RUR"},{"base":"SNM","market":{"identifier":"yobit","name":"YoBit"},"target":"USD"},{"base":"SNM","market":{"identifier":"yobit","name":"YoBit"},"target":"WAVES"}]}