{"address":"0x9B70740e708a083C6fF38Df52297020f5DfAa5EE","coingecko_rank":1479,"coingecko_score":19.284,"community_score":31.204,"description":"Being an investor in cryptocurrencies is not easy, it takes a lot of time and causes a lot of stress. Every 5 minutes, there is a new article that is published on the crypto, and more than 150 tweets. Bitcoin is panicking the markets, and both the general public and investors are increasingly interested in it.\n\nIn such a sensitive market, you must constantly stay up to date and assimilate a maximum of information to be sure not to miss the next \"\"pump\"\" or \"\"dump\"\" of the market. If only you could, from a simple question have all the answers to your questions? Would that be the dream? Just a dream? Perhaps not... Imagine receiving the most reliable information you want by asking a simple question? Or get a glimpse of the emotional state of the market with your fingertips in seconds? Even better, you want to enjoy your family but you don't have a clear conscience when you look away from the market? What if I told you that you could be alerted when the market needs your attention?\n\nAfter \"\"Ok Google\"\" or \"\"Say Siri\"\", you'll never have so much fun saying \"\"Hi Daneel\"\". He will be your intelligent assistant in your daily investment and will allow you to be more serene in your decisions and enjoy your free time with your family.\nSo, Daneel, what is it?\n\nA turnkey offer that analyzes, interprets and adapts the message to the user (whether beginner, advanced or expert) by giving quantitative elements to allow the user to judge the interest of a trend - all thanks to the power of the most recognized artificial intelligence on the market - IBM Watson. Daneel makes the world of cryptos even more accessible to beginners through its learning program. He will teach you what you need to know and make you an informed investor.\n\nWhat quantitative elements are you asking me? Daneel will be able, thanks to algorithms developed by the company, to transcribe market emotions via what he finds on social networks, to give a confidence score on a currency and to explain why this choice.\n\nIn addition to informing and teaching, Daneel will allow you to connect to Crypto's currency trading platforms to place orders, monitor prices, and more broadly everything related to portfolio management. You will thus have all the cards in hand to react quickly to market movements and anticipate your orders.\nFor its operation, we provide a crypto currency, the DAN, which allows to pay the subscription to the service and to become familiar with the Crypto.","developer_score":0.0,"id":"daneel","image":{"large":"https://assets.coingecko.com/coins/images/2610/large/Daneel.png?1547036760","small":"https://assets.coingecko.com/coins/images/2610/small/Daneel.png?1547036760","thumb":"https://assets.coingecko.com/coins/images/2610/thumb/Daneel.png?1547036760"},"links":{"bitcointalk_thread_identifier":2667581,"blockchain_site":["https://enjinx.io/eth/token/0x9b70740e708a083c6ff38df52297020f5dfaa5ee","https://etherscan.io/token/0x9b70740e708a083c6ff38df52297020f5dfaa5ee","https://ethplorer.io/address/0x9b70740e708a083c6ff38df52297020f5dfaa5ee"],"facebook_username":"daneelproject","homepage":["https://daneel.io/"],"repos_url":{"github":["https://github.com/project-daneel"]},"subreddit_url":"https://www.reddit.com/r/Daneel_Project/","telegram_channel_identifier":"projectdaneel","twitter_screen_name":"daneelproject"},"liquidity_score":1.0,"market_cap_rank":1448,"name":"Daneel","public_interest_score":25.686,"symbol":"dan","tickers":[{"base":"DAN","market":{"identifier":"hitbtc","name":"HitBTC"},"target":"BTC"},{"base":"DAN","market":{"identifier":"idex","name":"Idex"},"target":"ETH"}]}