{"address":"0x9c23D67AEA7B95D80942e3836BCDF7E708A747C2","coingecko_rank":1750,"coingecko_score":15.799,"community_score":18.147,"description":"Loci was founded with one goal, to change the way we all invent and the value of an idea as a whole.  Loci specializes in simplifying the patent search process and utilizing unique visualizations to further understand the landscape of ideas. InnVenn, a visual searching tool for patents, was designed to simplify the process of identifying patents and more importantly, ideas that have not been patented yet.\n\nLOCIcoin tokens are an integral asset to unlocking the full features and potential of the LOCI Search platform. Here are the primary use cases.\n\nLOCI Search Features\nLive data, compound searching, saving result sets, claim creation, and so much more is available at your disposal. While searching is free, you ‘re able to use LOCIcoin to purchase features such as Invention Analysis, right inside the platform.\n\nBlockchain Posting\nStake proof of public disclosure of an idea with on the Ethereum blockchain when another platform user views it on the LOCI Search platform. The blockchain posting provides the immutable timestamp of when exactly the idea has been publicly disclosed. The immutable timestamp is crucial as the public disclosure grants the idea claim owner a 12 month grace period to file a patent.\n\nIP Bidding\nPlace bids to purchase IP that is on LOCI Search platform including existing patents with LOCIcoin. This works similar to the how eBay functions by bidders placing their maximum bid on IP. For bids placed on ideas native to the platform Loci Nexus will analyze the value of the IP and reach out to the idea owner with the valuation at or below the maximum bid. For existing patents Loci Nexus will then reach out to the owner or agent on behalf of the bidder and connect the two parties if there is mutual interest. To be clear, Loci will not negotiate or broker bids for existing patents as Loci is not a patent agent.","developer_score":0.0,"id":"locicoin","image":{"large":"https://assets.coingecko.com/coins/images/2904/large/locicoin.png?1547976471","small":"https://assets.coingecko.com/coins/images/2904/small/locicoin.png?1547976471","thumb":"https://assets.coingecko.com/coins/images/2904/thumb/locicoin.png?1547976471"},"links":{"blockchain_site":["https://enjinx.io/eth/token/0x9c23d67aea7b95d80942e3836bcdf7e708a747c2","https://etherscan.io/token/0x9c23d67aea7b95d80942e3836bcdf7e708a747c2","https://ethplorer.io/address/0x9c23d67aea7b95d80942e3836bcdf7e708a747c2"],"homepage":["http://www.loci.io/"],"subreddit_url":"https://www.reddit.com/r/loci_io/","twitter_screen_name":"Loci_io"},"liquidity_score":1.0,"market_cap_rank":1450,"name":"LOCIcoin","public_interest_score":27.301,"symbol":"loci","tickers":[{"base":"LOCI","market":{"identifier":"bancor","name":"Bancor Network"},"target":"BNT"},{"base":"LOCI","market":{"identifier":"latoken","name":"LATOKEN"},"target":"BTC"},{"base":"LOCI","market":{"identifier":"latoken","name":"LATOKEN"},"target":"ETH"}]}