{"address":"0x9eeC65E5b998dB6845321BaA915eC3338B1a469B","coingecko_rank":5306,"coingecko_score":3.677,"community_score":3.302,"description":"Only is the only Token on the public chain OnlyChain, which is the pass token for the ecological application and closed-loop ecological operation of the chain. Four uses of Only:\n\n(1) Reward settlement of super nodes and common nodes,\n\n(2) Proof of interest in the super node voting,\n\n(3) Proof of entitlement for the embedded implant application,\n\n(4) Payment settlement of application circulation in the chain.\n\nOnlyChain is an underlying operating system based on blockchain technology. The aim is to provide blockchain underlying technical support for blockchain technology application projects.\n\nAt present, the development of a complete chain of \"material chain\" anti-counterfeiting traceability system has begun to launch the application market, and has obtained a number of technical recognition and patent certification. At the same time, the national standard qualification has been submitted, and it is expected that the national standard certification will be obtained before June 2019.The public chain is expected to open the main online line and code from June to September 2019. Other application projects are gradually being built, and the main online line comes with an application.","developer_score":0.0,"id":"onlychain","image":{"large":"https://assets.coingecko.com/coins/images/7655/large/b4THd3fu_400x400.jpg?1549011501","small":"https://assets.coingecko.com/coins/images/7655/small/b4THd3fu_400x400.jpg?1549011501","thumb":"https://assets.coingecko.com/coins/images/7655/thumb/b4THd3fu_400x400.jpg?1549011501"},"links":{"announcement_url":["https://medium.com/@OnlyChain"],"blockchain_site":["https://etherscan.io/token/0x9eec65e5b998db6845321baa915ec3338b1a469b"],"chat_url":["https://onlychain.slack.com/"],"facebook_username":"OnlyChain","homepage":["http://www.onlychaineco.com/"],"telegram_channel_identifier":"OnlyChain","twitter_screen_name":"_OnlyChain"},"liquidity_score":1.0,"market_cap_rank":5088,"name":"OnlyChain","public_interest_score":26.514,"symbol":"only","tickers":[]}