{"address":"0x9e4Db6014A598fa1365E7c3f0F013477c961134a","coingecko_rank":5148,"coingecko_score":3.645,"community_score":0.0,"description":"AEP agricultural ecology protocol is committed to promoting the agricultural modernization process and new agricultural construction in China with block chain technology，after continually reshaping the agricultural industry transaction form, agricultural enterprise operation mode and agricultural import and export trade mode, by revenue maximization of domestic agricultural industry value and creating a global agricultural ecology，AEP will establishes the trust mechanism and new economic order of the new generation of agricultural sideline and related industries.AEP project team applies the traceability, anti-counterfeiting and de-intermediation attributes of the block chain to the agricultural industry, at the same time, the DAPP ecological scene is built to provide three-dimensional services for agricultural enterprises and to exchange resources, thus forming AEP agricultural ecological chain system. At present, the blue book of \"tea ecology\" has been built. AEP will also set up AEP agricultural trading platform based on the continuous landing of DAPP and the continuous improvement of the overall ecology, create a simple, quick and consensual economic order of AEP agricultural blockchain, and make AEP token become the hard currency circulating in the global agricultural ecology. The total issued amount of AEP token is kept at 3.3 billion, and the complete technical architecture and project system can ensure that the ecological value of AEP continues to increase. Therefore, the value increment trend of AEP token based on the actual currency circulation value of AEP project will not be limited.","developer_score":0.0,"id":"agricultural-ecology-protocol","image":{"large":"https://assets.coingecko.com/coins/images/7329/large/5b7136c354f82.png?1547043990","small":"https://assets.coingecko.com/coins/images/7329/small/5b7136c354f82.png?1547043990","thumb":"https://assets.coingecko.com/coins/images/7329/thumb/5b7136c354f82.png?1547043990"},"links":{"blockchain_site":["https://etherscan.io/token/0x9e4db6014a598fa1365e7c3f0f013477c961134a"],"homepage":["http://www.aepchain.com/"]},"liquidity_score":1.0,"market_cap_rank":3548,"name":"Agricultural Ecology Protocol","public_interest_score":34.452,"symbol":"aep","tickers":[]}