{"address":"0xa37aDDE3Ba20A396338364e2ddb5e0897D11a91D","coingecko_rank":4913,"coingecko_score":4.083,"community_score":5.612,"description":"WFee is the world’s first decentralized WiFi sharing ecosystem based on the blockchain technology. Launched by Singapore WFee Foundation (non-profit), the ecosystem targets at entire world. As a result of WiFi sharing activities, WFee’s smart contracts are based on the blockchain address security, trust, willingness to share, privacy and other issues. With WFee, users are able to enjoy a convenient, free and efficient environment for Internet access. WFee enables each and every user to freely publish, store and manage their own WiFi information while providing a WiFi sharing chain for individuals or organizations transformed from the Ethereum at the bottom. Any individual or organization can get involved in the building of the ecosystem to form a decentralized ecosystem.\n\nWiFi Sharing Eco-system\nWFee will turn from one-to-many sharing network of the original platform to peer-to-peer sharing network in order to solve current trust issues between people and platforms and lower sharing cost.\n\nHardware sharing ecosystem\nThis will involve hardware, such as routers and IOT devices into the ecosystem and make use of the computing power of the underlying hardware to provide a complete data service platform for a single-function routing device so that WFee’s circulation, generation and consumption go beyond software function, which builds a more solid ecosystem combining hardware and software to expand usage.\n\nData sharing ecology\nUsers can record and store data on free nodes and exchange data with any other nodes in the network. In the process of data exchange and transaction, WFee’s circulation and data validity verification are handled automatically through smart contract, without intervention from artificial and central nodes.","developer_score":0.0,"id":"wfee","image":{"large":"https://assets.coingecko.com/coins/images/4647/large/wfee-logo.jpg?1547039913","small":"https://assets.coingecko.com/coins/images/4647/small/wfee-logo.jpg?1547039913","thumb":"https://assets.coingecko.com/coins/images/4647/thumb/wfee-logo.jpg?1547039913"},"links":{"blockchain_site":["https://etherscan.io/token/0xa37adde3ba20a396338364e2ddb5e0897d11a91d"],"facebook_username":"coin.wfee.7","homepage":["http://www.wfee.info/#/"],"twitter_screen_name":"WFee_Official"},"liquidity_score":0.0,"market_cap_rank":2800,"name":"Wfee","public_interest_score":26.8,"symbol":"wfee","tickers":[]}