{"address":"0xA353d00fa6D940Cb625045d74FEF8406854dd0DA","coingecko_rank":1457,"coingecko_score":18.27,"community_score":9.357,"description":"The Dakuce project focuses on providing a powerful cryptocurrency trading platform, which not only involves cryptocurrency exchange but also other great services. We have deployed DApp and smart contracts based on blockchain technology where cryptocurrencies are exchanged for fiat currencies. Investing in our trading platform will reward you with heavy discounts on trading fees at our platform and high returns on Dakuce token. Dakuce is a decentralized exchange platform with security being paramount guaranteed to all the traders.\nOn Dakuce platform all the cryptocurrencies are on real market rates and hence involves no manipulation in it.\nApart from that, Dakuce ensures that it is profitable for its investors and users. We provide transparency to market data and its fees along with prediction analysis, moreover to provide concrete knowledge in fields of cryptocurrency investment resources. Updated news and education is made available at Dakuce in the field of cryptocurrency. This helps the investor to get clarity on how to manage and accumulate cryptocurrency funds.","developer_score":0.0,"id":"dakuce","image":{"large":"https://assets.coingecko.com/coins/images/6527/large/logo_%2818%29.png?1547042747","small":"https://assets.coingecko.com/coins/images/6527/small/logo_%2818%29.png?1547042747","thumb":"https://assets.coingecko.com/coins/images/6527/thumb/logo_%2818%29.png?1547042747"},"links":{"bitcointalk_thread_identifier":3423827,"blockchain_site":["https://enjinx.io/eth/token/0xa353d00fa6d940cb625045d74fef8406854dd0da","https://etherscan.io/token/0xa353d00fa6d940cb625045d74fef8406854dd0da","https://ethplorer.io/address/0xa353d00fa6d940cb625045d74fef8406854dd0da"],"facebook_username":"dakucecom","homepage":["https://dakuce.com/"],"telegram_channel_identifier":"dakucecom","twitter_screen_name":"dakucecom"},"liquidity_score":23.456,"market_cap_rank":1314,"name":"Dakuce","public_interest_score":24.496,"symbol":"daku","tickers":[]}