{"address":"0xA4eA687A2A7F29cF2dc66B39c68e4411C0D00C49","coingecko_rank":1520,"coingecko_score":17.414,"community_score":8.617,"description":"Ivy is a blockchain-based technology for FIAT & cryptocurrency business transactions which require extensive verification in the international monetary system. The Ivy network utilizes Ivy (IVY) tokens which carry KYC & KYT data points critical for Financial Institution validation.\n\nAdvantages of Ivy Network over traditional payment networks:\n1. Securely facilitate the transfer of cryptocurrency payments while associating KYC and KYT data via the trusted, distributed ivyKoin network\n2. Securely store an immutable reference to supporting transaction data in a public blockchain\n3. Embed more KYT & KYC information into the transfer than traditional payment methods\n4. Able to be integrated into existing banking software\n5. Offer easy integration into accounting software for bookkeeping efficiency\n6. Provide revocable access to KYC/KYT data to financial institutions, accountants, company managers and others, depending on the information they require\n\nOVERVIEW OF ARCHITECTURE\nIt is intended that the Ivy Network will function through the use of a dual network architecture, where senders of Tokens operate on a public network (Ivy Public Network), and parties that provide the financial settlement to fiat currency participate on a private network (Ivy Private Network).\n\nKYC/KYT/AML data supporting transactions will be captured in cryptographic containers that are generated from the Ivy Public Network interaction with the Ivy Network smart contracts and support the activities of the Ivy Private Network participants in facilitating transaction settlement.\n\nThis data will be stored and accessible by the financial institution and governing regulators of the fiat balance recipients.","developer_score":12.0,"id":"ivy","image":{"large":"https://assets.coingecko.com/coins/images/4198/large/ivy-symbol-green_preview.png?1547039492","small":"https://assets.coingecko.com/coins/images/4198/small/ivy-symbol-green_preview.png?1547039492","thumb":"https://assets.coingecko.com/coins/images/4198/thumb/ivy-symbol-green_preview.png?1547039492"},"links":{"announcement_url":["https://medium.com/@ivykoin"],"blockchain_site":["https://enjinx.io/eth/token/0xa4ea687a2a7f29cf2dc66b39c68e4411c0d00c49","https://etherscan.io/token/0xa4ea687a2a7f29cf2dc66b39c68e4411c0d00c49","https://ethplorer.io/address/0xa4ea687a2a7f29cf2dc66b39c68e4411c0d00c49"],"facebook_username":"ivykoin","homepage":["http://www.ivykoin.com"],"repos_url":{"github":["https://github.com/ivy-project/token"]},"telegram_channel_identifier":"ivyKoinchat","twitter_screen_name":"ivykoin"},"liquidity_score":1.0,"market_cap_rank":999,"name":"Ivy","public_interest_score":23.488,"symbol":"ivy","tickers":[{"base":"IVY","market":{"identifier":"coinbene","name":"CoinBene"},"target":"ETH"},{"base":"IVY","market":{"identifier":"forkdelta","name":"ForkDelta"},"target":"ETH"},{"base":"IVY","market":{"identifier":"idex","name":"Idex"},"target":"ETH"}]}