{"address":"0xa721D5893480260bD28CA1f395F2C465D0B5b1c2","coingecko_rank":560,"coingecko_score":27.792,"community_score":23.302,"description":"Narrative is a Content Economy, generating rewards for content creators, moderators, and others who positively contribute to the quality of content on the network. In the Content Economy, users govern the system, with each user’s contributions and actions, influenced by overall reputation, impacting the economic reward.\n\nNarrative (NRV) is also a social network that allows users and brands to tell their stories. It’s like a mashup between Medium, Instagram and Twitter, but with the more focused subject-matter. Each post has a title and can contain text and/or photos. As a Content Economy, Narrative generates rewards for content creators, moderators, and others who positively contribute to the quality of content on the network. It is autonomous, transparent, and completely user-centric. Reputation scores and content ratings ensure that “bad eggs” have minimal impact and that quality users and content rise to the top (and are rewarded the most). The economic motive for Narrative is to reward all users who add value to the network.\n\nThere are three types of content channels on Narrative: Personal Journals, Niches (subject-based collections), and Brands. Users can follow specific Narrative channels and view a stream of all content they track. All content is public, curated and managed by elected moderators. 85% of all revenues generated by the network flow directly to the active participants (e.g., content creators, active participants, moderators, and other positive influencers).\n\nThe narrative is not the first to propose a decentralized social network but it does have one of the best proposals and a solid team to boot, with prior exposure in the field. What I don't like about the project is that it promotes the use of fiat currency, citing that cryptocurrency is not fully integrated into the economy. If you're going to sell a blockchain project and cry off and fail to encourage the use of cryptocurrency. Die-hard crypto crusaders may deem that a good enough reason to give it a miss.","developer_score":43.422,"id":"narrative","image":{"large":"https://assets.coingecko.com/coins/images/2084/large/narrative.png?1548085862","small":"https://assets.coingecko.com/coins/images/2084/small/narrative.png?1548085862","thumb":"https://assets.coingecko.com/coins/images/2084/thumb/narrative.png?1548085862"},"links":{"blockchain_site":["https://neotracker.io/asset/a721d5893480260bd28ca1f395f2c465d0b5b1c2"],"facebook_username":"NarrativeHQ","homepage":["https://narrative.org/"],"repos_url":{"github":["https://github.com/NarrativeCompany/tokensale-neo-smartcontract"]},"subreddit_url":"https://www.reddit.com/r/NarrativeNetwork/","telegram_channel_identifier":"narrativenetwork","twitter_screen_name":"narrative_hq"},"liquidity_score":0.0,"market_cap_rank":1659,"name":"Narrative","public_interest_score":39.545,"symbol":"nrve","tickers":[{"base":"NRVE","market":{"identifier":"switcheo","name":"Switcheo"},"target":"NEO"}]}