{"address":"0xa87CC2a513f5d8B4A42432343687c2127c60Bc3F","coingecko_rank":923,"coingecko_score":22.634,"community_score":23.246,"description":"The NEO Smart Economy has a major limitation in that although smart contracts can receive funds (system assets like NEO or GAS) they cannot send funds without intervention of off-chain code that responds to events emitted by the smart contract and creates and broadcasts new transactions.\n\nThe introduction of NEP-7 in Neo 2.7.5 has eased some of the difficulties with receiving system assets by a smart contract. Now a contract will be able to be triggered upon receiving NEO/GAS, giving the contract the opportunity to perform actions or reject the transfer. The problem of the inability to send NEO/GAS in a single operation still remains, however.\n\nCurrent NEP-5 tokens have more limitations than system assets:\n\nThe smart contract will receive no notification that the tokens were sent\nThe smart contract will not be able to spend tokens it holds without coordination from an off-chain wallet holding the owner's key\nA change is needed to foster automated exchange of value between smart contracts and users. As a result of this need, we have created the Master Contract Token (MCT).\n\nMCT is a NEP-5-compatible token implementation with some additional features. The most notable being the ability for third-party smart contracts to send, receive, and hold it.","developer_score":45.308,"id":"master-contract-token","image":{"large":"https://assets.coingecko.com/coins/images/4863/large/Master_Contract_Token.jpg?1547040270","small":"https://assets.coingecko.com/coins/images/4863/small/Master_Contract_Token.jpg?1547040270","thumb":"https://assets.coingecko.com/coins/images/4863/thumb/Master_Contract_Token.jpg?1547040270"},"links":{"blockchain_site":["https://neotracker.io/asset/a87cc2a513f5d8b4a42432343687c2127c60bc3f"],"chat_url":["https://discord.gg/vrA8tcq"],"homepage":["https://splyse.tech/#projects"],"repos_url":{"github":["https://github.com/Splyse/MCT"]},"subreddit_url":"https://www.reddit.com/r/MasterContractToken/","twitter_screen_name":"MCT_Token"},"liquidity_score":8.755,"market_cap_rank":5724,"name":"Master Contract Token","public_interest_score":37.441,"symbol":"mct","tickers":[]}