{"address":"0xAAD54C9f27B876D2538455DdA69207279fF673a5","coingecko_rank":1964,"coingecko_score":10.621,"community_score":9.041,"description":"Our world is composed of a myriad of communities from the individual to a family community to larger communities of the workplace and society. From now on, these communities will be connected through decentralized blockchains and these blockchains will be closely linked to another community’s blockchains, ultimately forming an ecosystem.\n\nThe Davinci Project enables everyone to use a highly efficient, fast, secure and simplified payment system among nations while also minimizing the complexity of financial and accounting verifications. Also, a strengthening global trade and investment system has collapsed the boundaries of national currencies.\n\nMoreover, the credit information of foreign companies will be transparently managed. In addition, the distributed networks will have tightened security and reduced costs. Surplus resources will be shared. The transaction histories of real estate will be digitized and will also be managed transparently.\n\nThe Davinci Project will be the foundation for industries such as voting, prediction systems, firearm security, human resources, insurance companies, Internet of Things (IoT), energy, education, donations, and so on. The Davinci Project was created to construct an ecosystem that encompasses cultural, artistic and other various fields, while linking domestic and international exchanges in the network from the private sector.","developer_score":0.0,"id":"davinci-coin","image":{"large":"https://assets.coingecko.com/coins/images/5494/large/davinci-coin.png?1547041236","small":"https://assets.coingecko.com/coins/images/5494/small/davinci-coin.png?1547041236","thumb":"https://assets.coingecko.com/coins/images/5494/thumb/davinci-coin.png?1547041236"},"links":{"blockchain_site":["https://etherscan.io/token/0xaad54c9f27b876d2538455dda69207279ff673a5","https://ethplorer.io/address/0xaad54c9f27b876d2538455dda69207279ff673a5"],"facebook_username":"Davinci-coin-1688348254582102","homepage":["https://www.davinci.vision/"],"subreddit_url":"https://www.reddit.com/r/DavinciCoin/","telegram_channel_identifier":"davincifoundation","twitter_screen_name":"DavinciFoundat1"},"liquidity_score":43.162,"market_cap_rank":null,"name":"Davinci Coin","public_interest_score":0.0,"symbol":"dac","tickers":[]}