{"address":"0xaA7a9CA87d3694B5755f213B5D04094b8d0F0A6F","coingecko_rank":170,"coingecko_score":41.753,"community_score":42.236,"description":"OriginTrail provides a helpful protocol solution to the problem of maintaining trust among all players involved in bringing a product to market by making the “chain” in “supply chain” more literal. Using blockchain technology, OriginTrail can append immutable data to products as they take each step along the supply route. Thus, each participant not only verifies that their conditions are being met but that at every previous stage, the right conditions were also met by everyone else. This is achieved by making an application layer that allows data to be collected in the real world, and then stored on the blockchain. OriginTrail started out by testing their tracking with organic beef products in 2014, and they are still mostly involved in the tracking of food products in general. It wasn’t until 2016 that they introduced a blockchain into their system.\n\nIn January 2018, they raised US$22.5 million in their ICO. Since their ICO they’ve successfully launched their testnet, implemented privacy features, and achieved compliance with the GS1 standards that are integral to their business model. Their roadmap is robust and full of details, citing certifications with international bodies, alliances with companies, and entering new markets. Their mainnet is scheduled for launch in Q3 2018, and thereafter they appear to be on track to having all their services fully operational by 2020.\n\nOriginTrail is not the first or only company to recognize that supply chains could benefit a great deal from blockchain technology. <a href=\"https://www.coingecko.com/en/coins/ambrosus\">Ambrosus</a> is also going for the same market, though they seem to be focused on food and pharmaceuticals specifically. It should be noted that most supply chains have their own specific quirks, and so specialization might be be a good option. Another potential competitor of OriginTrail is <a href=\"https://www.coingecko.com/en/coins/waltonchain\">Waltonchain</a>, a company based in China that puts heavy emphasis on RFID chip scanning as part of their business model. In other words, where OriginTrail wants to leverage existing systems for their infrastructure, Waltonchain wants to try and establish new standards and methods. OriginTrail’s token is called TRAC, and it’s an ERC-20 token, making it storable on any ERC-20 compatible wallet. The total supply is capped at 500 million tokens. The value in TRACE tokens comes from their utility on the OriginTrail network. Tokens are spent to store, retrieve, and send data about supply chains. Since TRACE can be bought and sold in a speculative market, that creates the potential for the price to go up, which would be counter to the needs of people on the network looking for stable prices for setting and getting data. However, prices for data saving and retrieval will be determined by auction, which should counter increasing token value for those using OriginTrail as a service.\n\nThe Internet of Things is a topic that gets a lot of press, and the general consensus is that it will be standard practice in the future for almost everything in the world to be tracked and traced for a wide variety of purposes. OriginTrail is one company that is demonstrating a concrete plan for exactly how that will be manifest. There really isn’t much to criticize in terms of the overall intention of the project. OriginTrail has identified a weak point in the very important world of supply chain management, that of reliable transfer of information all the way up and down the chain, and aims to provide a workable and clearly understood solution.","developer_score":65.292,"id":"origintrail","image":{"large":"https://assets.coingecko.com/coins/images/1877/large/origintrail.png?1548330419","small":"https://assets.coingecko.com/coins/images/1877/small/origintrail.png?1548330419","thumb":"https://assets.coingecko.com/coins/images/1877/thumb/origintrail.png?1548330419"},"links":{"bitcointalk_thread_identifier":2436140,"blockchain_site":["https://enjinx.io/eth/token/0xaa7a9ca87d3694b5755f213b5d04094b8d0f0a6f","https://etherscan.io/token/0xaa7a9ca87d3694b5755f213b5d04094b8d0f0a6f","https://ethplorer.io/address/0xaa7a9ca87d3694b5755f213b5d04094b8d0f0a6f"],"facebook_username":"origintrail","homepage":["https://origintrail.io/"],"repos_url":{"github":["https://github.com/OriginTrail/ot-node"]},"subreddit_url":"https://www.reddit.com/r/origintrail","telegram_channel_identifier":"origintrail","twitter_screen_name":"origin_trail"},"liquidity_score":2.023,"market_cap_rank":394,"name":"OriginTrail","public_interest_score":25.084,"symbol":"trac","tickers":[{"base":"TRAC","market":{"identifier":"bittrex","name":"Bittrex"},"target":"BTC"},{"base":"TRAC","market":{"identifier":"hitbtc","name":"HitBTC"},"target":"ETH"},{"base":"TRAC","market":{"identifier":"idex","name":"Idex"},"target":"ETH"}]}