{"address":"0xaFBeC4D65BC7b116d85107FD05d912491029Bf46","coingecko_rank":1701,"coingecko_score":16.18,"community_score":0.0,"description":"ARBITRAGE TRADING\nThe philosophy behind the Arbitrage software is to automatically profit from temporary price differences between exchanges while being market-neutral. Unlike other legacy systems, Arbitrage’s aBot doesn't sell but actually short sells designated cryptocurrencies on the short exchange, this feature offers two important advantages.\n\nFirst, the strategy is always market-neutral, meaning as the cryptocurrency market's moves (up or down) it doesn't impact the strategy of returns. In simple terms, this removes a huge amount of risk from the platform’s overall return strategy as the market could suddenly lose half its value and this won't make any difference in the strategy returns.\n\nSecond, the aBOT's strategy doesn't need to transfer cryptofunds (e.g. BTC, LTC or Fiat) between cryptocurrency exchanges.\nThe buy/sell and sell/buy opposing trade activities are done in parallel on two different exchanges, independently.\n\nRevolutionary Decentralised Platform\nArbitraging ecosystem is collection of unique products and capabilities that is structured to realise the decentralised nature of the exchange and access to the Arbitrage BoT financial trading technology. The platform architecture either leverages the full scope of the Arbitrage Trading BoT (as detailed earlier) or provides unique storage and management functionality for the investor.\n\nThe proprietary decentralized blockchain provides a seamless approach to arbitrage fintech services by combining a number of noteworthy innovations from token storage and management, and a number of integrated functional services. Whatever the investor experience level, the interface has been designed to be accessible (i.e. mobile and desktop environments) with simplicity and functionality in mind. It focuses on features that will enable easy transactions and subsequent tracking, and the ability to use ARB Tokens to access internal products and future projects.\n\nARB asset management and storage options can be simply divided into two levels: external wallets for long-term storage and dedicated digital wallet apps. The decentralised nature of the exchange enables ARB stored on any external ERC20 compatible wallets (e.g. MyEtherWallet or MetaMask). This ensures that tokens are always held separate and furthermore when the Arbitrage trading BoT is active, those tokens are sent to an external cold storage wallet and the daily profits are sent back to the designated external wallet. Alternatively, the dedicated ARB-wallet application (currently under development) will be able to exchange directly with the ARB Trading platform thereby significantly reducing funds transfer and transaction latency. This integrated concept will also eventually feature for the ardent crypto investor, compatibility with hard-storage devices such as the Trezor and Nano-Ledger.\n\nIn summary the Arbitraging ecosystem presents an innovative approach to a complex crypto-trading strategy that is characterised by a proprietary ERC20 based decentralized blockchain, token management system and fully integrated external wallet and hard storage technologies.","developer_score":0.0,"id":"arbitraging","image":{"large":"https://assets.coingecko.com/coins/images/3233/large/arb.png?1547037737","small":"https://assets.coingecko.com/coins/images/3233/small/arb.png?1547037737","thumb":"https://assets.coingecko.com/coins/images/3233/thumb/arb.png?1547037737"},"links":{"blockchain_site":["https://enjinx.io/eth/token/0xafbec4d65bc7b116d85107fd05d912491029bf46","https://etherscan.io/token/0xafbec4d65bc7b116d85107fd05d912491029bf46","https://ethplorer.io/address/0xafbec4d65bc7b116d85107fd05d912491029bf46"],"homepage":["https://arbitraging.co/"],"telegram_channel_identifier":"arbofficial","twitter_screen_name":"arbitragingco"},"liquidity_score":20.513,"market_cap_rank":1299,"name":"ARBITRAGE","public_interest_score":32.273,"symbol":"arb","tickers":[{"base":"ARB","market":{"identifier":"coin_exchange","name":"CoinExchange.io"},"target":"BTC"},{"base":"ARB","market":{"identifier":"coin_exchange","name":"CoinExchange.io"},"target":"ETH"},{"base":"ARB","market":{"identifier":"latoken","name":"LATOKEN"},"target":"ETH"}]}