{"address":"0xAf8A215e81FAea7C180CE22b72483525121813BD","coingecko_rank":3750,"coingecko_score":6.03,"community_score":6.379,"description":"The goal of Engine is to create a set of auto data ecology on the blockchain, through pre-project scale data collection and precipitation, and put the data into products with blockchain as the underlying technology to activate the characteristics of the blockchain and transmit the value of information, thus reaching the user’s pain points and solving existing problems. At the same time, individual users and corporate users are mobilized through the owner’s service and the entire chain of products, urging people and organizations from all walks of life to participate in the joint development of value and rewards.\n\nAs the first global vehicle full life cycle data sharing platform based on the blockchain, Engine actively carrys forward the integration of informatization and industrialization, and promotes the sustainable development of the autoindustry through the realization of the open and transparent, traceable and queryable automobile life cycle data, to establish a \"vehicle full life cycle database based on VIN code\" as the main line database, provides standardized data services for industry and enterprises, and to create a global car industry data standard.","developer_score":0.0,"id":"engine","image":{"large":"https://assets.coingecko.com/coins/images/4531/large/2852.png?1547039827","small":"https://assets.coingecko.com/coins/images/4531/small/2852.png?1547039827","thumb":"https://assets.coingecko.com/coins/images/4531/thumb/2852.png?1547039827"},"links":{"blockchain_site":["https://etherscan.io/token/0xaf8a215e81faea7c180ce22b72483525121813bd","https://ethplorer.io/address/0xaf8a215e81faea7c180ce22b72483525121813bd"],"homepage":["https://www.egcchain.com/"],"twitter_screen_name":"enginechainegcc"},"liquidity_score":13.388,"market_cap_rank":1948,"name":"Engine","public_interest_score":17.58,"symbol":"egcc","tickers":[{"base":"EGCC","market":{"identifier":"bit_z","name":"Bit-Z"},"target":"BTC"},{"base":"EGCC","market":{"identifier":"bit_z","name":"Bit-Z"},"target":"ETH"},{"base":"EGCC","market":{"identifier":"coinnest","name":"CoinNest"},"target":"KRW"},{"base":"EGCC","market":{"identifier":"probit","name":"Probit"},"target":"KRW"}]}