{"address":"0xB1cfB2421F6F12EBdA4F9b8d0336518c82e63b2c","coingecko_rank":5958,"coingecko_score":2.563,"community_score":0.0,"description":"The Vocal Chain is a block-chain-based voice data and manual identification information storage tool. Users provide voice data of different dialects and different meanings for mining, solves the data bottlenecks faced by AI voice development, It is also the application of blockchain technology in the field of big data applications. The Vocal Chain is dedicated to building a global linguistic resource platform, and provides the world's largest, richest, most accurate training data source for the development of AI voice recognition through the power of community members to achieve the world's largest decentralized human voice Data eco vision. The data is truly “taken from the people and used by the people”, and the real value of big data “originates from the people and is returned to the people”. Since 2017, as the hottest blockchain technology, with the continuous promotion of “blockchain+industry”, blockchain is playing a “catalyst” for the development of big data and artificial intelligence technologies. With the rapid development of AI voice business application scenarios and the rapid growth in demand, the Vocal Chain will gradually show its huge potential for commercial value.\n\nToken use: Used for data contribution rewards and purchase vouchers, and as a value measure and circulation means for VOC ecological activities. It is the only evidence of all value exchanges.","developer_score":0.0,"id":"vocal-chain","image":{"large":"https://assets.coingecko.com/coins/images/7773/large/1_qv-dvvWRPdqnE7lG31AtdQ.jpeg?1550481234","small":"https://assets.coingecko.com/coins/images/7773/small/1_qv-dvvWRPdqnE7lG31AtdQ.jpeg?1550481234","thumb":"https://assets.coingecko.com/coins/images/7773/thumb/1_qv-dvvWRPdqnE7lG31AtdQ.jpeg?1550481234"},"links":{"blockchain_site":["https://etherscan.io/token/0xb1cfb2421f6f12ebda4f9b8d0336518c82e63b2c"],"homepage":["http://www.vochain.world"]},"liquidity_score":0.0,"market_cap_rank":3126,"name":"Vocal Chain","public_interest_score":25.626,"symbol":"voc","tickers":[]}