{"address":"0xb2F7EB1f2c37645bE61d73953035360e768D81E6","coingecko_rank":337,"coingecko_score":33.392,"community_score":35.055,"description":"COBINHOOD is providing crypto-financial products such as a zero-fee cryptocurrency exchange, <a href=\"https://www.coingecko.com/en/exchanges/cobinhood\">COBINHOOD Exchange</a>, and ICO underwriting services. COBINHOOD Exchange provides spot trading and margin trading with zero trading fees to maximize traders’ profit and market liquidity. COBINHOOD Exchange has a utility ERC20 token, called COB, which aims to maximize traders' profits with benefits tied to the exchange.\n\nCOBINHOOD Exchange was officially launched on December 18, 2017, with the early platform and company developments started August of the same year. The project is incepted by the former CEO of 17 live streaming, Chen Tai Yuan, a 26-year-old serial entrepreneur, and former engineer at Google, Wei-Ning Huang. On September 13, 2017, COBINHOOD's ICO officially launched with the introduction of the COB token. The funds raised from the COB token ICO sale is used by the company to develop COBINHOOD Exchange. Few days later, actor Jamie Foxx tweeted his support for the ICO. On October 22, 2017, the COBINHOOD Exchange ICO ended  and received a total of 45,254.9 ETH (equivalent to US$13,216,883 during the date of ICO end) with 244,773,856 COB tokens distributed to 17,433 ICO participants.\n\nEvery kind of crypto assets deposited at COBINHOOD will be stored in an offline multi-signature (multisig) wallet. It is estimated that 98% of assets will be stored offline, while 2% of assets will remain in an online wallet allowing for faster user deposit and withdrawa. Each offline multisig wallet consists of 8 HSMs (Hardware Security Modules), which will require passcodes from 5 out of the 8 HSMs to be accessed. If one of the HSM administrators is compromised, the multisig wallet will remain secure. Furthermore, the administrators of the HSMs are located in different countries (geo distributed) adding to COBINHOOD’s security system. Furthermore, all crypto asset deposits in COBINHOOD’s online wallet will be backed by insurance. Self or bot trading will also be regulated in the COBINHOOD Exchange as the trading engine is equipped with multiple automated configurations to prevent self-trading of orders entered by the same person with multiple accounts. Furthermore, machine learning and data analysis will also be set up to bolster security mechanisms for self-trading restrictions.","developer_score":45.244,"id":"cobinhood","image":{"large":"https://assets.coingecko.com/coins/images/971/large/cobinhood.png?1547739572","small":"https://assets.coingecko.com/coins/images/971/small/cobinhood.png?1547739572","thumb":"https://assets.coingecko.com/coins/images/971/thumb/cobinhood.png?1547739572"},"links":{"bitcointalk_thread_identifier":2169745,"blockchain_site":["https://enjinx.io/eth/token/0xb2f7eb1f2c37645be61d73953035360e768d81e6","https://etherscan.io/token/0xb2f7eb1f2c37645be61d73953035360e768d81e6","https://ethplorer.io/address/0xb2f7eb1f2c37645be61d73953035360e768d81e6"],"homepage":["https://www.cobinhood.com/"],"repos_url":{"github":["https://github.com/cobinhood/cobinhood-api-public"]},"subreddit_url":"https://www.reddit.com/r/cobinhood","telegram_channel_identifier":"cobinhood","twitter_screen_name":"cobinhood"},"liquidity_score":1.0,"market_cap_rank":940,"name":"Cobinhood","public_interest_score":29.304,"symbol":"cob","tickers":[{"base":"COB","market":{"identifier":"cobinhood","name":"Cobinhood"},"target":"BTC"},{"base":"COB","market":{"identifier":"cobinhood","name":"Cobinhood"},"target":"ETH"}]}