{"address":"0xB63B606Ac810a52cCa15e44bB630fd42D8d1d83d","coingecko_rank":446,"coingecko_score":30.47,"community_score":11.009,"description":"Crypto.com, the pioneering payments and cryptocurrency platform, seeks to accelerate the world’s transition to cryptocurrency. The MCO Token Sale was conducted in May-June 2017 and raised US$26.7 million.\n\nMCO Card is a Visa-branded debit card that draws from a cryptocurrency-funded bank account. Since it’s a Visa card, you can use your MCO Visa card just like you would any other card. The card and bank account are free for holders of cryptocurrency. In order to open an account, you simply sign up, verify your identity, and transfer any of the various accepted cryptocurrencies to your account. At this time, the Visa card is available to customers in Asia. They also have a waitlist for European customers. Customers in the United States does not have access to it at the moment. However, there are plans to change that. Solving the problem of everyday payments has the potential to be huge for cryptocurrency. However, MCO Visa card is not the only project attempting to create crypto-backed debit (or prepaid) cards. Other projects, such as <a href=\"https://www.coingecko.com/en/coins/tenx\">TenX</a>, are working on the same issue. All of these projects run into challenges implementing such cards in a large scale, compliant manner. Crypto.com hopes to crack the code, ultimately getting cryptocurrencies and popular payment methods to play nicely together.\n\nCrypto.com was founded in June 2016 in Switzerland and rebranded from Monaco on 6th July 2018. Their first prototype was developed in October of that year. In February of 2017, they were accepted into a Hong Kong Government backed Cyberport incubation program, where they developed their platform until they were ready to launch their token sale in 2017. The sale closed in June with $26.7 million in funding. Their app became available to pre-registered users in August 2017, followed by the official partnership with Visa in October. The team consists of seasoned veterans in the fin-tech space, most of whom have experience in Asia, where Monaco Cards have first been made available.\n\nSince MCO Visa cards are backed by cryptocurrency, they don’t have border issues like fiat currencies. As a result, you can use your card anywhere you go. The card will automatically default to the local fiat currency when you make a purchase. The low fees and exchange rates also apply in other countries. Transactions take place at the exact exchange rate that Crypto.com receives as an institutional trader. In contrast, when you use your debit card across borders with most banks, they’ll add an additional percentage to the exchange rate or include a transaction fee. Crypto.com has connections with eight of the top ten international foreign exchange banks to facilitate currency conversion.\n\nThe MCO Visa card is a compelling option for anyone looking to make everyday purchases with cryptocurrency. It also makes sense for cross-border travelers. However, we can expect the rollout to take a long time and hit a lot of bumps along the way. The financial industry is highly regulated and cryptocurrency-backed payments is a complex issue, even if Crypto.com's solution seems to make it simple and user-friendly.","developer_score":0.0,"id":"monaco","image":{"large":"https://assets.coingecko.com/coins/images/739/large/mco.png?1548387054","small":"https://assets.coingecko.com/coins/images/739/small/mco.png?1548387054","thumb":"https://assets.coingecko.com/coins/images/739/thumb/mco.png?1548387054"},"links":{"announcement_url":["https://hk.linkedin.com/company/cryptocom","https://medium.com/@crypto.com"],"bitcointalk_thread_identifier":1926269,"blockchain_site":["https://enjinx.io/eth/token/0xb63b606ac810a52cca15e44bb630fd42d8d1d83d","https://etherscan.io/token/0xb63b606ac810a52cca15e44bb630fd42d8d1d83d","https://ethplorer.io/address/0xb63b606ac810a52cca15e44bb630fd42d8d1d83d"],"chat_url":["https://discordapp.com/invite/B6cZahJ"],"facebook_username":"CryptoComOfficial","homepage":["https://www.crypto.com"],"subreddit_url":"https://www.reddit.com/r/Crypto_com/","telegram_channel_identifier":"CryptoComOfficial","twitter_screen_name":"cryptocom"},"liquidity_score":52.762,"market_cap_rank":61,"name":"MCO","public_interest_score":31.013,"symbol":"mco","tickers":[{"base":"MCO","market":{"identifier":"crex24","name":"CREX24"},"target":"BTC"},{"base":"MCO","market":{"identifier":"exrates","name":"Exrates"},"target":"USD"},{"base":"MCO","market":{"identifier":"gate","name":"Gate.io"},"target":"USDT"},{"base":"MCO","market":{"identifier":"gopax","name":"GoPax"},"target":"KRW"},{"base":"MCO","market":{"identifier":"hitbtc","name":"HitBTC"},"target":"USD"},{"base":"MCO","market":{"identifier":"huobi_korea","name":"Huobi Korea"},"target":"ETH"},{"base":"MCO","market":{"identifier":"livecoin","name":"Livecoin"},"target":"ETH"},{"base":"MCO","market":{"identifier":"livecoin","name":"Livecoin"},"target":"USD"},{"base":"MCO","market":{"identifier":"okex_korea","name":"OKEx Korea"},"target":"BTC"},{"base":"MCO","market":{"identifier":"okex_korea","name":"OKEx Korea"},"target":"ETH"},{"base":"MCO","market":{"identifier":"okex_korea","name":"OKEx Korea"},"target":"USDT"},{"base":"MCO","market":{"identifier":"upbit","name":"Upbit"},"target":"BTC"},{"base":"MCO","market":{"identifier":"upbit_indonesia","name":"Upbit Indonesia "},"target":"BTC"},{"base":"MCO","market":{"identifier":"vcc","name":"VCC Exchange"},"target":"BTC"},{"base":"MCO","market":{"identifier":"zb","name":"ZB"},"target":"QC"},{"base":"MCO","market":{"identifier":"zb","name":"ZB"},"target":"USDT"}]}