{"address":"0xb7cB1C96dB6B22b0D3d9536E0108d062BD488F74","coingecko_rank":269,"coingecko_score":37.257,"community_score":47.586,"description":"Waltonchain is a genuine, trustworthy and traceable business ecosystem with complete data sharing and absolute information transparency. It is created by the combination of technologies of RFID and blockchain, which push forwards the integration of block chain and the Internet of Things.\n\nWaltonchain combines blockchain with IoT (specifically RFID) to create a management system for supply chains. The project is named after Charlie Walton, the inventor of RFID technology and a pioneer in the space. Logistics systems are complex and commonly involve several different parties. As these systems grow, it becomes increasingly tough for businesses in the same vertical to coordinate with each other. On top of that, individual entities may have different processes that further hinder the ability to transfer data back and forth. Waltonchain uses RFID identification to track products during each step of production and distribution.\n\nThe data associated with each item is stored on an immutable blockchain that ensures its accuracy no matter where in the process it is.The Waltonchain team is loaded with supply chain experience. Do Sanghyuk, one of the co-founders, was previously the Director of the Korean Standard Products Association. The other co-founder, Xu Fangcheng was the Supply Chain Management Director of Septwolves Group Ltd. The team is getting support from their Chief Scientist Advisor, Kim Sukku – a former vice president of Samsung. Waltonchain has no shortage of partnerships – several of which are with Chinese provincial governments. The team is working with the Fujian government to create a “smart maritime” blockchain incubator, and with the Jinhu government to build smart air purification and monitoring systems.\n\nThe Waltonchain architecture makes use of a novel consensus mechanism known as Proof-of-Stake & Trust (PoST). Waltonchain innovates on the traditional proof-of-stake (PoS) model and integrates a node reputation based system into the consensus mechanism. PoST provides for adjustable difficulty for each node, to ensure that integrity in the ecosystem is rewarded. Waltonchain also gives sub-chain developers the option to choose their own consensus mechanism, for example, sub-chains can strictly just have PoS as a consensus mechanism, and not PoST. Waltonchain, by use of its RFID technology, has introduced a novel way with which blockchain can solve not only the inefficiencies found with supply chain management, but also IoT.","developer_score":0.0,"id":"waltonchain","image":{"large":"https://assets.coingecko.com/coins/images/1093/large/waltonchain.png?1548760303","small":"https://assets.coingecko.com/coins/images/1093/small/waltonchain.png?1548760303","thumb":"https://assets.coingecko.com/coins/images/1093/thumb/waltonchain.png?1548760303"},"links":{"bitcointalk_thread_identifier":2127069,"blockchain_site":["https://enjinx.io/eth/token/0xb7cb1c96db6b22b0d3d9536e0108d062bd488f74","https://etherscan.io/token/0xb7cb1c96db6b22b0d3d9536e0108d062bd488f74","https://ethplorer.io/address/0xb7cb1c96db6b22b0d3d9536e0108d062bd488f74"],"homepage":["http://www.waltonchain.org/"],"subreddit_url":"https://www.reddit.com/r/waltonchain","twitter_screen_name":"Waltonchain"},"liquidity_score":43.032,"market_cap_rank":92,"name":"Waltonchain","public_interest_score":30.824,"symbol":"wtc","tickers":[{"base":"WTC","market":{"identifier":"dragonex","name":"DragonEx"},"target":"USDT"},{"base":"WTC","market":{"identifier":"idex","name":"Idex"},"target":"ETH"},{"base":"WTC","market":{"identifier":"probit","name":"Probit"},"target":"KRW"}]}