{"address":"0xB70835D7822eBB9426B56543E391846C107bd32C","coingecko_rank":2016,"coingecko_score":14.003,"community_score":0.0,"description":"GameCoin (GMC) is a digital currency targeted towards the gaming community. GMC tokens go on sale at the end of September through the GameCoin ICO.\n\nGameCoin aims to increase the revenue of the gaming industry by 3 times – or 300 billion dollars per year. It aims to allow players to earn money from their hobby. And, within a year, the developers claim the capitalization of GameCoin will “exceed and billion dollars and will continue to grow rapidly.”\nGameCoin is being proposed as a way to monetize the world of free gaming. The GameCoin whitepaper explains that the majority of gaming revenue comes from 10% of users. Today, developers are struggling to monetize the remaining 90% of users. GameCoin claims to have found a way to do that using blockchain technology.\n\nBasically, GameCoin’s idea is to allow each game developer to create their own cryptocurrency. This cryptocurrency is used as in-game money. The developers can create this cryptocurrency at virtually no cost to themselves – it’s just a digital token that has value in the game. However, by the time it circulates through gamers, the token will have value because it can be used to pay for in-game items.\n\nIn more straightforward terms, GameCoin plans to make it easy for developers to create a secure in-game currency. It appears that these cryptocurrencies will operate as forks on the GameCoin blockchain. Each developer will be able to make their own fork – so gamers can easily apply their GWC tokens to any game of their choice (the GameCoin wallet will support all forks).","developer_score":13.62,"id":"game","image":{"large":"https://assets.coingecko.com/coins/images/2046/large/game.png?1547742459","small":"https://assets.coingecko.com/coins/images/2046/small/game.png?1547742459","thumb":"https://assets.coingecko.com/coins/images/2046/thumb/game.png?1547742459"},"links":{"bitcointalk_thread_identifier":2258262,"blockchain_site":["https://enjinx.io/eth/token/0xb70835d7822ebb9426b56543e391846c107bd32c","https://etherscan.io/token/0xB70835D7822eBB9426B56543E391846C107bd32C","https://ethplorer.io/address/0xb70835d7822ebb9426b56543e391846c107bd32c"],"facebook_username":"Gamecom-2055954348021983","homepage":["http://www.game.com"],"repos_url":{"github":["https://github.com/GameLeLe/trade-addr-tx-service"]},"telegram_channel_identifier":"gameico","twitter_screen_name":"gamecom666"},"liquidity_score":31.048,"market_cap_rank":2351,"name":"Game","public_interest_score":43.881,"symbol":"gtc","tickers":[{"base":"GTC","market":{"identifier":"bitforex","name":"Bitforex"},"target":"USDT"},{"base":"GTC","market":{"identifier":"gate","name":"Gate.io"},"target":"ETH"}]}