{"address":"0xb9EF770B6A5e12E45983C5D80545258aA38F3B78","coingecko_rank":1319,"coingecko_score":18.92,"community_score":20.741,"description":"0chain is a fast, flexible, free dCloud for a dApp on any chain. Underlying technology is a 2D Byzantine DPoS consensus protocol (2D-BPoS) with sub-second finality, a fast high-security storage protocol, a self-forking protocol to create a chain for a specific app or vertical, an inflation protocol to manage zero cost with 1% inflation, and infinite scalability with parallel chains. 0chain enables current dApps to move their off-chain code and data onto our 2 decentralized compute and storage platform. Its self-forking feature enables different verticals and applications to fine-tune their needs create separate chains without worrying about the integrity of the blockchain. Unlike a traditional cloud subscription model, dApps need to lock 0chain tokens to use the blockchain, more like a bank CD for a free scalable cloud, and as more 3 applications use our network, 0chain will grow in its intrinsic value and integrity.\n\nDoes 0chain compete with Ethereum, EOS, Filecoin, IOTA, and other chains? While 0chain improve on some aspects relative to other blockchains and storage solutions, they are not a fundraising platform but an extensible one to provide decentralized cloud service for DApps that have raised funds on these platforms. 0chain will partner with DApps that are on existing and future blockchains, and they can use our APIs to record micro-transactions and store data, and configure a chain that suit their specific needs, decoupled from the value of their token.","developer_score":0.0,"id":"0chain","image":{"large":"https://assets.coingecko.com/coins/images/4934/large/0chain.png?1547040360","small":"https://assets.coingecko.com/coins/images/4934/small/0chain.png?1547040360","thumb":"https://assets.coingecko.com/coins/images/4934/thumb/0chain.png?1547040360"},"links":{"announcement_url":["https://medium.com/0chain"],"bitcointalk_thread_identifier":2670071,"blockchain_site":["https://enjinx.io/eth/token/0xb9ef770b6a5e12e45983c5d80545258aa38f3b78","https://etherscan.io/token/0xb9ef770b6a5e12e45983c5d80545258aa38f3b78","https://ethplorer.io/address/0xb9ef770b6a5e12e45983c5d80545258aa38f3b78"],"homepage":["https://0chain.net/"],"repos_url":{"github":["https://github.com/0chain/js-client-sdk"]},"subreddit_url":"https://www.reddit.com/r/0chain/","telegram_channel_identifier":"Ochain","twitter_screen_name":"0costcloud"},"liquidity_score":1.0,"market_cap_rank":607,"name":"0chain","public_interest_score":25.725,"symbol":"zcn","tickers":[{"base":"ZCN","market":{"identifier":"bitcratic","name":"Bitcratic"},"target":"ETH"},{"base":"ZCN","market":{"identifier":"bitfinex","name":"Bitfinex"},"target":"BTC"}]}