{"address":"0xB9e7F8568e08d5659f5D29C4997173d84CdF2607","coingecko_rank":275,"coingecko_score":37.55,"community_score":37.611,"description":"Swarm City, found online at Swarm.city, is a commerce platform built on the <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> blockchain. The platform revolves around the SWT token. One of the unique things about Swarm City is that the data is stored locally on your device. There’s no central database. It’s also an open source project. Swarm City was created by a development team from Antwerp and entrepreneurs from the United States. The project was initially launched as a decentralized world known as Arcade City. The whitepaper for Arcade City for appeared online in October 2016.\n\nSwarm City allows people to communicate and transact in a decentralized way. Like other blockchain platforms, Swarm City has no middleman or trusted, centralized platform. It’s a P2P environment based on the Ethereum blockchain. One of the key features of Swarm City is the use of the Swarm City Token, or SWT. It’s the unique of exchange in Swarm City. All transactions on Swarm City are sent using SWT. Like other decentralized platforms built on Ethereum, Swarm City needs to use its own token to power he blockchain. Once you have SWT, you can use tokens for every exchange. Users can choose to see a transaction in dollars, Euros, or SWT. However, SWT is always the actual vehicle for the transaction. All transactions are recorded onto the public ledger using SWT.\n\nSwarm City has several features such as offers. Any user can publish a request for services or goods as an offer. Whether it’s ride-sharing or medical services, your offer can be posted to the Swarm City network. Besides, with Swarm City, funds are deposited into an escrow until the user releases the funds to the receiver. For every offer created, Swarm City automatically makes a smart contract. Both users deposit tokens into the smart contract as a guarantee for a successful transaction. In the event of a dispute, the user will not release the funds, and can start the process of resolving the dispute. There are also “guilds” that can resolve disputes based on their “Charter of the Guild”. Swarm City has a reputation system that works without the need to collect personal data. The platform makes a big deal out of the fact that it never has and never will collect or store personal data.","developer_score":55.701,"id":"swarm-city","image":{"large":"https://assets.coingecko.com/coins/images/621/large/swarm-city.png?1548611426","small":"https://assets.coingecko.com/coins/images/621/small/swarm-city.png?1548611426","thumb":"https://assets.coingecko.com/coins/images/621/thumb/swarm-city.png?1548611426"},"links":{"bitcointalk_thread_identifier":1794644,"blockchain_site":["https://enjinx.io/eth/token/0xb9e7f8568e08d5659f5d29c4997173d84cdf2607","https://etherscan.io/token/0xb9e7f8568e08d5659f5d29c4997173d84cdf2607","https://ethplorer.io/address/0xb9e7f8568e08d5659f5d29c4997173d84cdf2607"],"facebook_username":"SwarmCityDApp","homepage":["https://swarm.city/"],"repos_url":{"github":["https://github.com/swarmcity/SwarmCitySite"]},"subreddit_url":"https://www.reddit.com/r/SwarmCity","twitter_screen_name":"SwarmCityDApp"},"liquidity_score":1.0,"market_cap_rank":818,"name":"Swarm City","public_interest_score":33.73,"symbol":"swt","tickers":[{"base":"SWT","market":{"identifier":"uniswap","name":"Uniswap"},"target":"ETH"},{"base":"SWT","market":{"identifier":"yobit","name":"YoBit"},"target":"BTC"}]}