{"address":"0xBBbbCA6A901c926F240b89EacB641d8Aec7AEafD","coingecko_rank":51,"coingecko_score":53.319,"community_score":42.91,"description":"Loopring is a decentralized exchange protocol and an “automated execution system” built on <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> that will allow its users to trade assets across exchanges.  It isn’t a decentralized exchange.  Rather, it facilitates decentralized exchanging through ring-sharing and order matching. Decentralized and centralized exchanges alike will be able to implement Loopring, giving the exchanges access to cross blockchain and cross exchange liquidity and giving investors access to the best prices available on the broader market.  Moreover, Loopring is blockchain agnostic, meaning that any platform that uses smart contracts (e.g., <a href=\"https://www.coingecko.com/en/coins/neo\">NEO</a>, Ethereum, <a href=\"https://www.coingecko.com/en/coins/qtum\">Qtum</a>) can integrate with Loopring.\n\nServing as its head, Loopring founder Daniel Wang used to run a centralized exchange called Coin Port back in 2014.  “At that time,” he told Coin Central in an interview, “[I was] trying to solve the problems of centralized exchanges, and then I realized that it’s not possible.  Those problems are inherent to the centralized exchange model.”  Thus, he began conceptualizing what would become Loopring.  In the past, he’s also held a position as a Google Tech Lead and was a co-founder and VP of Yunrang Technology. Loopring’s CMO, Jay Zhou, was formerly employed by Ernst and Young, helped found SJ Consulting, and used to work in PayPal’s Risk Operations unit. Johnston Chen, the project’s COO, has worked as the chief information officer at 3NOD.\n\nLoopring is not a DEX, but a modular protocol for building DEXs on multiple blockchains. We disassemble the component parts of a traditional exchange and offer a set of public smart contracts and decentralized actors in its place. The roles in the network include wallets, relays, liquidity-sharing consortium blockchains, order book browsers, Ring-Miners, and asset tokenization services. Before defining each, we should first understand Loopring orders. At its root, the Loopring protocol is a social protocol in the sense that it relies on coordination amongst members to operate effectively towards a goal. This is not dissimilar to cryptoeconomic protocols at large, and indeed, its usefulness is largely protected by the same mechanisms of coordination problems [20], grim trigger equilibrium, and bounded rationality.\n\nThe Loopring Protocol can facilitate trading between ERC20 tokens. Loopr needs to convert Ether to Ether Token for trading as Ether is not ERC20 compatible, but Ether Token is. Converting between Ether and Ether Token will be done for you automatically when you submit an order, but if you want to trade frequently, we strongly suggest you to convert some Ether to Ether Token beforehand manually; otherwise each order will take one more blockchain transaction just for the ETH-WETH conversion which takes time and gas. Conversions between ETH and WETH are done on-chain through Ethereum transactions. ETH and WETH are always converted 1:1 which is guaranteed by the WETH smart contract. The WETH smart contract also guarantees the total WETH issued is exactly the total ETH deposited. In other words, ETH and WETH is equiviate in value, and WETH is just the ERC20 form of ETH.\n\nThe Loopring blockchain project had managed to raise almost 15 million US dollars during the period of the <a href=\"https://www.coingecko.com/en/ico/loopring\">Loopring ICO</a>, as all the regulatory experts watched this unprecedented crowdfunding. Daniel Wang, the founder and the main person behind the Loopring ICO, hand made it very transparent that the interface is quite bad but the underlying mechanism and the Order matching facility is very great. Loopring mining can be initiated very easily by using various performance calculating devices such as CPU, GPU, as well as application specific integrated circuits. The Loopring mining process can be initiated through the high-end Linux systems, according to reports. Loopring mining is basically a metaphor which is not similar to the Bitcoin mining but here the users need to match the specific orders from a huge database.  Specifically, Loopring mining requires the usage of the ethereum nodes along with JSON API, IPFS, etc.\n\nCheck out <a href=\"https://www.coinbureau.com/review/loopring-lrc/\">CoinBureau</a> for the full review of Loopring.","developer_score":72.58,"id":"loopring","image":{"large":"https://assets.coingecko.com/coins/images/913/large/LRC.png?1572852344","small":"https://assets.coingecko.com/coins/images/913/small/LRC.png?1572852344","thumb":"https://assets.coingecko.com/coins/images/913/thumb/LRC.png?1572852344"},"links":{"announcement_url":["https://medium.com/loopring-protocol"],"blockchain_site":["https://enjinx.io/eth/token/0xbbbbca6a901c926f240b89eacb641d8aec7aeafd","https://etherscan.io/token/0xbbbbca6a901c926f240b89eacb641d8aec7aeafd","https://ethplorer.io/address/0xbbbbca6a901c926f240b89eacb641d8aec7aeafd"],"homepage":["https://loopring.org/"],"repos_url":{"github":["https://github.com/Loopring/lightcone","https://github.com/Loopring/loopr","https://github.com/Loopring/protocol2","https://github.com/Loopring/protocols","https://github.com/Loopring/relay"]},"subreddit_url":"https://www.reddit.com/r/loopringorg/","telegram_channel_identifier":"loopring_en","twitter_screen_name":"loopringorg"},"liquidity_score":42.351,"market_cap_rank":123,"name":"Loopring","public_interest_score":26.794,"symbol":"lrc","tickers":[{"base":"LRC","market":{"identifier":"bitfinex","name":"Bitfinex"},"target":"BTC"},{"base":"LRC","market":{"identifier":"bitfinex","name":"Bitfinex"},"target":"ETH"},{"base":"LRC","market":{"identifier":"bittrex","name":"Bittrex"},"target":"BTC"},{"base":"LRC","market":{"identifier":"gate","name":"Gate.io"},"target":"BTC"},{"base":"LRC","market":{"identifier":"hitbtc","name":"HitBTC"},"target":"ETH"},{"base":"LRC","market":{"identifier":"okex","name":"OKEx"},"target":"BTC"},{"base":"LRC","market":{"identifier":"okex","name":"OKEx"},"target":"ETH"},{"base":"LRC","market":{"identifier":"okex","name":"OKEx"},"target":"USDT"},{"base":"LRC","market":{"identifier":"tokenomy","name":"Tokenomy"},"target":"BTC"},{"base":"LRC","market":{"identifier":"upbit","name":"Upbit"},"target":"BTC"},{"base":"LRC","market":{"identifier":"upbit_indonesia","name":"Upbit Indonesia "},"target":"BTC"},{"base":"LRC","market":{"identifier":"yobit","name":"YoBit"},"target":"BTC"},{"base":"LRC","market":{"identifier":"yobit","name":"YoBit"},"target":"ETH"},{"base":"LRC","market":{"identifier":"yobit","name":"YoBit"},"target":"RUR"},{"base":"LRC","market":{"identifier":"yobit","name":"YoBit"},"target":"USD"}]}