{"address":"0xBbC3a290C7D2755B48681c87f25F9d7F480aD42f","coingecko_rank":3801,"coingecko_score":6.126,"community_score":7.978,"description":"REMCO blockchain solution is a Tokenized money transfer platform with unparalleled speed, designed for licensed money transmitters.\nREMCO's technology platform provides money transmitters,  agents and customers a proven \"\"out-of-the\"\" box ledger solution to move money at the speed of thought.\nPer the pilot conducted by VTNGLOBAL in the States of  Georgia and Illinois in comparison to the traditional way of sending money, the test reveals that the REMCO process is ten times faster and more affordable.\n\nIt's a Powerful Distributed Token-Generating Platform for Money Transfer. The REMCO Token Generating Platform’s APIs to allow any licensed money transmitter to mint programmable Tokens to move value and leverage distributed ledger advantages at speed and scale, while also offering innovative compensation to all transaction stakeholders. Our Token is Jurisdiction and Money Transmission Flow Agnostic. Meaning it works with the existing model.\n\n The parent company has Money transmitter and mobile payment licenses and has processed billions in transactions with millions of subscribers.   \n\nThe parent company has many jurisdictional money transmitter licenses in the USA and CBN licenses for mobile payment and international money transfers. These businesses will be the first client of REMCO post-launch ensuring instant usage of REMCO's blockchain infrastructure.\n\nWe have existing integrations and process transactions daily for well-known corporates such as Western Union, IDT/Boss Revolution, Transfer-To, and many others.\nCurrently serving over 3.6m subscribers and over $700,000,000 in volume in the last 24 months.\n\nPeter Ojo, also VTNGlobal's CEO, has a history of taking first mover advantage with FinTech solutions deployed in Nigeria that still lead in that market. His Nigerian company, VTNetwork Limited, holds two licenses with the Central Bank of Nigeria for mobile payments and international money transfer, in a country of over 180 million population, where most are unbanked.\n\nThe company also plans an initiative that may have an even larger industry-wide impact. It will apply for a national bank charter in the USA, a new designation recently announced from The Office of the Comptroller of the Currency and will launch an MSB-centric bank, to serve the needs of licensed MSBs across the USA.\n\nRemco has big plans with an ICO this Fall that will build out the RemittanceToken platform capabilities, and fund rapid expansion across the USA and into many more markets.","developer_score":0.0,"id":"remittance-token","image":{"large":"https://assets.coingecko.com/coins/images/6911/large/remittance.jpg?1547043276","small":"https://assets.coingecko.com/coins/images/6911/small/remittance.jpg?1547043276","thumb":"https://assets.coingecko.com/coins/images/6911/thumb/remittance.jpg?1547043276"},"links":{"announcement_url":["https://medium.com/@peterojo"],"bitcointalk_thread_identifier":4983198,"blockchain_site":["https://etherscan.io/token/0xbbc3a290c7d2755b48681c87f25f9d7f480ad42f"],"chat_url":["https://remittancetoken.slack.com/","https://www.instagram.com/Remittancetoken/","https://www.linkedin.com/company/remittancetoken/"],"facebook_username":"remittancetoken","homepage":["https://remcosoftware.org/","https://www.remittancetoken.io/"],"repos_url":{"github":["https://github.com/Remittancetoken"]},"telegram_channel_identifier":"remittancetoken","twitter_screen_name":"remittancetoken"},"liquidity_score":1.0,"market_cap_rank":6909,"name":"Remittance Token","public_interest_score":39.313,"symbol":"remco","tickers":[{"base":"REMCO","market":{"identifier":"digifinex","name":"Digifinex"},"target":"BTC"},{"base":"REMCO","market":{"identifier":"p2pb2b","name":"P2PB2B"},"target":"BTC"},{"base":"REMCO","market":{"identifier":"p2pb2b","name":"P2PB2B"},"target":"ETH"},{"base":"REMCO","market":{"identifier":"p2pb2b","name":"P2PB2B"},"target":"USD"}]}