{"address":"0xbBc2045D335Cb224228f1850b29173d9d7D7b989","coingecko_rank":601,"coingecko_score":28.626,"community_score":11.884,"description":"Dear friends, we present to your attention the project, which has no ideological analogues in the world at the moment.\nIf you are interested in charitable activities, you should already know the difficulties and problems that arise on the way. One of these problems is the difficulty in financing international charitable activities, primarily due to the lack of a centralized platform that allows transactions to be carried out without any difficulties. As an example of this problem can be considered incompatibility of payment systems with each other. Thus, VISA / MasterCard cards issued in Europe are not accepted by US payment systems, and some payment systems may simply not be available in any country.\nAlso, electronic payment systems, such as Advanced Cash, Payeer, PayPal and others - are simply not compatible with each other, and accordingly, they imply transactions only between users of the system itself. Of course, today there are questionable exchangers that offer exchange between systems for an increased percentage. With cash, the situation is even more complex.  Well, the final part of the problem lies in the fact that in recent years, our lives are increasingly included turnover of cryptocurrencies.\nIn this regard, the dev team of HELP token project decided to start developing a platform that solves all the problems of transactions for the needs of charity.\nA revolutionary idea in this area will be to unite charity and the crypto industry, so we can make a huge step into the future, and greatly simplify the implementation of international donations. \nThe developed platform will carry out the sale and purchase of HELP token, using any cards, and the maximum number of payment systems.\nThe platform will use blockchain technology, in a certain block of which there will be charitable foundations and projects.\nAlso, our team will developed:\nHybrid mobile applications for using crypto currency in charity.\nPlug - ins and widgets for sites that use payment gateways, and allow transfers by pressing one or two buttons, with easy configuration and code implementation in the site.\nYes, we create a brand that will be widely known in the field of charity, and, of course, will create the most necessary, useful, functional and convenient tools for this!","developer_score":38.4,"id":"help-token","image":{"large":"https://assets.coingecko.com/coins/images/4339/large/go-help-fund-token-logo.png?1547039693","small":"https://assets.coingecko.com/coins/images/4339/small/go-help-fund-token-logo.png?1547039693","thumb":"https://assets.coingecko.com/coins/images/4339/thumb/go-help-fund-token-logo.png?1547039693"},"links":{"announcement_url":["https://blog.gohelpfund.com/"],"bitcointalk_thread_identifier":2160815,"blockchain_site":["https://enjinx.io/eth/token/0xbbc2045d335cb224228f1850b29173d9d7d7b989","https://etherscan.io/token/0xbbc2045d335cb224228f1850b29173d9d7d7b989","https://ethplorer.io/address/0xbbc2045d335cb224228f1850b29173d9d7d7b989"],"facebook_username":"gohelpfund","homepage":["https://gohelpfund.com/"],"repos_url":{"github":["https://github.com/GoHelpFund/gohelpfund-web-app"]},"subreddit_url":"https://www.reddit.com/r/gohelpfund","telegram_channel_identifier":"gohelpfund","twitter_screen_name":"GoHelpFund_com"},"liquidity_score":8.04,"market_cap_rank":1098,"name":"GoHelpFund","public_interest_score":44.498,"symbol":"help","tickers":[{"base":"HELP","market":{"identifier":"stocks_exchange","name":"STEX"},"target":"BTC"}]}