{"address":"0xbC647aAd10114B89564c0a7aabE542bd0cf2C5aF","coingecko_rank":623,"coingecko_score":26.896,"community_score":16.107,"description":"IONC is the official token of IONChain. It can be utilized by different participants in IONChain ecosystem. The maximum supply of IONC is 800 million. It is going to be released gradually for 20 years. After 20 years, the administrative committee elected by IONChain users using the consensus mechanism will decide whether to re-issue IONC tokens based on the amount of on-chain devices, amount of data being processed and the overall level of IONC abundance in the ecosystem.\nIoT devices and data access constitute the core parts of IONChain ecosystem, therefore IONC token is going to be used to reward devices and data providers. The yearly supply of IONC tokens increases along with the demand for data access. However, the upper limit is pre-set.\n\nIONC token is an indispensable part of the IONChain system as it is a single most crucial part of its ecIONChain aims to solve a wide range of the current problems of IoT networks in terms of data security, data circulation, data sharing and data transactions, thus enhancing the efficiency of the whole IoT ecosystem. IONChain introduces the concept of “One Device, One Coin, One Code” which facilitates the integration of IoT devices with the IONChain blockchain network. With the use of Edge Computing technology, it enables every device on the IoT network to be utilized as a mining machine, making every IoT device that uses IONChain subject to mining rewards. Owing to the use of blockchain technology, the data source will always be reliable and verifiable on the IONChain network. Furthermore, the value ofthe data is quantified and data transfers are fast and secured. This makes it easier for IoT standards to emerge, unlocks a plethora of new IoT application scenarios and boosts the whole industry to enter the next level of development.","developer_score":15.967,"id":"ionchain-token","image":{"large":"https://assets.coingecko.com/coins/images/6572/large/3PD7ycbU_400x400.jpg?1547042781","small":"https://assets.coingecko.com/coins/images/6572/small/3PD7ycbU_400x400.jpg?1547042781","thumb":"https://assets.coingecko.com/coins/images/6572/thumb/3PD7ycbU_400x400.jpg?1547042781"},"links":{"announcement_url":["https://medium.com/@ionchain","https://steemit.com/@ionchain/"],"bitcointalk_thread_identifier":3641957,"blockchain_site":["https://enjinx.io/eth/token/0xbc647aad10114b89564c0a7aabe542bd0cf2c5af","https://etherscan.io/token/0xbc647aad10114b89564c0a7aabe542bd0cf2c5af","https://ethplorer.io/address/0xbc647aad10114b89564c0a7aabe542bd0cf2c5af"],"chat_url":["https://t.me/ionchain"],"homepage":["https://www.ionchain.org/"],"repos_url":{"github":["https://github.com/ionchain/ionchain-wallet-android"]},"subreddit_url":"https://www.reddit.com/r/ionchain/","telegram_channel_identifier":"ionchainen","twitter_screen_name":"ion_chain"},"liquidity_score":23.825,"market_cap_rank":447,"name":"IONChain","public_interest_score":26.398,"symbol":"ionc","tickers":[]}