{"address":"0xBe428c3867F05deA2A89Fc76a102b544eaC7f772","coingecko_rank":1438,"coingecko_score":19.493,"community_score":10.101,"description":"CyberVein was founded at the beginning of a world class structure, and is a public link to open to the world. CyberVein is made to integrate the form of data economy in various aspects with the block chain technology as the core. Blockchain is the essence of a variety of technology integration into a State of a synchronous Machine (State Machine), using the characteristics of block chain technology to solve problems which cannot be solved in a traditional network. CyberVein also need to fully consider the model in the process of economics, architecture of applied mathematics, computer hardware and software technology. Its main purpose is to use the block chain technology to successfully serve the problem solving product/platform (BASS).\n\nThrough the analysis of the problems encountered in the design process of the existing blockchain technology, we also propose solutions to these problems. CyberVein is a underlying framework based on DAG and contains a programming language, the virtual machine, new smart contracts to build ecological chain system, the underlying blocks dedicated to and from the aspects of technical level and business level to solve the problem from the data value of the information age.\n\nThe business logic of CyberVein\n1. The value of passive data: passive data (such as Cookies) is not valuable in itself and only has the value to be exchanged.\n2. Definition of data exchange value: the exchange value of data needs to be defined by carrier and medium, which can be quantified to define data value and realize data transfer.\n3. The ownership of data: data is different from the ownership of the property rights and intellectual property rights. Data ownership is fundamentally to dominate the process of data, it can define the data owner distributing the data in detail, the capability of sharing, and delivered to the other party; At the same time, data ownership can also define the rights of data owners and tripartite users to create, edit, modify, share, and restrict access to data.\nThe three characteristics of CyberVein in the design of deep understanding and mining data can only improve the ecology of data value discovery.\n\nThe technical solutions of CyberVein\nCyberVein has the following technologies and innovative solutions proposed by multiple analysis to realize the design goal of CyberVein.\n1.A distributed ledger of DAG architecture.\n2.A smart contract programming language improved by CyberVein and a database virtual machine.\n3.A new consensus mechanism - PoC (Proof of Contribution)\n4.A new, inter-ecological smart contract architecture.\nOn the value of the data found in the process of using a DAG architecture of distributed books and a virtual machine with database functions, anyone can write the database and release smart contracts and Dapp, thus they can develop the data ownership of their value, data exchange format and data conversion function of rules.\n\nCyberVein programming language and virtual machine\nIn order to better achieve our smart contract outstanding performance, there are differences to the existing blockchain smart contracts. CyberVein will be in the development of the network at the same time, develop our own programming language Vein and Virtual Machine CBVM (CyberVein Virtual Machine). Vein language will take the Solidity as the foundation, at the same time, to improve the running mechanism with the help of some rich libraries about database operations, realize functions such as definition method call price.\nVein language will help in the existing smart contract writers blockchain migration, and CyberVein will release documents to help developers get started faster.\nCBVM defines the data value in ecological and metastasis, and provide safe and reliable high-performance smart contracts running environment. CyberVein virtual machine in addition to used to run the smart contract, will also be a database operation system. Unlike traditional database, the database in CBVM sandbox is more like a database, and the operation of each node of the virtual machine will have independent sandbox, ensure data or use condition does not affect chain is affected.\n\nCyberVein new consensus algorithm: Proof of Contribution\nCyberVein, like all blockchain technology, is driven by motivation of safe mode. In the traditional blockchain mining consensus, it is based on the choice of total difficulty of highest blocks. Miners and others to the blocks. In most of the consensus standards, only containing a given difficulty of work experience (PoW) of blocks are valid.\nThere’s no mining mechanism in the DAG architecture because there is no miner concept. However, the existing DAG in the project before the release unit verification, most are using PoW and CyberVein will use our PoC mechanism is put forward.\nCyberVein contribution to prove: a response to block in the chain of the abuse of power or force concentrated and algorithm. PoC is based on the user's contribution to the network, add the appropriate hash calculation, to determine whether can win in the competition mechanism in the network. In traditional blockchain PoC can be used in the process of mining.\nIn each have the same hash miners work force, contribute more to the network resources miners (such as he contributed more hard disk capacity, or bandwidth, or power, etc.) will have smaller hash difficulty, so as to have more chance to beat competitors in the probability, acquired the right to the manufacture of new blocks.\nIn the DAG, when a user has more units under the condition of (he contributed more hard disk storage unit in the network), it will be more likely to reference the existing units, and obtain the corresponding fees.\nIOTA and Byteball projects in PoW validation of the role is mainly used to prevent the witch attacks and network to some extent abuse problems, and we believe that the use of PoC and other mechanisms, and can be done at the same time, encourage more users to participate in and contribution to the attack of prevention effect.","developer_score":0.0,"id":"cybervein","image":{"large":"https://assets.coingecko.com/coins/images/3886/large/cybervein-logo.png?1547038938","small":"https://assets.coingecko.com/coins/images/3886/small/cybervein-logo.png?1547038938","thumb":"https://assets.coingecko.com/coins/images/3886/thumb/cybervein-logo.png?1547038938"},"links":{"bitcointalk_thread_identifier":2890016,"blockchain_site":["https://enjinx.io/eth/token/0xbe428c3867f05dea2a89fc76a102b544eac7f772","https://etherscan.io/token/0xbe428c3867f05dea2a89fc76a102b544eac7f772","https://ethplorer.io/address/0xbe428c3867f05dea2a89fc76a102b544eac7f772"],"facebook_username":"cyberveinpage","homepage":["http://www.cybervein.org/"],"telegram_channel_identifier":"cybervein","twitter_screen_name":"cyberveingroup"},"liquidity_score":18.18,"market_cap_rank":757,"name":"CyberVeinToken","public_interest_score":25.138,"symbol":"cvt","tickers":[{"base":"CVT","market":{"identifier":"hitbtc","name":"HitBTC"},"target":"USD"}]}