{"address":"0xBeB6fdF4ef6CEb975157be43cBE0047B248a8922","coingecko_rank":3315,"coingecko_score":7.416,"community_score":4.689,"description":"ARP is the digital crypto asset of decentralized blockchain based on the ARP value protocol. It will be used in all scenarios of ARP ecosystems. The total number of ARP is fixed at 1000,000,000. ARP will serve as the digital voucher proving that owners of device have shared their devices, and ensuring the distribution of ARP tokens via smart contracts. The ARP fund will develop DApp based on ARP value protocol and airdrop a portion of DApp tokens as candies to users. Users only need to lock the tokens in smart contracts as required. In the ARP value protocol system, every decision is made by voting within a particular period of time. Length of time may differ for different proposals. Proposals will be executed only when enough votes in favour are collected; otherwise they will be rejected. So in this decentralized ARP system, individuals with the biggest votes do not have the power to decide everything. Small votes also have a say, as they can unite and hold the former in check.\n\nIn the future, all shared smart devices need to hold a certain amount of ARPs in their accounts as the sharing vouchers, and all registered miners need to have some ARPs in hand to prevent the destruction and abuse of the system by inactive smart devices and miners.\n\nARP·阿普协议是一个价值交易协议，交易的是“ARP”资源。ARP即App Rendering Power，是智能设备运行应用的能力，比如手机运行抖音，PC运行浏览器等。ARP·阿普协议通过鼓励普通用户将智能设备（手机、电脑、路由器、平板、智能电视等）的ARP资源共享出来，通过共享经济+区块链技术得到充分流动，并发挥具有颠覆性的场景服务，例如不用下载、不用安装即点即用任何App等。","developer_score":12.605,"id":"arp-token","image":{"large":"https://assets.coingecko.com/coins/images/4957/large/arp-token-logo.jpg?1547040379","small":"https://assets.coingecko.com/coins/images/4957/small/arp-token-logo.jpg?1547040379","thumb":"https://assets.coingecko.com/coins/images/4957/thumb/arp-token-logo.jpg?1547040379"},"links":{"blockchain_site":["https://etherscan.io/token/0xbeb6fdf4ef6ceb975157be43cbe0047b248a8922"],"chat_url":["https://0.plus/#/arpnetwork"],"homepage":["https://www.arpnetwork.org/"],"repos_url":{"github":["https://github.com/arpnetwork/contracts"]},"twitter_screen_name":"arp_network"},"liquidity_score":0.0,"market_cap_rank":3303,"name":"ARP Token","public_interest_score":30.922,"symbol":"arp","tickers":[]}