{"address":"0xbF799A2F71D020A4A8C10E7406E2bf970B3d734B","coingecko_rank":2463,"coingecko_score":11.837,"community_score":16.506,"description":"W12.io | Blockchain protocol \n\nW12 is an open protocol for the creation of DAOs. The protocol consists of smart contract templates (no programming skills required), DAO governance and a decentralized oracles network that controls execution of the project roadmap and milestones.\n\nSuch solutions protect any fund contributor from intentional SCAM and unintentional failure, reduce risks and expenses, consequently ensuring trust and transparency between projects and token buyers.\n\nThe fundraising campaign may be of any type: Charity, ICO – both utility and security, Crowdfunding and any other crowd sourced fundraising and governance.\n\nW12 is a decentralized infrastructure where the parties do not need to trust each other and any controversial issues are resolved transparently, quickly and at a lower cost.\n\nThe W12 protocol is designed to be easily integrated into any existing business, platform or organization. In addition, W12 provides a token sale platform, through which projects can sell their tokens and easily launch fundraising campaigns based on the W12 protocol.\n\nW12 total addressable markets (TAM) = $800 billion\n\nWe believe that W12 or solutions similar to W12 can claim 5-10% of the market in 5 to 6 years respectively.\n\nW12 is a commission-based service. As projects acquire funds via our platform, W12 charges from 0% to 10% of the total funds raised. Depending on the amount of funds stored via the W12 smart contracts, the commission is raised/lowered. The more funds are stored with W12, the lower the commission. Also, there is 0.5% commission for the use of the protocol.","developer_score":0.0,"id":"w12","image":{"large":"https://assets.coingecko.com/coins/images/5953/large/w12.jpg?1547041892","small":"https://assets.coingecko.com/coins/images/5953/small/w12.jpg?1547041892","thumb":"https://assets.coingecko.com/coins/images/5953/thumb/w12.jpg?1547041892"},"links":{"announcement_url":["https://medium.com/@w12_io"],"bitcointalk_thread_identifier":3220425,"blockchain_site":["https://etherscan.io/token/0xbf799a2f71d020a4a8c10e7406e2bf970b3d734b"],"chat_url":["https://t.me/w12_io"],"facebook_username":"w12.io","homepage":["https://w12.io/"],"repos_url":{"github":["https://github.com/w12-platform"]},"telegram_channel_identifier":"w12io","twitter_screen_name":"w12_io"},"liquidity_score":24.746,"market_cap_rank":2524,"name":"W12","public_interest_score":27.609,"symbol":"w12","tickers":[]}