{"address":"0xC27C95350eCD634C80dF89db0f10cd5c24B7B11f","coingecko_rank":2881,"coingecko_score":9.326,"community_score":7.233,"description":"We have realized that as the post 90s and 00s growing up, they have subverted the traditional consumption cognition about virtual goods and the pure virtual goods have come into the mainstream consumers’ eyes. We are aiming at establishing a decentralized virtual goods trading platform to serve content creators, to help designers creating, socializing and liquidating in the worldwide.\n\nThe confirmation of massive design blueprints\nAt present, plagiarism is the most common problem among original creators. Analyzing the color of pictures on particular applications and ranking the colored part of each picture by percentage, we can get a unique color code for each picture, which means the color parameter. Besides, we have designed a set of algorithms for this process. Thus we can set up the color parameter, time bound and author signature to protect the rights of original inventors. The rights of all works can be employed and traced by intelligent contracts.\n\nColor parameter:\nSample=xlnRed+ylnYellow+zlnBlue\nAmong them, x, y, z respectively represents the proportion of the three colors that occupying the highest proportion in a certain picture. Take the examples of red, yellow and blue, if the Sample parameters in the two pictures are exactly the same, the similarity is quite high.","developer_score":12.0,"id":"pixie-coin","image":{"large":"https://assets.coingecko.com/coins/images/4036/large/pixie-coin.png?1548331351","small":"https://assets.coingecko.com/coins/images/4036/small/pixie-coin.png?1548331351","thumb":"https://assets.coingecko.com/coins/images/4036/thumb/pixie-coin.png?1548331351"},"links":{"blockchain_site":["https://etherscan.io/token/0xc27c95350ecd634c80df89db0f10cd5c24b7b11f"],"homepage":["http://pixiecoin.io/"],"repos_url":{"github":["https://github.com/PixieCoinFoundation/PixieCoin"]},"telegram_channel_identifier":"pixiecoin","twitter_screen_name":"coin_pixie"},"liquidity_score":5.523,"market_cap_rank":2349,"name":"Pixie Coin","public_interest_score":34.126,"symbol":"pxc","tickers":[{"base":"PXC","market":{"identifier":"bit_z","name":"Bit-Z"},"target":"BTC"},{"base":"PXC","market":{"identifier":"bit_z","name":"Bit-Z"},"target":"ETH"}]}