{"address":"0xC28e931814725BbEB9e670676FaBBCb694Fe7DF2","coingecko_rank":801,"coingecko_score":24.748,"community_score":23.827,"description":"Quadrant is a blockchain-based protocol that enables the access, creation, and distribution of data products and services with authenticity and provenance at its core. Quadrant aims to provide a blueprint for mapping disparate data sources. It will support proof of data authenticity and provenance via data stamping, the creation of “Constellations” (data smart contracts) for disparate data sources, and fair remuneration and incentive sharing. Data Consumers can trust the authenticity of the data they purchase, “Nurseries” (Data Producers) are compensated fairly every time their data is used, and “Pioneers” (Data Vendors) have the incentive to create innovative Constellations. This new transparent ecosystem ensures that companies get the authentic data they need.\n\nWhere Quadrant has major potential for impact is the ability it provides “Elons” (the brightest data minds) to find linkages between different constellations and, in turn, create mega Constellations that can be used by Data Consumers to solve real-world problems. This is where Quadrant differentiates itself from its competitors.\n\nQuadrant is designed to work with both centralised and decentralised services. The architecture consists of the core Quadrant blockchain, clients (Data Producer, Data Consumer and Anchor), and Guardian Nodes. Quadrant will operate on a Proof of Authority consensus mechanism so that it can handle more transactions, operate at a lower gas price, achieve faster transactions, and restrict malicious nodes from entering data into the network. An external Proof of Work chain will be used as an anchor for security purposes. For the time being, the Ethereum blockchain will be used for anchoring but it can be replaced by any public chain in the future if needed.\n\nQuadrant will utilise two different currencies for its network: eQuad and QUAD. QUAD, a utility token, is designed to be used solely on the network. It will be used to stamp data, support simple and complex access structures, simple and complex subscription payments, and for staking by Elons. eQuad is an ERC-20-compliant token that will be sold during the Token Generation Event (TGE). It may be converted into QUAD via a gateway when the Quadrant mainnet is launched.","developer_score":0.0,"id":"quadrant-protocol","image":{"large":"https://assets.coingecko.com/coins/images/4462/large/equad.png?1547039783","small":"https://assets.coingecko.com/coins/images/4462/small/equad.png?1547039783","thumb":"https://assets.coingecko.com/coins/images/4462/thumb/equad.png?1547039783"},"links":{"announcement_url":["https://medium.com/quadrantprotocol","https://www.linkedin.com/company/quadrantprotocol/"],"blockchain_site":["https://enjinx.io/eth/token/0xc28e931814725bbeb9e670676fabbcb694fe7df2","https://etherscan.io/token/0xc28e931814725bbeb9e670676fabbcb694fe7df2","https://ethplorer.io/address/0xc28e931814725bbeb9e670676fabbcb694fe7df2"],"facebook_username":"quadrantprotocol","homepage":["https://www.quadrantprotocol.com/#"],"subreddit_url":"https://www.reddit.com/r/quadrantprotocol/","telegram_channel_identifier":"quadrantprotocol","twitter_screen_name":"explorequadrant"},"liquidity_score":30.094,"market_cap_rank":956,"name":"Quadrant Protocol","public_interest_score":25.972,"symbol":"equad","tickers":[{"base":"EQUAD","market":{"identifier":"bilaxy","name":"Bilaxy"},"target":"ETH"},{"base":"EQUAD","market":{"identifier":"idex","name":"Idex"},"target":"ETH"},{"base":"EQUAD","market":{"identifier":"kyber_network","name":"Kyber Network"},"target":"ETH"}]}