{"address":"0xc324a2f6b05880503444451B8b27e6f9e63287Cb","coingecko_rank":352,"coingecko_score":35.364,"community_score":16.846,"description":"Exchange Union is a “decentralized network” that connects individual digital asset exchanges from around the world. The team is on a mission to solve one of crypto’s most prominent issues – illiquidity. Most investors have experienced this first-hand: You find a digital asset you like and want to invest in. However, the coin is only available on a handful of exchanges. On top of that, you can only use <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a> or <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> to trade for it. This leads to a sometimes hour-long process filled with multiple manual transfers over at least two exchanges.\n\nPayment channels provide an instant way to transfer digital assets off-chain between two parties. The transactions are only recorded on the blockchain when the payment channel is first opened and when it’s closed. You can think of it as updating balances on both ends of the channel for each transfer. Once you close the payment channel, both parties get their respective final balances. Payment channels are trustless – any disputes are resolved automatically through cryptography. And, transfers using them are secured by the underlying blockchain making them as reliable as exchanges on the blockchain itself. Bitcoin’s Lightning Network and Ethereum’s <a href=\"https://www.coingecko.com/en/coins/raiden-network\">Raiden Network</a> are two of the most popular examples of payment channels.\n\nJames Wo (CEO), Terry Culver (CSO), Mikael Wang (Chief Blockchain Architect), and Kilian Rausch (Product Director) lead the Exchange Union management team. The team has extensive blockchain experience with some impressive positions on their resumes. Wo is the Founder and Chairman of the Board of Digital Finance Group – the world’s leading blockchain focused business group. Wang was formally the CTO of BTCC as well as a Chief Solutions Architect at Ericsson. Rausch was previously the PO at Mobi, a leading digital asset wallet.\n\nBridge digital currency exchanges around the world and realize investors’ cross-exchange trading, cross-exchange clearing, deposits and withdrawals among different digital currencies and assets. Improve trading efficiency and performance of exchanges and realize the market-oriented distribution of digital currencies’ liquidity and best price offers.First, bridge the exchanges in terms of trading, deposits, withdrawals and clearing through agreements among digital currency exchanges and offer discounts on trading fees; provide deals on credit and margin trading. Soon afterwards, build Exchange Union Chain and realize the full interconnection among digital currency exchanges through blockchain technique.","developer_score":73.204,"id":"exchange-union","image":{"large":"https://assets.coingecko.com/coins/images/1052/large/exchange-union.png?1548125817","small":"https://assets.coingecko.com/coins/images/1052/small/exchange-union.png?1548125817","thumb":"https://assets.coingecko.com/coins/images/1052/thumb/exchange-union.png?1548125817"},"links":{"bitcointalk_thread_identifier":2028383,"blockchain_site":["https://etherscan.io/token/0xc324a2f6b05880503444451b8b27e6f9e63287cb"],"homepage":["https://www.exchangeunion.com/"],"repos_url":{"github":["https://github.com/ExchangeUnion/xud"]},"telegram_channel_identifier":"exchangeunioncoin","twitter_screen_name":"exchange_union"},"liquidity_score":45.652,"market_cap_rank":3499,"name":"Exchange Union","public_interest_score":37.207,"symbol":"xuc","tickers":[{"base":"XUC","market":{"identifier":"exx","name":"EXX"},"target":"ETH"}]}