{"address":"0xC4131C1893576e078a0b637b653f3E6A18e137Ac","coingecko_rank":5374,"coingecko_score":3.589,"community_score":0.0,"description":"YB artificial intelligence visual recognition bio-blockchain project is a new high-tech project based on artificial intelligence combined with blockchain realized by AI technology. It promotes visual recognition of biotechnology landing and the protection of personal privacy data through the mining and circulation of the token. no need for third party verification KYC; mainly has the following characteristics:\n\n       1. Guarantee user data privacy: achieve the highest level of data security through cryptographic\ntechniques such as zero-knowledge proof, homomorphic encryption, and differential privacy;\n\n       2. The data belongs to the user: the user has full ownership of the data, and the third party\nneeds to be authorized by the user to use the data. The data obtained by the user's authorization will also receive good privacy protection. The technology of homomorphic encryption and secure multi-party computing will ensure that the data will not be leaked and copied during use, thus ensuring that the data belongs to the user completely and protects the user's interests;\n\n      3. Face feature as a pass-through private key: based on YB's many years of face recognition technology\nand AI algorithm, it can accurately verify the identity of the user through the face and protect the account security;\n\n      4. No need for third-party KYC: Resolve user identity authentication (KYC) issues that prevent\nblockchain applications from landing. With the user's consent, the YB Smart Pass is anchored with the real user identity to better connect the digital world and the real world. Based on zero-knowledge proof technology, user authentication does not affect user privacy under user authorization;\n\n      5. The data is completely credible: based on the inability to modify and trace the blockchain\nto ensure the credibility of user data.","developer_score":0.0,"id":"yb","image":{"large":"https://assets.coingecko.com/coins/images/7322/large/logo_%2839%29.png?1547043980","small":"https://assets.coingecko.com/coins/images/7322/small/logo_%2839%29.png?1547043980","thumb":"https://assets.coingecko.com/coins/images/7322/thumb/logo_%2839%29.png?1547043980"},"links":{"blockchain_site":["https://etherscan.io/token/0xc4131c1893576e078a0b637b653f3e6a18e137ac"],"homepage":["http://www.ai-yb.com/"]},"liquidity_score":1.0,"market_cap_rank":2353,"name":"YB","public_interest_score":33.891,"symbol":"yb","tickers":[]}