{"address":"0xC5d105E63711398aF9bbff092d4B6769C82F793D","coingecko_rank":3556,"coingecko_score":6.888,"community_score":0.0,"description":"Beauty Chain is the world's first blockchain platform dedicated to the beauty ecosystem. Beauty Chain expects using blockchain-based incentive mechanism to distribute content value more effectively and equitably to content creators and participants. We aim to provide quality female media content and product analysis to content consumers, facilitating production and dissemination of quality beauty-related content. Beauty Chain primary goal is to form a beauty-related content and information sharing platform, establish an incentive mechanism to facilitate users jointly build the world’s largest female community. The long-term goal is to surpass traditional media platforms, set benchmarks for the industry so that participants on platform such as content creators, content consumers, content disseminators , and ecosystem founders can all be motivated and rewarded for their contributions.\n\nContent ecosystem\nBeauty Chain content platform participants mainly consists of three roles: content creator, content disseminator, and content consumer. Content creator creates quality content, content disseminator promotes content that interested them, and content consumers consume their favorite content. These three roles both can be interacted with and transformed into each other. The three together form a platform closed-loop, pushing forward of Beauty Chain on platform development.\n\nBEC, as a token in Beauty Chain ecosystem, runs through the entire life cycle of content creation, dissemination, consumption, and maintains the entire ecosystem operation. With Beauty Chain smart contract, users’ contributions to the community are rewarded in form of BEC.\n\nAlpha - Beauty Chain ecosystem core DAPP\nAlpha is an official solution of Beauty Chain in fashion and pan-entertainment content industry. It is a Beauty Chain’s DAPP built with blockchain based and focused on Beauty content platform. Alpha is currently a code number, and it is expected that in November 2018, we will officially launch Alpha’s products. Alpha’s service scope includes information aggregation and distribution, content creation and dissemination, etc. It provides users with life-cycle support for content creation, dissemination and consumption. Alpha uses blockchain technology to rationalize the distribution of benefits among the entire ecosystem participants.","developer_score":0.0,"id":"beauty-chain","image":{"large":"https://assets.coingecko.com/coins/images/4769/large/beauty-chain-token-logo.png?1547040098","small":"https://assets.coingecko.com/coins/images/4769/small/beauty-chain-token-logo.png?1547040098","thumb":"https://assets.coingecko.com/coins/images/4769/thumb/beauty-chain-token-logo.png?1547040098"},"links":{"blockchain_site":["https://etherscan.io/token/0xc5d105e63711398af9bbff092d4b6769c82f793d"],"homepage":["http://www.beauty.io/"],"telegram_channel_identifier":"beautychain"},"liquidity_score":17.253,"market_cap_rank":3471,"name":"Beauty Chain","public_interest_score":34.375,"symbol":"bec","tickers":[]}