{"address":"0xc7BbA5b765581eFb2Cdd2679DB5Bea9eE79b201f","coingecko_rank":2063,"coingecko_score":13.493,"community_score":1.333,"description":"Gems is a protocol for contracting workers to perform micro tasks. Workers stake tokens in order to prove validity of their tasks and earn a reusable computed trust score, enhancing the cost-efficiency of the network while democratizing access to scalable micro task workers.\n\nGems, a decentralized, open-sourced, human task crowdsourcing protocol built on top of the Ethereum blockchain. Using the Gems Protocol, anyone can tap into the power of scalable micro task workers without needing to worry about task verification, trust, or payments. Gems is designed to disincentivize malicious actors and reward fair players. The Gems Protocol is comprised of a staking mechanism to ensure task completion, a trust mechanism to track worker integrity, and a payment system to reduce transaction fees. The GEM token, a multi-utility token, fuels the Gems Protocol. Gems uses its token mechanism to enforce the behavior of all participants, instead of being regulated by a single operator.\n\nGems Protocol, aptly named the Gems Platform. The Gems Platform connects those who want work done (henceforth known as “requesters”) and human workers (henceforth known as “miners”). By using the Gems Protocol, the Gems Platform removes socioeconomic barriers that exist in centralized alternatives (e.g. large fees, market inefficiencies, need for bank accountants, etc.). Anyone can build on top of the Gems Platform, creating “modules” that are interfaces for particular human tasks. The first module the Gems team will build focuses on labeling data for AI.","developer_score":0.0,"id":"gems-2","image":{"large":"https://assets.coingecko.com/coins/images/3945/large/Webp.net-resizeimage_%2817%29.jpg?1547038970","small":"https://assets.coingecko.com/coins/images/3945/small/Webp.net-resizeimage_%2817%29.jpg?1547038970","thumb":"https://assets.coingecko.com/coins/images/3945/thumb/Webp.net-resizeimage_%2817%29.jpg?1547038970"},"links":{"blockchain_site":["https://enjinx.io/eth/token/0xc7bba5b765581efb2cdd2679db5bea9ee79b201f","https://etherscan.io/token/0xc7bba5b765581efb2cdd2679db5bea9ee79b201f","https://ethplorer.io/address/0xc7bba5b765581efb2cdd2679db5bea9ee79b201f"],"homepage":["https://gems.org/"],"official_forum_url":["https://blog.gems.org/"],"telegram_channel_identifier":"gemsorg","twitter_screen_name":"gems"},"liquidity_score":1.0,"market_cap_rank":1114,"name":"Gems","public_interest_score":36.882,"symbol":"gem","tickers":[{"base":"GEM","market":{"identifier":"gate","name":"Gate.io"},"target":"ETH"}]}