{"address":"0xc8Cac7672f4669685817cF332a33Eb249F085475","coingecko_rank":3045,"coingecko_score":8.165,"community_score":20.81,"description":"LivenPay is Australia’s biggest loyalty based payment network built on blockchain for all types of consumer facing businesses and is creating the world’s first behavioural gamification layer for the offline world. Launched in 2015, LivenPay now connects more than 500,000 users and over 1,000 restaurants in Australia’s largest two cities, Sydney and Melbourne, with a third city, Brisbane, launching soon. Consumers earn 10–30% rewards in LVN (Liven Token) on every transaction they make using LivenPay that they can spend anywhere within the Liven merchant network on future transactions or send to their friends.\n\nThe company already facilitates the circulation, storage and payment between consumers and merchants through the issuance of the LVN Token, creating a closed loop for food consumption. LivenPay’s App is called ‘Liven’, and is available on both the Android and iOS app stores, it functions as a mobile payment and loyalty platform for the food and beverage industry — but it is much more than that. It is the world’s first global lifestyle economy for everyday use, by everyday people, and is powered by the blockchain.\n\nHow much more exciting real life would be if everything you love to do whether that’s eating out or watching movie are gamified and you are playing game as part of your real life and you will earn status, money, be part of community for completing missions and quest. LivenPay seeks to solve fundamental problems in traditional loyalty and rewards programmes which fails to implement proper gamification element while enabling cryptocurrency mass-adoption, through the use of a universal network rewards currency, with users participating in an economy in which they transact in-app and are rewarded for their real-world economic activity.\n\nLivenCoin (LVN) is a business backed blockchain token governed by a decentralized Reward Protocol, which gives LVN real-world purchasing power within an existing network of more than 1,000 brick-and-mortar merchants. LivenPay has grown 20% month on month since January 2018, having leveraged intelligent partnerships with leading Point of Sale (POS) terminal providers to achieve a technical reach of more than 25,000 venues through POS integration, with international expansion to 10 more cities happening by the end of 2020.","developer_score":0.0,"id":"livenpay","image":{"large":"https://assets.coingecko.com/coins/images/9554/large/8PgKjhJn_400x400.jpg?1568837435","small":"https://assets.coingecko.com/coins/images/9554/small/8PgKjhJn_400x400.jpg?1568837435","thumb":"https://assets.coingecko.com/coins/images/9554/thumb/8PgKjhJn_400x400.jpg?1568837435"},"links":{"blockchain_site":["https://etherscan.io/token/0xc8cac7672f4669685817cf332a33eb249f085475"],"chat_url":["https://www.instagram.com/livenpay/","https://www.linkedin.com/company/liven/"],"facebook_username":"LivenPay","homepage":["https://livenpay.io/"],"repos_url":{"github":["https://github.com/LivenPay/"]},"subreddit_url":"https://www.reddit.com/r/LivenPay/","telegram_channel_identifier":"livenpay","twitter_screen_name":"livenpay"},"liquidity_score":2.813,"market_cap_rank":5236,"name":"LivenPay","public_interest_score":24.001,"symbol":"lvn","tickers":[]}