{"address":"0xc9859fccC876e6b4B3C749C5D29EA04F48aCb74F","coingecko_rank":3198,"coingecko_score":7.728,"community_score":6.018,"description":"InoCoin is a decentralized cryptocurrency built with the sole purpose of helping prospective new businesses find funding. Our aim is to draw in a large pool of funding applicants and pick the ones who prove they deserve the investment. We base our decisions on a set of criteria that are purely objective, built as a result of our extensive experience with investing. This guarantees that InoCoin will keep growing, because it is not directly tied to the market, but only to the select, high-quality startups we choose to fund.\n\nThey use blockchain technology because we believe in its future, because we are business people and have a logical outlook. Providing transactions many times quicker and cheaper than are currently the norm makes blockchain the perfect decentralized system. It gives every person the opportunity to be a successful investor, whereas a classical banking system limits investment options to just a small circle of well-funded individuals. InoCoin works both for startups and for investors. We strive for win-win deals. Every successful startup is a win both for investors and for InoCoin.\n\nINO coin is a utility token that will pave the way to the future of crowdfunding. Unlike most other platforms, it is also a universal payment tool and, apart from investing in and funding various projects, it will also act as a currency that allows people to take advantage of the innovations which are being developed thanks to it. After investing in INO, for example, you can receive smart services and all kinds of products from the projects you support. Ino Coin is the global platform for funding and guiding prospective young blockchain projects to success.\n\nIt’ s backed by a variety of people with extensive technical and business skills– a team that will share advice and provide constant direction to young teams in addition to providing funds.It’ s a unique decentralized system for joint decision making between the lead team, project representatives and all investors and owners of the currency.Share knowledge, ideas and shares through InoCoin.","developer_score":12.0,"id":"ino-coin","image":{"large":"https://assets.coingecko.com/coins/images/4096/large/inologo.jpg?1547039275","small":"https://assets.coingecko.com/coins/images/4096/small/inologo.jpg?1547039275","thumb":"https://assets.coingecko.com/coins/images/4096/thumb/inologo.jpg?1547039275"},"links":{"bitcointalk_thread_identifier":3160994,"blockchain_site":["https://enjinx.io/eth/token/0xc9859fccc876e6b4b3c749c5d29ea04f48acb74f","https://etherscan.io/token/0xc9859fccc876e6b4b3c749c5d29ea04f48acb74f","https://ethplorer.io/address/0xc9859fccc876e6b4b3c749c5d29ea04f48acb74f"],"facebook_username":"InoCoin-352618868548773","homepage":["https://inocoin.eu"],"repos_url":{"github":["https://github.com/InoCoin/ino-client"]},"telegram_channel_identifier":"IniCoin","twitter_screen_name":"inocoin2018"},"liquidity_score":1.0,"market_cap_rank":4676,"name":"Ino Coin","public_interest_score":30.236,"symbol":"ino","tickers":[{"base":"INO","market":{"identifier":"exrates","name":"Exrates"},"target":"BTC"},{"base":"INO","market":{"identifier":"exrates","name":"Exrates"},"target":"ETH"},{"base":"INO","market":{"identifier":"exrates","name":"Exrates"},"target":"USD"},{"base":"INO","market":{"identifier":"thetokenstore","name":"Token.Store"},"target":"ETH"}]}