{"address":"0xcB97e65F07DA24D46BcDD078EBebd7C6E6E3d750","coingecko_rank":50,"coingecko_score":54.216,"community_score":38.34,"description":"Bytom is a blockchain protocol for financial and digital asset applications. Using the Bytom protocol, individuals and enterprises alike can register and exchange not just digital assets (i.e. Bitcoin) but traditional assets as well (i.e. securities, bonds, or even intelligence data). Bytom’s mission is “to bridge the atomic [physical] world and the byte [digital] world, to build a decentralized network where various byte assets and atomic assets could be registered and exchanged.”\n\nBytom is an interactive protocol of multiple byte assets, to give it the proper title. Heterogeneous byte-assets (indigenous digital currency, digital assets) that operate in different forms on the Bytom Blockchain and atomic assets (warrants, securities, dividends, bonds, intelligence information, forecasting information and other information that exist in the physical world) can be registered, exchanged, gambled and engaged in other more complicated and contract-based interoperations via Bytom.\n\nWhile Ethereum’s SEC scrutinization as a possible security took the entire crypto market on a downturn in early 2018, Bytom voluntarily submitted to the SEC’s Howey Test and Bytom cryptocurrency was deemed not a security under its DAO watch. This one has potential to make an impact on the cryptocurrency market with low transaction fees, high tech Bytom blockchain technology and an interactive protocol of multiple byte assets that could mark it apart. A Bytom wallet is also on offer and can store plenty more than Bytom coins.","developer_score":66.228,"id":"bytom","image":{"large":"https://assets.coingecko.com/coins/images/1087/large/bytom.png?1547564390","small":"https://assets.coingecko.com/coins/images/1087/small/bytom.png?1547564390","thumb":"https://assets.coingecko.com/coins/images/1087/thumb/bytom.png?1547564390"},"links":{"bitcointalk_thread_identifier":1975390,"blockchain_site":["http://btmscan.com/","https://blockmeta.com/","https://btm.tokenview.com/","https://etherscan.io/token/0xcb97e65f07da24d46bcdd078ebebd7c6e6e3d750"],"homepage":["http://bytom.io/"],"repos_url":{"github":["https://github.com/bytom/bytom"]},"subreddit_url":"https://www.reddit.com/r/BytomBlockchain","twitter_screen_name":"Bytom_Official"},"liquidity_score":54.838,"market_cap_rank":44,"name":"Bytom","public_interest_score":26.927,"symbol":"btm","tickers":[{"base":"BTM","market":{"identifier":"allcoin","name":"Allcoin"},"target":"ETH"},{"base":"BTM","market":{"identifier":"qtrade","name":"qTrade"},"target":"BTC"},{"base":"BTM","market":{"identifier":"zb","name":"ZB"},"target":"BTC"}]}