{"address":"0xCc394f10545AeEf24483d2347B32A34a44F20E6F","coingecko_rank":2156,"coingecko_score":13.934,"community_score":6.904,"description":"Vault12 enables you to safeguard your cryptocurrencies, using a cryptographically secure network made up of trusted people and devices. Distributed, decentralized and serverless digital custody for all your cryptocurrency.\n\nVault12, Inc. created the Vault Guardian Token (VGT) to power all services and applications deployed on Vault Cryptostorage Platform. The VGT is intended to be used for the following purposes.\n\n• Owners can incentivize their Custodians by either offering direct, periodic payments or by accepting a smart contract from a professional custodian service. For example, let’s say Jon has five friends and family, casual Guardians. Jon will transfer 600 VGT tokens to his platform storage app and assign them to be paid as 10 tokens per month to each Custodian, during the upcoming year. Advanced payment options for professional custodian service will require Jon to accept smart contracts offered by these services.\n\n• Relay operators can establish a specific token charge policy for relay usage. For example, Jon connects to relays that offer higher speed an d guarantee 24/7 reliability in major countries. He transfers an additional 100 GTV tokens to his platform storage app and sets this amount as bandwidth budget for premium relays as 10 GTV per session.\n\n• Owners can pay for installation, monthly use and unlocking of additional functionality in Vault Platform Applications. The reference Vault12 mobile application will follow the same policy and will be fully accessible for VGT payments.","developer_score":0.0,"id":"vault12","image":{"large":"https://assets.coingecko.com/coins/images/4652/large/Vault12.jpg?1547039918","small":"https://assets.coingecko.com/coins/images/4652/small/Vault12.jpg?1547039918","thumb":"https://assets.coingecko.com/coins/images/4652/thumb/Vault12.jpg?1547039918"},"links":{"blockchain_site":["https://enjinx.io/eth/token/0xcc394f10545aeef24483d2347b32a34a44f20e6f","https://etherscan.io/token/0xCc394f10545AeEf24483d2347B32A34a44F20E6F","https://ethplorer.io/address/0xcc394f10545aeef24483d2347b32a34a44f20e6f"],"homepage":["https://vault12.com"],"telegram_channel_identifier":"vault12","twitter_screen_name":"_vault12_"},"liquidity_score":1.0,"market_cap_rank":963,"name":"Vault Guardian Token","public_interest_score":17.281,"symbol":"vgt","tickers":[{"base":"VGT","market":{"identifier":"switcheo","name":"Switcheo"},"target":"ETH"}]}