{"address":"0xcC0F027d49f48D8c5A996a18f0F9c1Ef7863FC86","coingecko_rank":null,"coingecko_score":0.0,"community_score":0.0,"description":"NUCLEAR (NCL) is payment media of cooperation contracts between companies and investors on NUCLAER PLATFORM which can also be tradable in other cryptocurrency exchanges. As a utility token, NUCLEAR (NCL) offers several features that can be applied in various sectors, such as :\n\n1. CONTRACT PAYMENT\nAnyone in the world can submit their company proposal to be listed on NUCLAER PLATFORM and explain more about their company or their company's funding needs. Team behind NUCLEAR PLATFORM will collaborate with experienced and highly qualified legal and economic experts, we will analyze the prospects of the submitted proposals. If the future of the company and has a good track record, Team will take part to connecting companies and investors, and for investors who have interseted only need made deposit of NUCLEAR (NCL) with the specified amount according to their ability.\n\n2. MAIN PAYMENT INSTRUMENT\nNUCLEAR (NCL) will be the main payment instrument for all transactions on NUCLAER PLATFORM. Funds withdrawn by company after the contract agreement or profit given by the company to investor will be NUCLEAR (NCL) with conversion of the real price of NUCLEAR (NCL) on the market at that time.\n\n3. AFFILIATE PROGRAM\nAll affiliate programs for NUCLAER PLATFORM promotions will be paid in NUCLEAR (NCL) so users of NUCLAER PLATFORM and the NUCLEAR (NCL) holder community are widespread.","developer_score":0.0,"id":"nuclear-platform","image":{"large":"https://assets.coingecko.com/coins/images/9764/large/EtjSdl3Q_400x400.png?1571607094","small":"https://assets.coingecko.com/coins/images/9764/small/EtjSdl3Q_400x400.png?1571607094","thumb":"https://assets.coingecko.com/coins/images/9764/thumb/EtjSdl3Q_400x400.png?1571607094"},"links":{"announcement_url":["https://medium.com/@nuclearcoin"],"blockchain_site":["https://etherscan.io/token/0xcc0f027d49f48d8c5a996a18f0f9c1ef7863fc86"],"chat_url":["https://t.me/nuclearcoinproject"],"facebook_username":"nuclearcoin","homepage":["https://nuclearplatform.com/"],"telegram_channel_identifier":"nuclearplatform","twitter_screen_name":"CoinNuclear"},"liquidity_score":0.0,"market_cap_rank":null,"name":"Nuclear Platform","public_interest_score":0.0,"symbol":"ncl","tickers":[{"base":"NCL","market":{"identifier":"cashpayz","name":"Cashpayz"},"target":"ETH"}]}