{"address":"0xCDdf98b53F8E4A02a3Dc20eF3B9751186f209aca","coingecko_rank":4692,"coingecko_score":4.328,"community_score":4.46,"description":"Previously, exchanges have received positive acclaim from users by launching a trade mining-type exchange token which paid fees in dividends, and this has become a significant source of bringing in more transaction amount. However, as time passed, most of the exchanges which launched exchange tokens have been difficulty attracting new members, and the transaction amount is not being brought in. On the other hand, the circulation supply keeps increasing through trade mining, which is causing depreciation in token price due to more supply than demand.\n\nQNC will be issued once through IEO(Initial Exchange Offering) and will never be generated anymore. The total supply shall be 1,000,000,000 and the issued price is 1 KRW. QNC will be traded on Coinfinit’s KRW market after the IEO ends. Through the Market Booster program, a portion of the circulation supply will be bought back at a ratio of the transaction fee and then burnt, which will over time, end up in the decrease of the absolute number of circulated tokens. This is to prevent a decrease in token valuation, which is a problem to all existing exchange tokens, and to maintain the upward price trend and consistently raise the QNC value.","developer_score":0.0,"id":"queen-coin","image":{"large":"https://assets.coingecko.com/coins/images/8953/large/Queen_Coin.png?1563771159","small":"https://assets.coingecko.com/coins/images/8953/small/Queen_Coin.png?1563771159","thumb":"https://assets.coingecko.com/coins/images/8953/thumb/Queen_Coin.png?1563771159"},"links":{"announcement_url":["https://medium.com/coinfinit-blog"],"blockchain_site":["https://etherscan.io/token/0xcddf98b53f8e4a02a3dc20ef3b9751186f209aca"],"homepage":["https://www.coinfinit.com/"],"telegram_channel_identifier":"coinfinit","twitter_screen_name":"coinfinit"},"liquidity_score":0.847,"market_cap_rank":4422,"name":"Queen Coin","public_interest_score":30.432,"symbol":"qnc","tickers":[]}