{"address":"0xD0a4b8946Cb52f0661273bfbC6fD0E0C75Fc6433","coingecko_rank":145,"coingecko_score":44.21,"community_score":40.615,"description":"STORM is an ERC20-compliant token which operates on the <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> blockchain. CEO, and co-founder, Simon Yu, evolved this digital currency from an app called BitMaker, he and co-founder, Calvin Hsieh, worked on in 2014. BitMaker allowed users to send money without transaction fees which was the main reason this app experienced high growth volumes. A new feature called BitTask was introduced which allowed users to trade their time and effort for trying out new products in exchange for <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a> or Ethereum. This feature is now the STORM Play App and has experienced massive growth since its launch in Feb 2017.\n\nThe vision the founders have for STORM is beyond just an ordinary Cryptocurrency. They aim to create a marketplace for decentralized marketplace for tasks which will be called the “Storm Market”. “The Storm Market will operate similar to the Apple App Store or the Google Play Store in that it will serve as a platform where Storm Makers and Storm Players can create and accept tasks using smart contracts powered and paid for with STORM tokens.” The team is confident of the success of the app as it strongly relies on the give and takes model. By completing relatively easy and enjoyable tasks, users can potentially earn quite a bit of STORM, Ethereum or even Bitcoin.\n\nStorm Market is targeting the freelancing industry around micro-tasks. Currently, there are identified competitors in the market like Upwork, Mechanical Turk, etc. which are circulating huge amount of money through their platform with existing inefficiencies that ultimately creates hurdles for the freelancers. They deduct huge amount from their users earning by charging 40% of transaction cost.  The Storm market is striving to resolve the problems by providing following benefits, such as as compared to traditional micro-task marketplaces, they will charge reduce transaction fees. Besides, they Eliminate the interruption of any middlemen between buyers and sellers.\n\nStorm Market is a gamified micro-task marketplace that enables users to earn by completing different tasks. The company is expanding its platform by creating decentralized storm market by incorporating blockchain technology. In storm market, people can use their skills and talents to accomplish various tasks and get good rewards for it in the form of tokens. In short, a company is aiming to operate decentralized platform where anyone can offer or engage in tasks by utilizing blockchain based smart contracts supported by tokens (ERC-20).\n\nCheck out <a href=\"https://www.coinbureau.com/review/storm-token/\">CoinBureau</a> for the complete review of Storm Token.","developer_score":38.473,"id":"storm","image":{"large":"https://assets.coingecko.com/coins/images/1369/large/storm.png?1548611119","small":"https://assets.coingecko.com/coins/images/1369/small/storm.png?1548611119","thumb":"https://assets.coingecko.com/coins/images/1369/thumb/storm.png?1548611119"},"links":{"bitcointalk_thread_identifier":2006999,"blockchain_site":["https://enjinx.io/eth/token/0xd0a4b8946cb52f0661273bfbc6fd0e0c75fc6433","https://etherscan.io/token/0xd0a4b8946cb52f0661273bfbc6fd0e0c75fc6433","https://ethplorer.io/address/0xd0a4b8946cb52f0661273bfbc6fd0e0c75fc6433"],"facebook_username":"stormtoken","homepage":["https://stormtoken.com/"],"repos_url":{"github":["https://github.com/StormX-Inc/crowdsale"]},"subreddit_url":"https://www.reddit.com/r/stormtoken","twitter_screen_name":"Storm_Token"},"liquidity_score":36.466,"market_cap_rank":195,"name":"Storm","public_interest_score":40.488,"symbol":"storm","tickers":[{"base":"STORM","market":{"identifier":"airswap","name":"AirSwap"},"target":"ETH"},{"base":"STORM","market":{"identifier":"chainex","name":"ChainEX"},"target":"BTC"},{"base":"STORM","market":{"identifier":"ddex","name":"DDEX"},"target":"WETH"},{"base":"STORM","market":{"identifier":"ethex","name":"Ethex"},"target":"ETH"},{"base":"STORM","market":{"identifier":"forkdelta","name":"ForkDelta"},"target":"ETH"},{"base":"STORM","market":{"identifier":"idex","name":"Idex"},"target":"ETH"},{"base":"STORM","market":{"identifier":"kyber_network","name":"Kyber Network"},"target":"ETH"},{"base":"STORM","market":{"identifier":"purcow","name":"Purcow"},"target":"BTC"},{"base":"STORM","market":{"identifier":"purcow","name":"Purcow"},"target":"ETH"},{"base":"STORM","market":{"identifier":"tokenjar","name":"TokenJar"},"target":"WETH"},{"base":"STORM","market":{"identifier":"wazirx","name":"WazirX"},"target":"INR"},{"base":"STORM","market":{"identifier":"wazirx","name":"WazirX"},"target":"USDT"},{"base":"STORM","market":{"identifier":"yobit","name":"YoBit"},"target":"BTC"}]}