{"address":"0xD1E10C37A27d95D95720291b1Dc6f12F74C71443","coingecko_rank":1851,"coingecko_score":15.15,"community_score":7.716,"description":"Cosmochain is a complementary Company-to-Consumer platform that connects cosmetics product users and content creators to cosmetics product suppliers, including cosmetics companies, OEM/ODM manufacturers, R&D centers, and distributors. Through this platform, the Cosmochain Team aims to solve the aforementioned unmet needs of both companies and customers. All data collected from platform participants are kept confidential in this customer-centered ecosystem. Those who contribute their scarce time and attention toward producing and curating contents for others are compensated with tokens and receive pro-rata ownership of the contents they create. On the other hand, cosmetics product suppliers are able to actualize a wide variety of “on-demand” services on the platform by utilizing API that Cosmochain provides.\n\nTwo different tokens and one internal virtual index make up the Cosmochain ecosystem: 1) The first token is an externally traded token called Cosmo Coin, 2) The second token as well as an index of contribution to the platform is Cosmo Power, which can be used to make payment within the platform and given out as rewards for activities, and 3) The one virtual index is called Cosmo Level. Cosmo Level, a reputation index, is designed to prevent abuse of power within the platform and can only be accumulated by actual activities and contribution. Having been assigned distinct roles within the Cosmochain platform, these three entities construct a healthy ecosystem.\n\n● The success of the Cosmochain platform lies in the active participation of users – where customers create reliable data after trying out various cosmetics products and sharing the experience with one another on the platform. As a result, Cosmochain has designed its own transparent and fair reward system based on Steemit’s incentive model.\n\n● The Cosmochain platform connects this user-created data to interested company participants and distributes the payment made by the company to customers as reward for use of the information. Through this reward system, Cosmochain aims to address two structural issues of social media-based platforms: 1) risk of inflation following the necessity of a long-term and great quantity of token issuance to grow the community, and 2) risk of decreasing attractiveness of contribution rewards after the inflation rate has been stabilized.\n\n● In addition, the Cosmochain platform aims to realize an upgraded tokenization model that brings the power back to its users by redistributing the following: (i) the right to display ads in a user’s viewing space, (ii) the right to access a personally curated Marketplace, and (iii) the right to share personal data to partake in a study or survey. Simply speaking, the Cosmochain platform will go beyond simply allowing users to share onedimensional personal information.\n\nAs such, Cosmochain serves the purpose of revolutionizing the cosmetics industry’s ecosystem by redistributing ownership and management authority of personal cosmetics data and contents to those in need, and through operations of transparent rewarding system for the redistribution of data.","developer_score":12.262,"id":"cosmo-coin","image":{"large":"https://assets.coingecko.com/coins/images/5252/large/cosmo-coin.png?1547040742","small":"https://assets.coingecko.com/coins/images/5252/small/cosmo-coin.png?1547040742","thumb":"https://assets.coingecko.com/coins/images/5252/thumb/cosmo-coin.png?1547040742"},"links":{"announcement_url":["https://medium.com/@Cosmochain"],"blockchain_site":["https://enjinx.io/eth/token/0xd1e10c37a27d95d95720291b1dc6f12f74c71443","https://etherscan.io/token/0xd1e10c37a27d95d95720291b1dc6f12f74c71443","https://ethplorer.io/address/0xd1e10c37a27d95d95720291b1dc6f12f74c71443"],"facebook_username":"cosmochain","homepage":["https://cosmochain.io/"],"repos_url":{"github":["https://github.com/cosmochain/CosmoCoin"]},"telegram_channel_identifier":"cosmochain_english","twitter_screen_name":"cosmochain"},"liquidity_score":32.927,"market_cap_rank":5378,"name":"Cosmo Coin","public_interest_score":35.705,"symbol":"cosm","tickers":[{"base":"COSM","market":{"identifier":"coinone","name":"Coinone"},"target":"KRW"}]}