{"address":"0xd32641191578Ea9b208125dDD4EC5E7B84FcaB4C","coingecko_rank":4573,"coingecko_score":4.837,"community_score":3.461,"description":"The MDsquare team combines the block chain technologies that are central to the fourth industrial revolution with the remote health care platform, and connects the self-healthcare management tools with the remote health monitoring service, AI medical chatbot service and translation solution to make it more convenient, safe and economical. It enables Global medical services, which allow patients to meet with healthcare providers and receive health care at lower cost within a remote healthcare platform that crosses time, physical, and linguistic barriers.\nIt is also possible to maintain high security of the personal health information data registered or generated within the platform and to check the integrity of the health data to resolve issues such as falsifying or hacking increasing the reliability of the data.\n\nTMED remote health care platform will enable medical institutions to effectively utilize medical resources to provide health care beyond the time, physical distance constraints. This has the effect of expanding the medical market. Healthcare providers will be able to perform medical activities outside of the clinic, thereby expanding the scope of their activities and increasing the freedom of their activities, causing the current highly centralized system, to be partially decentralized. It also improves the disproportionate distribution of health resources concentrated in developed countries so that people in the Third World, a vulnerable region of health care, can receive high-quality medical care, thereby contributing to disease eradication and recovery.\n\nMDsquare team has built its own economically sustainable remote Health Care Platform using Ethereum to create their Token (TMED) for a Tokenized Economy Ecosystem to ensure that those who build and participate in the platform can receive and receive fair financial rewards for their activities. In addition, by enabling the use of TMED in actual offline hospitals, it is possible to connect the online platform to offline health care institutions and to guarantee and extend the value of the TMED.\n\nUsers are rewarded for storing and disclosing their health information, medical history, from self- tracking health devices that are associated with the platform. Healthcare providers can meet patients on the platform and provide remote video based medical services / offer monitoring-services based on personal health information / offer medical knowledge content thereby receiving financial rewards. These rewards will give incentives to platform participants to promote a plat-form that enables a sustainable economic ecosystem. The funds raised from some of the token used on the platform will be aimed at helping with disease eradication and providing health care services in developing countries and other vulnerable areas. TMED telemedicine platform will enhance the health of individuals and by extension it will enhance the health of the whole world.","developer_score":0.0,"id":"mdsquare","image":{"large":"https://assets.coingecko.com/coins/images/8558/large/bAdnHTWUIl4rFB4EfbH2L50BW7xi2T9ubci7v6xfYDipXkrG8Wb4LS8g6eAiMsSKqLJfV-FjH5TrYALqACw4MM2A9NfK_L6Ujnddhw1uEgL0hmVQnY96xZeL0C4kkFRJalreK9wUBzjZ4pRhZLdQf9h1drSTF7NE9moAdQ7KtuOvJqommn_q-TjQpF8GUB7J2Ejs7zIvhXXsUHGI1.jpg?1559198882","small":"https://assets.coingecko.com/coins/images/8558/small/bAdnHTWUIl4rFB4EfbH2L50BW7xi2T9ubci7v6xfYDipXkrG8Wb4LS8g6eAiMsSKqLJfV-FjH5TrYALqACw4MM2A9NfK_L6Ujnddhw1uEgL0hmVQnY96xZeL0C4kkFRJalreK9wUBzjZ4pRhZLdQf9h1drSTF7NE9moAdQ7KtuOvJqommn_q-TjQpF8GUB7J2Ejs7zIvhXXsUHGI1.jpg?1559198882","thumb":"https://assets.coingecko.com/coins/images/8558/thumb/bAdnHTWUIl4rFB4EfbH2L50BW7xi2T9ubci7v6xfYDipXkrG8Wb4LS8g6eAiMsSKqLJfV-FjH5TrYALqACw4MM2A9NfK_L6Ujnddhw1uEgL0hmVQnY96xZeL0C4kkFRJalreK9wUBzjZ4pRhZLdQf9h1drSTF7NE9moAdQ7KtuOvJqommn_q-TjQpF8GUB7J2Ejs7zIvhXXsUHGI1.jpg?1559198882"},"links":{"announcement_url":["https://medium.com/@mdsquare","https://steemit.com/@mdsquare"],"bitcointalk_thread_identifier":4459217,"blockchain_site":["https://etherscan.io/token/0xd32641191578ea9b208125ddd4ec5e7b84fcab4c"],"facebook_username":"tmedtoken","homepage":["https://mdsqr.io/"],"subreddit_url":"https://www.reddit.com/r/MDsquare/","telegram_channel_identifier":"mdsqr"},"liquidity_score":7.419,"market_cap_rank":3402,"name":"MDsquare","public_interest_score":24.882,"symbol":"tmed","tickers":[]}