{"address":"0xd4fa1460F537bb9085d22C7bcCB5DD450Ef28e3a","coingecko_rank":499,"coingecko_score":29.341,"community_score":9.138,"description":"Populous is a peer-to-peer invoice platform founded in 2017 at a high point in the blockchain and cryptocurrency craze. It makes use of blockchain's distributed ledger technology to provide a global trading platform for invoice financing. According to the Populous website, \"invoice finance is a form of funding that instantly unlocks the cash tied up in outstanding sales invoices. Business owners allow invoice buyers to buy invoices at a discounted rate in order to unlock their cash quicker. Once invoices are paid by the invoice debtor, the invoice buyer receives the amount previously agreed upon.\"\n\nIn order to offer funds to invoice sellers, Populous maintains a Liquidity Pool. This is tied in with the Populous cryptocurrency (PPT). An investor securitizes PPT by making an initial purchase. PPT is then held in escrow as collateral throughout the process. Transactions between invoice buyers and sellers take place with Pokens, exchanged for PPT and used as the currency for buying and selling invoices, either drawing from or contributing to the Liquidity Pool in the process. As a result of this built-in liquidity component, Populous at this point requires no transaction fees. In fact, the only fees levied are those associated with late payments. Populous invoice transactions can cover a huge array of industries, including many which are not typically available to traditional financing companies.\n\nThe PPT tokens not released during the ICO were retained by the founding and development team. PPT can either be held or used as collateral to invest in Populous invoices. In exchange for collateralizing, you’re given an amount of Pokens based on a percentage of market value. Currently it’s the lesser of 50%, or a 30 day market average. These are automatically used to purchase an invoice. If the invoice is repaid, you receive both your PPT investment and Pokens profit.","developer_score":12.0,"id":"populous","image":{"large":"https://assets.coingecko.com/coins/images/753/large/populous.png?1548331905","small":"https://assets.coingecko.com/coins/images/753/small/populous.png?1548331905","thumb":"https://assets.coingecko.com/coins/images/753/thumb/populous.png?1548331905"},"links":{"bitcointalk_thread_identifier":1866936,"blockchain_site":["https://enjinx.io/eth/token/0xd4fa1460f537bb9085d22c7bccb5dd450ef28e3a","https://etherscan.io/token/0xd4fa1460f537bb9085d22c7bccb5dd450ef28e3a","https://ethplorer.io/address/0xd4fa1460f537bb9085d22c7bccb5dd450ef28e3a"],"homepage":["https://populous.world"],"repos_url":{"github":["https://github.com/bitpopulous/populous-smartcontracts"]},"twitter_screen_name":"bitpopulous"},"liquidity_score":36.824,"market_cap_rank":142,"name":"Populous","public_interest_score":35.779,"symbol":"ppt","tickers":[{"base":"PPT","market":{"identifier":"forkdelta","name":"ForkDelta"},"target":"ETH"},{"base":"PPT","market":{"identifier":"idex","name":"Idex"},"target":"ETH"},{"base":"98385941-89B3-45C2-AE8E-B64C6F3BBAC9","market":{"identifier":"lykke","name":"Lykke"},"target":"ETH"},{"base":"PPT","market":{"identifier":"okex","name":"OKEx"},"target":"USDT"},{"base":"PPT","market":{"identifier":"p2pb2b","name":"P2PB2B"},"target":"USDT"},{"base":"PPT","market":{"identifier":"yobit","name":"YoBit"},"target":"BTC"}]}