{"address":"0xD8002cD05d5B2a85557e1CAAa179cC2408D5ad42","coingecko_rank":5076,"coingecko_score":4.001,"community_score":5.437,"description":"BINGO - the World’s First Blockchain Pan-Entertainment Platform which takes blockchain as core technology - supports Crypto currency and integrates several features such as: Social, Game, Advertising, Decentralized Data Analysis System, Fairness verifying modules, BINGO Foundation and others to become a multi-functional pan-entertainment Platform. BINGO has been recommended by many experts in the blockchain industry, including but not limited to: PATRICK DAI (SHUAI CHU) - Co-Founder of QTUM; Dr. Ma Zhao F. - Postdoctor of Tsinghua University, IEEE Member, ACM member, the lead of the blockchain technology team in Beijing, China. As the technology consultant for BINGO, Mob Arts is invested by China’s IT industry giant TENCENT and has the million-dollar experience in APP developing and publishing, NEXON has been authorized to publish one of their star products and received huge success. What’s more, BINGO also developed the first Crypto-currency game with specific game play QTUM HEROES together with QTUM, and thus starts their deep cooperation era.\n\nBiNGO is the first pan-entertainment platform to operate on a blockchain. It applies decentralization principles to heavy user aggregation and gameplayer communications, creating a new generation of entertainment platforms. The project is composed of a Customer Management System, the BiNGO Wallet, a Traffic Exchange System, a Decentralized Data Analysis System, and the BiNGO Foundation.\n\nThe success of the BiNGO Platform will be dependent on offering users a wide range of world-class games and entertainment. MobArts, as technical partner and an award-winning game publisher, has a history of releasing top-tier games that have been downloaded more than a hundred million of times and consistently ranked in the top 10 on Apple's App Store and the Google Play Store.\n\nBingo is essentially a game store, much like the App Store or Google Play. However, instead of using traditional currencies, it uses a coin native to the Bingo ecosystem called 777 that can be securely stored in, or traded between, Bingo wallets. All that is needed for game development, publishing, or for making game payments are the Bingo platform and the Bingo wallet.BINGO promises to offer game publishers and developers low barriers to entry, fair and fast access to a wide market of players, and the ability to quickly and easily monetize their offerings. In addition to all of the above, the Bingo ecosystem is working to combine social, advertising, analytics, and other modules to offer all users a truly comprehensive, pan-entertainment system that caters to all their needs.\n\nThis specific market segment is one that is expected to grow substantially in the years to come. With blockchain technologies promising to bring about a revolution in the way we do everything, Bingo, with a talented tech team behind it and a game industry visionary at the helm, is poised to completely redefine online games.","developer_score":0.0,"id":"777-bingo","image":{"large":"https://assets.coingecko.com/coins/images/3802/large/777-bingo-logo.jpg?1547038880","small":"https://assets.coingecko.com/coins/images/3802/small/777-bingo-logo.jpg?1547038880","thumb":"https://assets.coingecko.com/coins/images/3802/thumb/777-bingo-logo.jpg?1547038880"},"links":{"announcement_url":["https://medium.com/777bingo"],"bitcointalk_thread_identifier":3069984,"blockchain_site":["https://etherscan.io/token/0xd8002cd05d5b2a85557e1caaa179cc2408d5ad42","https://ethplorer.io/address/0xd8002cd05d5b2a85557e1caaa179cc2408d5ad42"],"chat_url":["https://open.kakao.com/o/gqEhL5G","https://open.kakao.com/o/gveiWlM"],"facebook_username":"777BingoPlatform","homepage":["https://www.bingo.fun/"],"telegram_channel_identifier":"bingo777","twitter_screen_name":"Bingo_Platform"},"liquidity_score":1.0,"market_cap_rank":2953,"name":"777.Bingo","public_interest_score":24.418,"symbol":"777","tickers":[{"base":"777","market":{"identifier":"bit_z","name":"BitZ"},"target":"ETH"}]}