{"address":"0xD9A1FE8b4d6De4F41c8A1b6AD3B6457916e546b4","coingecko_rank":4060,"coingecko_score":5.552,"community_score":6.839,"description":"FORTE COIN (FOTC) is a Cryptocurrency that is blockchain and ethereum based. It can be exchange with other Cryptocurrencies like bitcoin and other currencies when it gets to the exchange market. Apart from using the coin to buy and sell, it can also be used for payment of services such as real estate companies, clearing and forwarding agents, payment of rental and many more.\n\n\nFORTE COIN (FOTC) is also a travellers coins, it can be used to pay for hotel reservation, resort and transportation no matter where you are. FORTECOIN (FOTC) is also a pension coin. Imagine using 20% of your monthly Salary to buy our coin and then keep in the blockchain to plan for your retirement.\n\nWHAT HAPPENS TO YOUR MONEY AFTER SOME YEARS?\nYour retirement savings are totally safe via the blockchain technology. The Value that the coin worth years back will increase beyond expectation. You can exchange those coin to USD and other local Currencies at when you need a fiat currency.\n\nForte coin (FOTC) represents the community of buyer's and sellers of goods, services providers, travellers and tourists. We intend to use our merchant website in making life better and cheaper for everyone by connecting manufacturing and dealers to their customers all over the world using our block chain technology. Purchase of all goods and payment of services will be made using FORTE COIN (FOTC) and the acceptability of our coin shall be 100% by our Merchants.\n\n\nBENEFITS OF ACCEPTING OUR COIN\n\n\nMassive demand of your goods and services from our large community of over 2 Million coin holders.\n\nThe value of our coin will definitely increase because of the project behind our FORTE COIN (FOTC).\n\nPayment of your goods or services will be made by the customers before delivery.\n\nOur coin can be exchanged to other Cryptocurrencies including other fiat currencies like US dollars, China Yen and other currencies when listed on exchange.\n\nTransactions/payment are made and processed within minutes.\n\nOur POS can be used to make transactions easier.","developer_score":0.0,"id":"forte-coin","image":{"large":"https://assets.coingecko.com/coins/images/5841/large/fortecoin-logo.jpg?1547041723","small":"https://assets.coingecko.com/coins/images/5841/small/fortecoin-logo.jpg?1547041723","thumb":"https://assets.coingecko.com/coins/images/5841/thumb/fortecoin-logo.jpg?1547041723"},"links":{"announcement_url":["http://medium.com/@Fortecoinofficial"],"bitcointalk_thread_identifier":4678027,"blockchain_site":["https://etherscan.io/token/0xd9a1fe8b4d6de4f41c8a1b6ad3b6457916e546b4"],"facebook_username":"fortecoinbiz","homepage":["https://fortecoinbiz.com"],"twitter_screen_name":"FOTC17"},"liquidity_score":1.0,"market_cap_rank":4686,"name":"Forte Coin","public_interest_score":36.425,"symbol":"fotc","tickers":[{"base":"FOTC","market":{"identifier":"crex24","name":"CREX24"},"target":"BTC"}]}