{"address":"0xE0B7927c4aF23765Cb51314A0E0521A9645F0E2A","coingecko_rank":126,"coingecko_score":44.382,"community_score":37.78,"description":"Digix makes it possible to buy gold in an efficient manner via cryptocurrency by providing investors with a tokenized version of gold so you don’t have to physically own or store it. Digix has two cryptocurrencies, <a href=\"https://www.coingecko.com/en/coins/digix-gold\">Digix Gold (DGX)</a> and DigixDAO (DGD), each of which serves a key role in the structure.  The company proudly gets 99.99 percent of its gold from LBMA-approved refiners, with zero percent from fractional reserves, delivering confidence. With Digix, investors can take advantage of the stability and value of gold as well as the ease of cryptocurrency. Digix essentially tokenizes gold within Ethereum. It takes advantage of the Distributed Ledger’s immutability, auditability, and transparency, applying all these benefits to the precious physical asset of gold. Additionally, Digix has developed multiple technologies, such as the DGX tokens and <a href=\"https://www.coingecko.com/buzz/digixdao-introduces-gold-tokens-ethereum\">introduced a new Proof of Asset protocol</a> (POA).\n\nA key feature of Digix is its physical gold bullion. By investing, users buy bullion from the LBMA refineries, including the Assay Certificates from refiners like Nadir Bullion, PAMP Suisse, Valcambi, and others. For security, Digix includes third-party auditing from Bureau Veritas. Every quarter, it audits each gold asset within the safehouse vaults. This auditor has been in business since 1828 and is a world leader in certification, inspection, and testing services. With such a long track record, investors should be able to trust Bureau Veritas for their auditing services. Finally, Digix involves recast, which means customers can take their DGX delivery at the partnering custodial vault.\n\nDigix incorporated in Singapore in December 2014 and the DGD crowdsale took place on March 30th, 2016. It was the first ever crowdsale and major Distributed Autonomous Organization hosted on the <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> network. The sale intended to run for 30 days but met its 5.5 million dollars hard cap in just 12 hours, selling 1.7 million DGD tokens and reserving 300,000 for the Digix team. Pledges who sent over 15,000 USD worth of Ether received a special badge which will allow them to submit proposals to the DigixDAO. For better or worse, when you see the word DAO, you might think of hacking. In July 2017, over 4000 DGD were indeed stolen due to a vulnerability in the crowdsale smart contract. The bug was eventually fixed and the tokens reimbursed to the 35 affected addresses.\n\nIn January 2018, the vast majority of the cryptocurrency market crashed. DGD was the only coin in the top 100 to rise in value in that time. Perhaps this is an early indicator that people will seek gold as a safe haven during times of market uncertainty. The ICO price of DGD was about 3 dollars, but in 2018, DGD reached an all-time high of over 400 dollars. When Digix finally delivers the DGX tokens and the rewards to DGD participants start rolling in, we might see an even higher demand for DigixDAO. When DGX goes live, it will be available for purchase with Ether on the Digix marketplace.","developer_score":45.791,"id":"digixdao","image":{"large":"https://assets.coingecko.com/coins/images/397/large/dgd.png?1547034124","small":"https://assets.coingecko.com/coins/images/397/small/dgd.png?1547034124","thumb":"https://assets.coingecko.com/coins/images/397/thumb/dgd.png?1547034124"},"links":{"announcement_url":["https://medium.com/@Digix"],"bitcointalk_thread_identifier":1417151,"blockchain_site":["https://enjinx.io/eth/token/0xe0b7927c4af23765cb51314a0e0521a9645f0e2a","https://etherscan.io/token/0xe0b7927c4af23765cb51314a0e0521a9645f0e2a","https://ethplorer.io/address/0xe0b7927c4af23765cb51314a0e0521a9645f0e2a"],"chat_url":["https://discordapp.com/invite/CCDBJJC"],"homepage":["https://digix.global/"],"official_forum_url":["https://forum.bitcoin.com/alternative-cryptocurrencies-altcoins/digixdao-token-dgd-pre-launch-via-ccedk-acount-digixdao-t7120.html"],"repos_url":{"github":["https://github.com/DigixGlobal/cacp-contracts","https://github.com/DigixGlobal/dao-contracts","https://github.com/DigixGlobal/dijix"]},"subreddit_url":"https://www.reddit.com/r/digix/","twitter_screen_name":"digixglobal"},"liquidity_score":35.277,"market_cap_rank":104,"name":"DigixDAO","public_interest_score":29.474,"symbol":"dgd","tickers":[{"base":"DGD","market":{"identifier":"atomars","name":"Atomars"},"target":"USDT"},{"base":"DGD","market":{"identifier":"bigone","name":"BigONE"},"target":"BTC"},{"base":"DGD","market":{"identifier":"dextrade","name":"Dex-Trade"},"target":"USDT"},{"base":"DGD","market":{"identifier":"gate","name":"Gate.io"},"target":"ETH"},{"base":"DGD","market":{"identifier":"idex","name":"Idex"},"target":"ETH"},{"base":"DGD","market":{"identifier":"livecoin","name":"Livecoin"},"target":"ETH"},{"base":"DGD","market":{"identifier":"okex","name":"OKEx"},"target":"ETH"},{"base":"DGD","market":{"identifier":"uniswap","name":"Uniswap"},"target":"ETH"}]}