{"address":"0xE2b407160AAd5540eAc0e80338b9a5085C60F25B","coingecko_rank":1948,"coingecko_score":15.152,"community_score":35.888,"description":"GPN COIN is a coin for the gambling and pornography industry and the problem that we wish to solve is the fast transaction requirements that these types of websites have and also the Anonymous needs of the users and to achieve high speed transactions on the gambling and porn websites. Our Block chain will be anonymous and highly Secure in Order to insure all transactions will stay on the same GPN Network and the network will be anonymous and responsive between users. Each user will have an id number and users will not need to login with email or phone number or their name! Login and authentication will be with ID and password and GPN (Gambling Porn Network) accounts will be safe and anonymous for all users. Users that purchase GPN tokens will need to fill out a form and when we finish development of the wallet and block chain, users will login with their ID and password that they choose when they register in PRE ICO or ICO and they will see the coins that they purchased in the secure anonymous wallet. Our technology will be based on ERC 20 and we plan to start development when we finish the PRE ICO and ICO. GPN aims to create a Profit Sharing platform built on trust and reputation within the Gambling and Porn Network (GPN) ecosystem. Security is our first priority within our decentralized platform. We utilize the popular ERC 20 block chain technology allowing other developers to join seamlessly and without difficulty or concern. GPN contributes to redefining the core values of cryptocurrency in the present and future to generate positive changes in the way that crypto is viewed & adopted in the next 10 years. We need to raise 20 million dollars in total for our development project. Our goal is to sell the 240,000,000 Coins in ICO and Pre ICO. We will keep 60,000,000 to support the team, advisors and marketing companies. We are now in negotiation with more than 500 gambling and pornography companies and we already have several Ongoing Appriovals And commitments from companies to use GPN COIN As the Payment Method In Their Systems!","developer_score":12.941,"id":"gpn-coin","image":{"large":"https://assets.coingecko.com/coins/images/3316/large/gpn.png?1547037914","small":"https://assets.coingecko.com/coins/images/3316/small/gpn.png?1547037914","thumb":"https://assets.coingecko.com/coins/images/3316/thumb/gpn.png?1547037914"},"links":{"bitcointalk_thread_identifier":3071026,"blockchain_site":["https://etherscan.io/token/0xe2b407160aad5540eac0e80338b9a5085c60f25b"],"facebook_username":"gpncoin","homepage":["https://gpncoin.com/"],"repos_url":{"github":["https://github.com/gpncoin/gpncoinsmartcontract"]},"subreddit_url":"https://www.reddit.com/r/gpncoin","telegram_channel_identifier":"gpncoin","twitter_screen_name":"RBSWebsites"},"liquidity_score":1.0,"market_cap_rank":3485,"name":"GPN COIN","public_interest_score":27.449,"symbol":"gpn","tickers":[{"base":"GPN","market":{"identifier":"thetokenstore","name":"Token.Store"},"target":"ETH"}]}