{"address":"0xE3F4b4A5d91e5cB9435B947F090A319737036312","coingecko_rank":1283,"coingecko_score":21.023,"community_score":5.485,"description":"A creator-driven, blockchain-based ecosystem for content creation, distribution, and consumption\n\nPOPCHAIN is a bottom-driven open, public block chain. It is committed to building a block chain 3.0 with supporting services and rapid solutions in creative field. It focuses on block chains and key AI technology such as main node, POP domain name, side chain, consensus mechanism and smart contract.\n\nPOPCHAIN boasts solid business logic and eco-industrial carrying capacity. It helps enterprises for digital assets and fan economic operation. Consumption scenarios such as content distribution and scene services form an industrial digital asset operating cycle, providing copyright protection, content distribution, IP rights, big data, AI cloud brokerage and other supporting services.\n\nPOPCHAIN provides a friendly API that allows third-party developers to build their own applications (DAPP) on the basis of their open source protocols. POPCHAIN can be widely used in live broadcast, advertising delivery, code sharing, games and other fields. It revolutionizes and reshapes these areas, So that the center between entertainment developers and consumers no longer dominate resource and value transfer.","developer_score":18.864,"id":"popchain","image":{"large":"https://assets.coingecko.com/coins/images/4533/large/popchain-logo.png?1547039828","small":"https://assets.coingecko.com/coins/images/4533/small/popchain-logo.png?1547039828","thumb":"https://assets.coingecko.com/coins/images/4533/thumb/popchain-logo.png?1547039828"},"links":{"blockchain_site":["https://enjinx.io/eth/token/0xe3f4b4a5d91e5cb9435b947f090a319737036312","https://etherscan.io/token/0xe3f4b4a5d91e5cb9435b947f090a319737036312","https://ethplorer.io/address/0xe3f4b4a5d91e5cb9435b947f090a319737036312"],"chat_url":["https://t.me/popchain_cn","https://t.me/popchain_kr"],"homepage":["http://www.popchain.org/"],"repos_url":{"github":["https://github.com/PopchainOrg/PopChain"]},"telegram_channel_identifier":"popchain_kr","twitter_screen_name":"POPCHAIN_Global"},"liquidity_score":1.0,"market_cap_rank":392,"name":"Popchain","public_interest_score":25.375,"symbol":"pch","tickers":[]}