{"address":"0xE41d2489571d322189246DaFA5ebDe1F4699F498","coingecko_rank":33,"coingecko_score":58.002,"community_score":40.42,"description":"0x is an open protocol that is designed to offer a <a href=\"https://www.coingecko.com/en/coins/all?category_id=9\">decentralized exchange</a> as part of the <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> blockchain. 0x is made using a protocol that involves Ethereum smart contacts that allow those around the world to run a decentralized exchange. The team behind 0x strongly believes that in the future, you will find thousands of tokens from Ethereum and that 0x can provide an efficient and trustworthy way to exchange them.\n\n0x have several benefits such as it can be any asset. The 0x protocol facilitates the exchange of a growing number of <a href=\"https://www.coingecko.com/en?asset_platform_id=279&view=market\">Ethereum-based tokens</a> including currencies, game items, and many more digital assets. Besides, it has a networked liquidity. By sharing a standard API, relayers can easily aggregate liquidity pools, creating network effects around liquidity that compound as more relayers come online. 0x also can be exchanged anywhere. 0x allows trade functionality to fade into the background, enabling developers to focus on building while 0x handles the exchange.\n\nThe co-founders of 0x are Will Warren and Amir Bandeali, the first of which is the CEO and the second of which is the CTO. Both are in smart contract research and development. Warren used to conduct applied physics research at the Los Alamos National Laboratory after studying mechanical engineering at UC San Diego. Bandeali used to be a fixed income trader with DRW after he studied finance at the University of Illinois, Urbana-Champaign.\n\n0x doesn’t charge fees of any type to use their protocol; it is free. However, if someone chooses to create a decentralized cryptocurrency exchange using the protocol, that person, known as a Relayer, can charge fees.\n\nHow does it work?\n\n0x protocol works where : A “Creator” sends his request and at that same point the request is posted in an off-chain arrange/order book by the “Relayer”, next to which the request is acknowledged by the “Taker” by pushing the exchange into the task’s DEX smart contract. Thus, the 0x protocol uses off-chain order books, which is maintained by a relayer for settlement of trade between two parties. Relayers, being behind the maintenance and creation of these channels are incentivised by charging and collecting fees.\n\n0x (ZRX) Token:\n\nZRX token is the unique aspect of 0x project which will be used to pay ‘relayers the trading fees by the users of the protocol. It is also a governance token in a decentralized form for the 0x protocol’s upgrade.","developer_score":80.348,"id":"0x","image":{"large":"https://assets.coingecko.com/coins/images/863/large/0x.png?1547034672","small":"https://assets.coingecko.com/coins/images/863/small/0x.png?1547034672","thumb":"https://assets.coingecko.com/coins/images/863/thumb/0x.png?1547034672"},"links":{"announcement_url":["https://blog.0xproject.com/latest"],"blockchain_site":["https://enjinx.io/eth/token/0xe41d2489571d322189246dafa5ebde1f4699f498","https://etherscan.io/token/0xe41d2489571d322189246dafa5ebde1f4699f498","https://ethplorer.io/address/0xe41d2489571d322189246dafa5ebde1f4699f498"],"homepage":["https://0x.org/"],"official_forum_url":["https://forum.0xproject.com/"],"repos_url":{"github":["https://github.com/0xProject/0x-launch-kit","https://github.com/0xProject/0x-monorepo","https://github.com/0xProject/0x-starter-project","https://github.com/0xProject/ZEIPs"]},"subreddit_url":"https://www.reddit.com/r/0xProject","twitter_screen_name":"0xproject"},"liquidity_score":51.992,"market_cap_rank":53,"name":"0x","public_interest_score":32.199,"symbol":"zrx","tickers":[]}