{"address":"0xE48972fCd82a274411c01834e2f031D4377Fa2c0","coingecko_rank":297,"coingecko_score":33.059,"community_score":9.379,"description":"Protocol:   2nd Layer Protocol Embedding Smart Contracts and Economic Models into HTTP Links, enabling “SmartLinks”\nPlatform: “Social Sourcing” - incentivising formation of ad-hoc social networks that allow customers, fans and supporters to be compensated for helping businesses grow - finding target audiences that achieve business results.\n\n2KEY tokens are the blood that flows and drives the 2key network. They are a unit of value and a medium of exchange native to the 2key network and can be used in many ways, such as:\n\n1. 2KEY is the default reward for 2key SmartLinks referrers. When a referral chain leads to a conversion (purchase, booking, download, sign-in, donation, etc.), each person in that referral chain receives their share of the reward as defined in the smart contract.\n\n2. 2KEY scores both contractor and referrers’ participation and reputation on the network.\n\n3. 2KEY is the default token to pay the network integrators that provide services on the network for a fee.\n\n4. Staking 2KEY is required to activate specific campaigns that do not contain a referral reward.\n\n5.  2KEY is used to provision budgets for non-monetary conversion campaigns (PPC, Signup, Lead Generation, etc.)\n\n6. 2KEY will be engineered as the default staking and reward token once 2key Protocol is supplied as an SDK, and for 2key Multi-Party-State-Network technology (read more on our WhitePaper).","developer_score":59.223,"id":"2key","image":{"large":"https://assets.coingecko.com/coins/images/6090/large/2key.png?1591591830","small":"https://assets.coingecko.com/coins/images/6090/small/2key.png?1591591830","thumb":"https://assets.coingecko.com/coins/images/6090/thumb/2key.png?1591591830"},"links":{"announcement_url":["https://medium.com/2key"],"blockchain_site":["https://etherscan.io/token/0xe48972fcd82a274411c01834e2f031d4377fa2c0","https://ethplorer.io/address/0xe48972fcd82a274411c01834e2f031d4377fa2c0"],"chat_url":["https://t.me/twokey_vn"],"facebook_username":"2keyNetwork","homepage":["https://2key.network"],"repos_url":{"github":["https://github.com/2key/2key-subgraphs","https://github.com/2key/contracts"]},"telegram_channel_identifier":"twokey_official","twitter_screen_name":"2keyNetwork"},"liquidity_score":29.05,"market_cap_rank":664,"name":"2key.network","public_interest_score":0.005,"symbol":"2key","tickers":[]}