{"address":"0xe5874039ea940af0A0F304E512C48BCb8D25ACA4","description":"\"OTOCASH (OTO) is a Bitcoin base Token, OTOCASH will be a revolutionary payment platform that enables buyers to use their OTO Token in order to pay sellers (private or merchants). We provide sellers with the safety and convenience of receiving funds in fiat currency and offer the best consumer-protection to buyers.\n\nWorld's today, made the transactions through the existing financial system has imposed a high charge. Almost 90% of the financial system that exists today cost more than 2% fees and is apparently very costly to consumers. To solve this problem, OTOCASH will create an innovation payment platform that will charge only 0.5%. The advancement of blockchain technology enables this to be realised by using our advanced formulas.\n\nWhen you make payments and transactions to any seller or anyone in the world, you will always face currency exchanges issue; You will encounter significant depreciation and operating losses. OTOCASH platform will help us all overcome this problem by just setting the OTO Token to be used to deposit into our platform and can be converted into six major world currencies with lower charges. And money transfer or payment may be made by our API or use a Debit Card.\n\nBy creating an efficient system and platform for consumer help across the globe, it is doubtful that future affairs will be more fluent and become platforms that can be adapted to various forms of transactions and payments.\n\nWith only OTO tokens being the single cryptocurrency for our platform is undoubtedly the future value of this token will increase significantly. This is reinforced with just one hundred million OTO Tokens was created.\n\nUltimately, all investors, consumers, buyers, sellers and traders will have double profit and continuously. With low-cost casings and the prospect of increasing the token value then all of us will be more comfortable dealing with OTO Token and our platform\"","id":"otocash","links":{"announcement_url":["https://medium.com/@otocash.io"],"bitcointalk_thread_identifier":3015279,"blockchain_site":["https://otocashexplorer.info/","https://otocashexplorer.net/"],"chat_url":["https://discordapp.com/invite/Xunp5q5"],"homepage":["https://www.otocash.io/"],"repos_url":{"github":["https://github.com/otocash/OTOCASH"]},"telegram_channel_identifier":"otocashofficial","twitter_screen_name":"otocashofficial"},"name":"OTOCASH","symbol":"oto","tickers":[{"base":"OTO","market":{"identifier":"altilly","name":"Altilly"},"target":"BTC"},{"base":"OTO","market":{"identifier":"instantbitex","name":"Instant Bitex"},"target":"BTC"},{"base":"OTO","market":{"identifier":"raisex","name":"Raisex"},"target":"BTC"}]}