{"address":"0xE55CC44C0Cf9CEDE2d68f9432cBeeAfA6357ed92","coingecko_rank":5392,"coingecko_score":3.447,"community_score":2.211,"description":"Bflysoft has been delivering the digital news monitoring B2B service for the past 15 years. Doing this business, they were able to build their news industry specialized technologies such as AI, big data, natural language analysis, positivity&tendency context analysis, and more. 99% of Korean newspapers, magazines, and broadcasting companies like KBS, JTBC, etc have been in partnership with Bflysoft (more can be referred from here http://www.bflysoft.com/Partners.html#). Also, Bflysoft is one of the two corporations that can distribute and manage the legal copyrights of news content in South Korea. Within the 1,600 clients, Samsung, SK, CJ, Hyundai, and countless government offices are included (more can be referred from here http://www.bflysoft.com/Partners.html# ). Now with the knowhow and technologies they completed with their B2B news product, rozeus will be their new service for the B2C market, mainly focused on news content. Globally fake news and false information contents' problems are on most country's current regulation lists. Rozeus will design and offer a rational and fake-proof service along with a whole new level of user experience.","developer_score":0.0,"id":"rozeus","image":{"large":"https://assets.coingecko.com/coins/images/9917/large/vO7f-6gR_400x400.jpg?1573457563","small":"https://assets.coingecko.com/coins/images/9917/small/vO7f-6gR_400x400.jpg?1573457563","thumb":"https://assets.coingecko.com/coins/images/9917/thumb/vO7f-6gR_400x400.jpg?1573457563"},"links":{"announcement_url":["https://blog.naver.com/rozeus8","https://medium.com/rozeus"],"blockchain_site":["https://etherscan.io/token/0xE55CC44C0Cf9CEDE2d68f9432cBeeAfA6357ed92"],"facebook_username":"rozeuskr","homepage":["https://rozeus.com/"],"repos_url":{"github":["https://github.com/RozeusDevelopers/"]},"telegram_channel_identifier":"rozeus","twitter_screen_name":"rozeus2"},"liquidity_score":14.473,"market_cap_rank":2508,"name":"Rozeus","public_interest_score":0.0,"symbol":"roz","tickers":[]}