{"address":"0xe530441f4f73bDB6DC2fA5aF7c3fC5fD551Ec838","coingecko_rank":1081,"coingecko_score":21.478,"community_score":30.021,"description":"GSENetwork is committed to establishing a transparent and secure phenomenon-level decentralized credit network. With the help of the Internet of Things technology, the pass incentive system, and the composite pass economy design, smart contract services can be implemented through the sharing economy to achieve credit recovery and redefine classical sharing. The production relations of the participants in the economy build a credit-driven decentralized economic model.\n\nGSENetwork gathers and pieces together on-chain information about users to create the fundamental trust that these identities rely on to answer the more complex question - “What are you?”\n\nRedefining trust in the digital world\nGSENetwork maps each user’s digital footprint and behavior and translates that into an unique digital asset – trust. Unlike other platforms which recognize the user’s online identity as “Who are you?”, GSENetwork pieces together fundamental information about each user to reinforce trust as a multifaceted decentralized digital attribute.\n\nUse assets, earn tokens - Unlocking the way to mass adoption\nWhen green mining, an innovative incentive mechanism where users earn tokens for their usage of assets, are integrated into the real-world, it lowers the barrier to blockchain acceptance – the increased usage directly supplements the data brought on-chain for trust computations.\n\nUsing Internet of Things to enhance blockchain with connectivity\nLeveraging on IoT technology available on millions of smart devices worldwide, participants on GSENetwork can conveniently record their digital interactions securely on-chain to build their trust profiles from any part of the world.\n\nGSENetwork致力于建立一个透明和安全的现象级分散信用网络。借助物联网技术，通行激励体系和复合通行经济设计，通过共享经济实现智能合约服务，实现信用恢复，重新定义经典共享。参与经济的生产关系建立了信贷驱动的分权经济模式。\n\nGSENetwork将关于用户的链上信息汇集起来并拼凑在一起，以创建这些身份信赖的基础信任来回答更复杂的问题 - “你是什么？”。\n\n重新定义数字世界的信任\nGSENetwork可以映射每个用户的数字足迹和行为，并将其转换为独特的数字资产 - 信任。与其他认可用户在线身份为“你是谁？”的平台不同，GSENetwork将每个用户的基本信息拼凑在一起，以强化作为多方面分散数字属性的信任。\n\n使用资产，赚取代币 - 解锁大众采用的方式\n当绿色采矿（一种创新的激励机制，用户通过使用资产获得令牌）融入现实世界时，它降低了区块链接受的障碍 - 增加的使用直接补充了信任计算带来的数据链。\n\n使用物联网通过连接增强区块链\n利用全球数百万智能设备上可用的物联网技术，GSENetwork的参与者可以方便地在链上安全地记录他们的数字交互，从而建立来自世界各地的信任配置文件。","developer_score":0.0,"id":"gsenetwork","image":{"large":"https://assets.coingecko.com/coins/images/4776/large/gsenetwork.png?1547743285","small":"https://assets.coingecko.com/coins/images/4776/small/gsenetwork.png?1547743285","thumb":"https://assets.coingecko.com/coins/images/4776/thumb/gsenetwork.png?1547743285"},"links":{"announcement_url":["https://medium.com/@gselabofficial"],"blockchain_site":["https://enjinx.io/eth/token/0xe530441f4f73bdb6dc2fa5af7c3fc5fd551ec838","https://etherscan.io/token/0xe530441f4f73bDB6DC2fA5aF7c3fC5fD551Ec838","https://ethplorer.io/address/0xe530441f4f73bdb6dc2fa5af7c3fc5fd551ec838"],"facebook_username":"gsenetworkofficial","homepage":["https://gse.network"],"subreddit_url":"https://www.reddit.com/r/GSENetwork/","telegram_channel_identifier":"GSENetworkOfficial","twitter_screen_name":"gselabofficial"},"liquidity_score":1.0,"market_cap_rank":534,"name":"GSENetwork","public_interest_score":25.006,"symbol":"gse","tickers":[{"base":"GSE","market":{"identifier":"gate","name":"Gate.io"},"target":"ETH"}]}