{"address":"0xe760A89967d8C7Fa638eeBfC15A77BA107674021","coingecko_rank":4277,"coingecko_score":4.768,"community_score":8.787,"description":"Ziggurat token is a cryptocurrency used for internal payments in the Ecex.exchange platform.\n\nThe Ecex.Exchange Platform is an online blockchain technology-based assignments (claim, receivables, factoring agreements, divestiture of claims etc.) exchange platform, which shall provide to the User: (i) opportunities to sell and buy assignments, claims, receivables, and mediate insurance contracts, (ii) various support services related to the selling and buying through the exchange, and give users exercise right realize their own requirements regarding claims, (iii) opportunities to ensure the safety of assignments and using Ziggurat cryptocurrency for internal payments.\n\nPlanetZiggurat goal is to bring assignments on Ecex.Exchange trading platform. We will fill the gap by creating a market environment, the system for an active trading platform of assignment agreements. This means changing of owners of a multitude of agreements and documents, such as claims, invoices and factoring agreements all together assignments.\n\nThe regular thing what everybody trading is buy-sell agreement. It is very easy to understand, every investor can buy stock and he assumed that is happening behind the electronic market system, how the trade matching takes place and what is the consequences in account then the deals are finally ended.\n\nBut in the ecosystem which is mostly same as the stock market and built only for claims, rights, and receivables, operates on basis assignment agreement, there are great possibilities spread around the world and win the customers everywhere.\n\nPlanetZiggurat is aiming for 1 million trades per day by the end of the third year. Our revenue will come from services including: trading fees, issuer background check systems, digital signing, exchange member fees etc. The cash flow will be similar to stock exchange business. The only difference will be instruments and a set of agreements.\n\nZiggurat Tokens\n\nThe PlanetZiggurat shall grant to the User an opportunity to use the Ziggurat digital tokens to:\n\nopportunities to pay partly for service to sell and buy claims, receivables, and mediate insurance contracts,\nto pay partly various support services related to the selling and buying through the exchange, and give users exercise right to realize their own requirements regarding claims,\nZiggurat cryptocurrency grants the right to profit from up to 20% of Ecex.Exchange Trading Platform outcome, (distribution will be in cryptocurrency, in ethereum until otherwise decided),\nusing Ziggurat cryptocurrency for internal payments through the Ecex.Exchange Platform.\nThe smart-contract of the Ecex.Exchange Platform requires the Ziggurat digital tokens for its work. Only the owner of the Ziggurat digital tokens may purchase with discounts the services of the Ecex.Exchange Platform.","developer_score":0.0,"id":"ziggurat-token","image":{"large":"https://assets.coingecko.com/coins/images/4870/large/ziggurat-gold-coinSmall64.png?1547040284","small":"https://assets.coingecko.com/coins/images/4870/small/ziggurat-gold-coinSmall64.png?1547040284","thumb":"https://assets.coingecko.com/coins/images/4870/thumb/ziggurat-gold-coinSmall64.png?1547040284"},"links":{"bitcointalk_thread_identifier":2464508,"blockchain_site":["https://etherscan.io/token/0xe760a89967d8c7fa638eebfc15a77ba107674021"],"homepage":["https://ecex.exchange/"],"telegram_channel_identifier":"ZigguratICO","twitter_screen_name":"EcexExchange"},"liquidity_score":0.0,"market_cap_rank":5007,"name":"Ziggurat Token","public_interest_score":25.717,"symbol":"zig","tickers":[]}