{"address":"0xE8f030D3a6e82C84c73460B46a28016f3d744954","coingecko_rank":6522,"coingecko_score":0.25,"community_score":0.0,"description":"GEChain Gene Chain is a vertically applied public chain in the field of global genetic data, which is led by WEGE FOUNDATION LTD. It is a decentralized data storage and transaction network, which integrates distributed storage, consensus mechanism, encryption algorithm and other technologies to ensure the security of account data and assets. It solves the problems of unclear ownership, scattered data, high storage cost and unclear distribution of benefits in the field of genetic data, and ensures that users can control genetic data, access genetic data under the norms of intelligent contracts, and form a new ecological system on which the value of genetic data can be priced and circulated.\n\nWEGE FOUNDATION Ltd. is the world's first public welfare organization dedicated to promoting the scientific research and use of genetic data. The Foundation upholds the mission of \"Gene Data Benefits Human Beings\", carries out the development and construction of GEChain gene chain, advocates and promotes transparency in governance, and promotes the security of open source ecological society. Harmonious development. It is hoped that through GEChain, the ecological system will be gradually improved so that individual users, gene detection service providers, scientific research institutions, pharmaceutical enterprises and other enterprises can participate more conveniently and economically in the whole ecosystem and realize their respective values. It is also hoped that the world's largest genome data hub will be established worldwide so that gene data can be allowed by users. Large-scale, support precision medical treatment, precision health, life exploration, medical research and other scientific research related to the well-being of all mankind, ultimately to solve the genetic variation and inheritance caused by various diseases, improve personal health, benefit all mankind.","developer_score":0.0,"id":"gechain-token","image":{"large":"https://assets.coingecko.com/coins/images/9558/large/WOgX3Wr0motbYF-LzFmFsWygSH1nerQ8VP2KrkIrOO0oaenrjfECApOOzK6NlSrYjhOdWvYxtpvL416zvzC1XJ2UMw9jlk7tgtQKgYJwU4hCt93aXPdfb9SX_zerKJMnAMqJ_f7HbtAZijrf1Oo-pCYf2YLtkEGacgkWog2HCoI0OCmQzZwPFyRpGG4RkiyCvr0zC7yJ06JNpMR.jpg?1568838918","small":"https://assets.coingecko.com/coins/images/9558/small/WOgX3Wr0motbYF-LzFmFsWygSH1nerQ8VP2KrkIrOO0oaenrjfECApOOzK6NlSrYjhOdWvYxtpvL416zvzC1XJ2UMw9jlk7tgtQKgYJwU4hCt93aXPdfb9SX_zerKJMnAMqJ_f7HbtAZijrf1Oo-pCYf2YLtkEGacgkWog2HCoI0OCmQzZwPFyRpGG4RkiyCvr0zC7yJ06JNpMR.jpg?1568838918","thumb":"https://assets.coingecko.com/coins/images/9558/thumb/WOgX3Wr0motbYF-LzFmFsWygSH1nerQ8VP2KrkIrOO0oaenrjfECApOOzK6NlSrYjhOdWvYxtpvL416zvzC1XJ2UMw9jlk7tgtQKgYJwU4hCt93aXPdfb9SX_zerKJMnAMqJ_f7HbtAZijrf1Oo-pCYf2YLtkEGacgkWog2HCoI0OCmQzZwPFyRpGG4RkiyCvr0zC7yJ06JNpMR.jpg?1568838918"},"links":{"blockchain_site":["https://etherscan.io/token/0xe8f030d3a6e82c84c73460b46a28016f3d744954"],"homepage":["http://www.gechain.io/"],"telegram_channel_identifier":"GEChain_Global"},"liquidity_score":1.0,"market_cap_rank":null,"name":"GEChain Token","public_interest_score":0.993,"symbol":"ge","tickers":[{"base":"GE","market":{"identifier":"bitmart","name":"BitMart"},"target":"USDT"}]}