{"address":"0xEa11755Ae41D889CeEc39A63E6FF75a02Bc1C00d","coingecko_rank":371,"coingecko_score":34.002,"community_score":37.575,"description":"Cortex is built on a new public chain called Cortex. The chain includes AI algorithms that support smart contracts, which means anyone can use Cortex to add AI to their smart contracts. It also creates an incentive mechanism for collective collaboration, allowing anyone to submit and optimize models in Cortex, while model contributors can also be rewarded. The end result of Cortex, according to the whitepaper, is the creation of “artificial general intelligence”, or AGI, “being born on the Cortex”. Cortex completed a private token sale in February/March 2018 for its CTXC tokens. That funding round was led by Bitmain and FBG Capital, among other well-known investors in the cryptocurrency space.\n\nPlacing artificial intelligence systems on the blockchain isn’t a straightforward process. However, Cortex will solve this problem by allowing machine learning researchers around the world to upload well-trained corresponding data models to the storage layer of the Cortex public chain. Other users who need these AI models can make inferences using the models, then pay the person who developed those models. At each inference, a full node synchronizes the model and the data from the storage tier to the local site. Making an inference using Cortex’s unique virtual machine, or CVM, will synchronize the results to the whole network and then return the result. Every time a user initiates a transaction on the Cortex, opens a smart contract, or performs an intelligence inference, the user will need to pay a certain number of “Endorphin” tokens.\n\nEndorphin is the pricing unit for transactions on Cortex. However, the platform will have two tokens, including Endorphins and Cortex Coins (CTXC). The overall goal of Cortex is to provide state-of-the-art machine learning models on the blockchain where users can infer using smart contracts. Cortex also seeks to create a machine learning platform where users can post tasks on the platform or submit artificial intelligence-based decentralized apps.\n\nCortex’s token sale began with a single private placement round. That round took place from February 7 to March 7, 2018, during which tokens were sold at a price of 1 ETH = 1500 CTXC. In March 2018, the company announced that it had reached its target cap of 40,000 ETH for 60 million CTXC, or 20.01% of the total token distribution. FBG Capital and Bitmain were lead investors during the token sale. CTXC tokens are ERC20 tokens on the <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> blockchain. There’s a total supply of 299,792,458 tokens. Of the total supply, 50.03% (150 million) are reserved for Cortex coin miners as a mining reward, 24.95% (74,792,458) are dedicated to the project’s foundation from the genesis block (including 15.01% to the Cortex Lab, 9.01% to project marketing, and 0.93% to challenge bounties), with the remaining 5% going to advisors, academia, and the community from the genesis block.\nCortex aims to place advanced artificial intelligence systems on the blockchain. The company recently completed a private investment round during its token sale for CTXC tokens in February/March 2018. The next step is to roll out the Cortex public chain. Key features of the platform include its smart AI contracts and its Cortex Virtual Machine, both of which allow for advanced AI-based smart contract programming.","developer_score":51.767,"id":"cortex","image":{"large":"https://assets.coingecko.com/coins/images/3861/large/2638.png?1523930406","small":"https://assets.coingecko.com/coins/images/3861/small/2638.png?1523930406","thumb":"https://assets.coingecko.com/coins/images/3861/thumb/2638.png?1523930406"},"links":{"blockchain_site":["https://etherscan.io/token/0xea11755ae41d889ceec39a63e6ff75a02bc1c00d","https://ethplorer.io/address/0xea11755ae41d889ceec39a63e6ff75a02bc1c00d"],"homepage":["http://www.cortexlabs.ai/"],"repos_url":{"github":["https://github.com/CortexFoundation/Cortex_Release","https://github.com/CortexFoundation/ncnn"]},"subreddit_url":"https://www.reddit.com/r/Cortex_Official/","twitter_screen_name":"CTXCBlockchain"},"liquidity_score":37.855,"market_cap_rank":2142,"name":"Cortex","public_interest_score":40.953,"symbol":"ctxc","tickers":[{"base":"CTXC","market":{"identifier":"bgogo","name":"Bgogo"},"target":"BTC"},{"base":"CTXC","market":{"identifier":"bgogo","name":"Bgogo"},"target":"ETH"},{"base":"CTXC","market":{"identifier":"cointiger","name":"CoinTiger"},"target":"ETH"}]}