{"address":"0xeC8b363164Cf453BDaaDFAD4094B566dADA41F4D","coingecko_rank":4381,"coingecko_score":5.088,"community_score":9.266,"description":"Cryptonity is the combination of two words: Crypto and Community.\n\nSimple but strong and meaningful, our goal is to be an exchange that is respected by the Cryptocurrency Community. We aim at providing the most comprehensive, secure, transparent and collaborative exchange platform in the market.\n\nWe want to bring good vibes to the Crypto World, breaking with the ‘only profit’ policy of most exchanges.\n\nA Community centric trading platform\nInvolve the crypto community in the evolution of the platform to meet their needs and requests: features to be developed, coins to be listed, etc.\n\nResponsive multilingual customer service, low fees and fully transparent policy.\n\n“Forks”, “Airdrops”, “Staking Rewards” and “Masternode” features to be implemented.\n\nA comprehensive “Cryptosystem”\nProvide our users with the most ergonomic and performant trading tools.\n\nUsers who own our Cryptonity Token (XNY) to be granted with the lowest fees in the market.\n\nWe plan to develop our own Blockchain and a decentralised exchange with the participation of our community through a rewarded program.\n\nSecurity & Insurance\nProvide our users the most secure trading platform, working with the best security experts in the market, audited twice a year by independent security companies.\n\nFirst crypto exchange to provide an insurance to refund our users in case of losses","developer_score":0.0,"id":"cryptonity","image":{"large":"https://assets.coingecko.com/coins/images/7695/large/1.png?1549614203","small":"https://assets.coingecko.com/coins/images/7695/small/1.png?1549614203","thumb":"https://assets.coingecko.com/coins/images/7695/thumb/1.png?1549614203"},"links":{"blockchain_site":["https://etherscan.io/token/0xec8b363164cf453bdaadfad4094b566dada41f4d"],"facebook_username":"CryptonityExchange","homepage":["https://www.cryptonity.io/"],"telegram_channel_identifier":"CryptonityExchange","twitter_screen_name":"CryptonityEx"},"liquidity_score":1.0,"market_cap_rank":1920,"name":"Cryptonity","public_interest_score":25.712,"symbol":"xny","tickers":[]}