{"address":"0xeDF216B3C9748082C2d7F3F54EfE45B41076e3E1","coingecko_rank":5510,"coingecko_score":3.082,"community_score":0.0,"description":"As a first use-case, PEG is launching BUSD, a stable version of BNT (Bancor's Network Token) pegged to the US Dollar.\n\nWe chose to stress-test PEG by launching a stable version of BNT because Bancor represents a classic example of a cryptonetwork where users could greatly benefit from being able to contribute work (i.e., provide decentralized liquidity) using a stable token.\n\nWhile Bancor is best known as a mechanism for exchanging tokens, unlike most exchange tokens, BNT is not a token for traders. Rather, BNT is a token to facilitate liquidity. Users stake BNT in order to create Bancor liquidity pools or to contribute liquidity to existing pools. These pools — for example, Bancor's DAI pool is DAIBNT — utilize BNT as an \"intermediary\" token, stored within each pool, through which conversions are processed. Each conversion generates a fee for the pool's liquidity providers, in proportion to their respective contributions, creating an incentive for \"community-driven liquidity\".\n\nLooking forward, BUSD could be used to create new Bancor liquidity pools — for instance, a 'DAIBUSD' pool. In this way, BUSD would allow users to plug into Bancor pools and generate fees from conversions without direct exposure to BNT, potentially improving returns for liquidity providers.\n\nAs liquidity providers connect to Bancor through BUSD-based pools, more BNT would need to be bought and used as collateral, in order to mint the BUSD needed for such pools. BUSD-based pools could theoretically create even greater buying pressure on BNT than BNT-based pools. In short, BUSD demonstrates the potential of stable tokens to serve the needs of both speculators and real users.\n\nFollowing third-party audits of BUSD and feedback from the community, we are excited to expand the PEG Protocol to additional networks and blockchains, and to see PEG evolve as the de-facto framework for stable token creation and management.","developer_score":0.0,"id":"bancor-usd-token","image":{"large":"https://assets.coingecko.com/coins/images/9481/large/busd.PNG?1567997494","small":"https://assets.coingecko.com/coins/images/9481/small/busd.PNG?1567997494","thumb":"https://assets.coingecko.com/coins/images/9481/thumb/busd.PNG?1567997494"},"links":{"blockchain_site":["https://etherscan.io/token/0xedf216b3c9748082c2d7f3f54efe45b41076e3e1"],"homepage":["https://www.bancor.network/"],"repos_url":{"github":["https://github.com/zachdoty/peg-busd/"]}},"liquidity_score":1.0,"market_cap_rank":1893,"name":"Bancor USD Token","public_interest_score":28.825,"symbol":"busd","tickers":[]}