{"address":"0xedC87caB8bd12ca39088DeAF9fdfb63503f19f85","coingecko_rank":6248,"coingecko_score":1.685,"community_score":5.94,"description":"Universe Coin, the Solution That Every Business Has Been Looking For\n\n\nUniverse Coin is a Lisbon-based start-up whose project aims to make cryptocurrency payments easy through an innovative payment system.\nThus, among other things, the project includes a mobile app for users and a Point of Sale terminal for online and physical businesses, as well as a wallet app, usable in both physical stores and online shopping.\nUniverse Coin will allow merchants around the world to sell products and services in fiat currency, and buyers to pay for their purchases in cryptocurrency.\nThe key point of this innovative project is that the merchant receives proceeds in their local currency, even though the customer pays in cryptocurrency, as the payment system immediately converts the amount to be received to the chosen currency.\nAll this, quickly, simply, and completely free of charge to the merchant.\nThe great difference in their core business is the ease of cryptocurrency adoption for businesses. With Universe Coin, businesses don’t need to adapt their billing and accounting systems. Legal and fiscal concerns are also no longer a factor as transactions are effectively being made in fiat currency.\nThe “Universe Coin” Wallet app is now available on the Google Play Store, and will soon be coming to the App Store.\nEarly on in 2020, the start-up will release attractive affiliate and loyalty programs that are sure to get Universe Coin to the next level and launch their UNIS token, now trading on p2pb2b.","developer_score":0.0,"id":"universe-coin","image":{"large":"https://assets.coingecko.com/coins/images/10389/large/9lTQkX7d_400x400.jpg?1578868716","small":"https://assets.coingecko.com/coins/images/10389/small/9lTQkX7d_400x400.jpg?1578868716","thumb":"https://assets.coingecko.com/coins/images/10389/thumb/9lTQkX7d_400x400.jpg?1578868716"},"links":{"announcement_url":["https://medium.com/@universeecoin"],"blockchain_site":["https://etherscan.io/token/0xedc87cab8bd12ca39088deaf9fdfb63503f19f85"],"chat_url":["https://www.instagram.com/universecoin/","https://www.linkedin.com/company/universecoin/"],"facebook_username":"universeecoin","homepage":["https://www.universecoin.io/"],"subreddit_url":"https://www.reddit.com/r/UniverseCoin/","telegram_channel_identifier":"universcoin"},"liquidity_score":1.0,"market_cap_rank":5581,"name":"Universe Coin","public_interest_score":0.001,"symbol":"unis","tickers":[{"base":"UNIS","market":{"identifier":"p2pb2b","name":"P2PB2B"},"target":"USD"}]}