{"address":"0xf0Ee6b27b759C9893Ce4f094b49ad28fd15A23e4","coingecko_rank":415,"coingecko_score":32.969,"community_score":39.452,"description":"Enigma is a crypto platform that’s trying to solve the problem of privacy on the blockchain by giving them access to much-needed storage, privacy, and scalability. Enigma wants to extend Ethereum Smart Contracts by introducing secret contracts, a brand of smart contract that gives users an element of privacy that’s not intrinsic to current blockchain protocols. These contracts operate off-chain, meaning the execution of the Smart Contract doesn’t occur on the Ethereum blockchain itself. This is how the Enigma protocol works: it breaks up the Smart Contract and any related data into pieces, encrypts those pieces, and distributes them redundantly among Enigma nodes.\n\nEnigma has a protocol level. The Enigma privacy protocol allows for decentralized computation of sensitive data. It has a platform layer too. On this protocol, dozens of platforms such as data marketplaces and AI exchanges can be built. In its application layer, it enables thousands of truly decentralized apps that require private computation and secure data.Its first application is catalyst. Catalyst is the first application to be built on the Enigma protocol, already active with tens of thousands of users. Catalyst is a revolutionary platform for data-driven cryptoasset investing and research, built for professional crypto traders.\n\nEnigma has a team of MIT graduates, and they’ve been working diligently to ensure Enigma’s success. Guy Zyskind, Enigma’s CEO and cofounder, helped start the project while he was still a student at MIT. He has more than a decade of software development experience with an M.S. from MIT. Sandy Pentland, a well known MIT data scientist who gained fame for his work in data-mining social interactions, is Zyskind and Nathan’s adviser on Enigma. With other advisors such as Alex Pentland, who sits on the Advisory Boards for Google and Nissan, CEO of Abra, Bill Barhydt and director of MIT media lab, Prof. Alex Pentland, it is hard to difficult a fault in the team.","developer_score":0.0,"id":"enigma","image":{"large":"https://assets.coingecko.com/coins/images/1007/large/enigma-logo.png?1547034914","small":"https://assets.coingecko.com/coins/images/1007/small/enigma-logo.png?1547034914","thumb":"https://assets.coingecko.com/coins/images/1007/thumb/enigma-logo.png?1547034914"},"links":{"bitcointalk_thread_identifier":2052215,"blockchain_site":["https://enjinx.io/eth/token/0xf0ee6b27b759c9893ce4f094b49ad28fd15a23e4","https://etherscan.io/token/0xf0ee6b27b759c9893ce4f094b49ad28fd15a23e4","https://ethplorer.io/address/0xf0ee6b27b759c9893ce4f094b49ad28fd15a23e4"],"chat_url":["https://discordapp.com/invite/SJK32GY"],"homepage":["https://enigma.co/"],"repos_url":{"github":["https://github.com/enigmampc/enigma-contract","https://github.com/enigmampc/enigma-core","https://github.com/enigmampc/enigma-p2p"]},"subreddit_url":"https://www.reddit.com/r/EnigmaProject/","telegram_channel_identifier":"enigmacatalyst","twitter_screen_name":"enigmampc"},"liquidity_score":32.765,"market_cap_rank":119,"name":"Enigma","public_interest_score":31.409,"symbol":"eng","tickers":[{"base":"ENG","market":{"identifier":"bittrex","name":"Bittrex"},"target":"ETH"},{"base":"ENG","market":{"identifier":"crex24","name":"CREX24"},"target":"BTC"},{"base":"ENG","market":{"identifier":"gopax","name":"GoPax"},"target":"KRW"},{"base":"ENG","market":{"identifier":"livecoin","name":"Livecoin"},"target":"BTC"},{"base":"ENG","market":{"identifier":"livecoin","name":"Livecoin"},"target":"ETH"},{"base":"ENG","market":{"identifier":"upbit","name":"Upbit"},"target":"ETH"}]}