{"address":"0xf5B815344641412401d8e868790dBD125e6761Ca","coingecko_rank":3276,"coingecko_score":7.645,"community_score":8.98,"description":"Pecunio is a decentralized investment platform that solves the problem of crypto spending and allows safe and easy management of blockchain assets. The latest addition to our product portfolio is a gold-backed token: Pecunio will exchange physical gold in worldwide branches for tokens available as cryptocurrency on the blockchain. One Pecunio Gold Coin (PGC) represents exactly 1 gram of segregated, unallocated 999.9 fine gold from LBMA-approved refineries. Gold has always been the perfect hedge against volatility and will now be available in tokenized form as “Gold-2-Go”. In times of market turmoil, the PGC token will additionally be used as a tether, but with distinction to existent models of being asset-backed by real gold. The company’s first minimum viable product, the Pecunio cryptocurrency fund “PCC” was successfully launched on 4th of October 2017. It already generates real revenues and indicates the sincerity and mentality of the project before having an ICO. Pecunio was also elected preferred partner of ICONOMI, so the well-diversified and risk-adjusted portfolio is traceable on their platform too. What we offer: • GOLD-BACKED TOKEN One Pecunio Gold Coin (PGC) represents exactly 1 gram of fine gold • FUNDS By choosing a tokenized investment funds, we bring liquidity to markets, which are otherwise a highly illiquid environment. • MULTI-ASSET DEBIT CARD The prepaid debit card is a multi-asset card that enables easy crypto coin and token spenditure. Assets are managed via our mobile app or our customer-friendly platform. • FREE EXCHANGE We exchange major cryptocurrencies and will not charge any fees on behalf of exchanging on our platform. Full functionality of the exchange will be implemented after the ICO. • COMPANY TOKENS PCO tokens receive proceeds from three sources: The management-, the performance-, and the ICO fees. Our asset backed tokens will be designed similar to a tether backed with real gold.","developer_score":12.0,"id":"pecunio","image":{"large":"https://assets.coingecko.com/coins/images/2478/large/pco.png?1547036600","small":"https://assets.coingecko.com/coins/images/2478/small/pco.png?1547036600","thumb":"https://assets.coingecko.com/coins/images/2478/thumb/pco.png?1547036600"},"links":{"bitcointalk_thread_identifier":2461272,"blockchain_site":["https://etherscan.io/token/0xf5b815344641412401d8e868790dbd125e6761ca","https://ethplorer.io/address/0xf5b815344641412401d8e868790dbd125e6761ca"],"facebook_username":"PecunioFund","homepage":["https://www.pecun.io"],"repos_url":{"github":["https://github.com/pecunio-official/pco-token"]},"telegram_channel_identifier":"pecuniochat","twitter_screen_name":"Pecun_io"},"liquidity_score":0.0,"market_cap_rank":2177,"name":"Pecunio","public_interest_score":24.0,"symbol":"pco","tickers":[]}