{"address":"0xF84df2db2C87dd650641f8904aF71EbFC3ddE0Ea","coingecko_rank":3280,"coingecko_score":7.381,"community_score":5.253,"description":"YouLive's vision is to build the world's first truly decentralized live broadcast social platform through blockchain technology and to achieve real-time sharing, social and circle building with community-based autonomy, allowing all participants to directly obtain the value affirmation from each other in the ecosystem through subversive value recognition and value allocation mechanism.\n\nYouLive focuses on Influencers and Viewers, allowing the community participants’ payment and rewards to be fair, reasonable and free from exploitation in a decentralized and trustworthy way.\n\nYouLive will completely reshape the operating model of existing live broadcast industry and transform the economic incentive system itself into a system that can circulate within the system to create a completely decentralized community ecosystem. YouLive will be a completely open community ecosystem that transcends borders and has super communities with tens of millions / hundreds of millions of members, and each community participant can get the corresponding value expression.","developer_score":0.0,"id":"youlive-coin","image":{"large":"https://assets.coingecko.com/coins/images/6042/large/youlive.png?1547041988","small":"https://assets.coingecko.com/coins/images/6042/small/youlive.png?1547041988","thumb":"https://assets.coingecko.com/coins/images/6042/thumb/youlive.png?1547041988"},"links":{"blockchain_site":["https://etherscan.io/token/0xF84df2db2C87dd650641f8904aF71EbFC3ddE0Ea","https://ethplorer.io/address/0xf84df2db2c87dd650641f8904af71ebfc3dde0ea"],"facebook_username":"YouLiveOfficial","homepage":["http://www.youlive.io/"],"telegram_channel_identifier":"OfficialYouLive","twitter_screen_name":"OfficialYouLive"},"liquidity_score":18.127,"market_cap_rank":4457,"name":"YouLive Coin","public_interest_score":24.42,"symbol":"uc","tickers":[{"base":"UC","market":{"identifier":"bit_z","name":"Bit-Z"},"target":"ETH"}]}