{"address":"0xf8D1254FC324d2E75A5A37F5bD4CA34A20Ef460d","coingecko_rank":5081,"coingecko_score":4.013,"community_score":5.795,"description":"ADVC is a decentralized cryptocurrency based on Ethereum. The coin will become the main means of payment in a number of our online projects, which will further form a technological ecosystem.\nThe key development object is the international advertising platform Ad-country, which will allow businessmen to advertise their products and services to a solvent audience. Moreover, each owner of the ADVC cryptocurrency will receive a passive income due to the work of the platform. Up to 50% of the profits from the project will be reserved and monthly distributed among the owners of ADVC in proportion to the number of coins on your balance. The launch of the project will take place in August 2019.\t\nAt the end of 2019, the launch of a site for the exchange of fiat money and cryptocurrency is also planned. ADVC owners will be able to save up to 70% on paying currency exchange fees. Our coin is already represented on the CREX24 cryptocurrency exchange and has demand there. We managed to achieve a positive dynamics of ADVC due to the partnership with online advertising services that provide our customers with the opportunity to use our cryptocurrency for the transactions.","developer_score":0.0,"id":"advertisingcoin","image":{"large":"https://assets.coingecko.com/coins/images/8663/large/mB6sbPrt_400x400.png?1560158327","small":"https://assets.coingecko.com/coins/images/8663/small/mB6sbPrt_400x400.png?1560158327","thumb":"https://assets.coingecko.com/coins/images/8663/thumb/mB6sbPrt_400x400.png?1560158327"},"links":{"blockchain_site":["https://etherscan.io/token/0xf8d1254fc324d2e75a5a37f5bd4ca34a20ef460d"],"facebook_username":"ADVC-337566183550831","homepage":["https://advertisingcoin.io/"],"telegram_channel_identifier":"advertisingcoin","twitter_screen_name":"advcoin"},"liquidity_score":1.0,"market_cap_rank":5204,"name":"Advertisingcoin","public_interest_score":23.641,"symbol":"advc","tickers":[]}