{"address":"0xF970b8E36e23F7fC3FD752EeA86f8Be8D83375A6","coingecko_rank":112,"coingecko_score":47.077,"community_score":33.349,"description":"Ripio Credit Network (RCN) is a global peer-to-peer credit network based on cosigned smart contracts that facilitates connections between lenders and borrowers across the world, on any currency. It enables people across the globe to access credit, and to provide loans. The RCN token is a typical ERC-20 token. This protocol has the smart contract technology embedded into the <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> blockchain which facilitates peer-to-peer lending without the hefty transaction fees that are charged in traditional banking processes. The RCN token functions at the core of the system. The inherent value of the token is directly correlated to the demand for its use in the network.\n\nBased in Argentina, Latin America, Ripio was launched at the TechCrunch Disrupt in May 2016. Sebastian Serrano, founder and CEO of the Ripio Credit Network is a technology enthusiast. He along with his team of technology experts, analysts and developers have designed an impressive concept along with the website, whitepaper and its implementation within the last 2 years. The team comprises of David Garcia (SVP & Board Member), Eugenio Cocimano (Data Scientist), Antonio Ceraso (CTO & Lead Blockchain developer) and Agustin Aguilar (Smart Contracts Developer) among many others. Ripio started off with a primary objective - to democratize the digital economy in Latin America, by offering digital payment alternatives within everyone's reach in a region where 65% remain unbanked.\n\nThe smart contract is an integral part of the underlying technology of the Ripio Credit Network. It is generated by the Wallet Provider and executed when it is matched by the Credit Exchange. This smart contract contains information like the relevant credit terms, borrower obligations, events of default along with the signatures or verifications from all other agents. RCN tokens facilitate interaction with the smart contracts among different agents within the RCN. Every credit flow starts when the Borrower makes a credit request. The Borrower performs the request from its Wallet Provider, which has already integrated into the RCN protocol. Post this, the Borrower waits for an approval before any further action can be performed.","developer_score":69.866,"id":"ripio-credit-network","image":{"large":"https://assets.coingecko.com/coins/images/1057/large/ripio-credit-network.png?1548608361","small":"https://assets.coingecko.com/coins/images/1057/small/ripio-credit-network.png?1548608361","thumb":"https://assets.coingecko.com/coins/images/1057/thumb/ripio-credit-network.png?1548608361"},"links":{"bitcointalk_thread_identifier":2202647,"blockchain_site":["https://enjinx.io/eth/token/0xf970b8e36e23f7fc3fd752eea86f8be8d83375a6","https://etherscan.io/token/0xf970b8e36e23f7fc3fd752eea86f8be8d83375a6","https://ethplorer.io/search/0xf970b8e36e23f7fc3fd752eea86f8be8d83375a6"],"homepage":["https://ripiocredit.network/"],"repos_url":{"github":["https://github.com/ripio/rcn-network"]},"subreddit_url":"https://www.reddit.com/r/RipioCreditNetwork","telegram_channel_identifier":"RCNtalk","twitter_screen_name":"RCN_token"},"liquidity_score":30.15,"market_cap_rank":245,"name":"Ripio Credit Network","public_interest_score":26.438,"symbol":"rcn","tickers":[{"base":"RCN","market":{"identifier":"c2cx","name":"C2CX"},"target":"LONG"},{"base":"RCN","market":{"identifier":"c2cx","name":"C2CX"},"target":"USDT"},{"base":"RCN","market":{"identifier":"idex","name":"Idex"},"target":"ETH"},{"base":"RCN","market":{"identifier":"uniswap","name":"Uniswap"},"target":"ETH"},{"base":"RCN","market":{"identifier":"zb","name":"ZB"},"target":"USDT"}]}