{"address":"0xFA1a856Cfa3409CFa145Fa4e20Eb270dF3EB21ab","coingecko_rank":33,"coingecko_score":60.31,"community_score":51.326,"description":"IOST is building an ultra-high TPS blockchain infrastructure to meet the security and scalability needs of a decentralized economy. Led by a team of proven founders and backed by $40 million from world-class investors, including Sequoia and Matrix, IOST aims to be the underlying architecture for the future of online services.\n\nThe powerful consensus algorithm “Proof-of-Believability” enables next-gen transaction throughput speeds while ensuring nodes stay compliant, using factors including IOST token balance, reputation-based token balance, network contributions and user behaviors. A faster grade Byzantine Fault Tolerance mechanism, microstate blocks, Atomic Commit protocol and a dynamic sharding protocol (Efficient Distributed Sharding) all ensure transactions are safeguarded, consistent and lightning fast while reducing storage, configuration costs and processing power for validators.\n\nAnyone is able to participate in every layer of our system, from using services on our blockchain to running a node and validating transactions. Our rules and code are open for all to see and no preconditions will limit participation. IOST aims to fundamentally disrupt previous methods of business by creating a self-operated, trustless network that maximizes network value for all parties. The project places great emphasis on decentralized and secure ways of storing information. It also provides for Dapps and smart contracts, and anyone who is familiar with blockchain technology knows just how integral these two concepts have become.\n\nAdhering to the quintessential egalitarian values of blockchain technology, IOST is creating a censorship-resistant and trustless network that is open to all, using blockchain technology to cut out middlemen and maximize network value for all parties.\n\nTerrace Wang, Kimmy Zhong, and Ray Xiao, who are extremely brilliant, have co-founded the project. In addition to these original three, the project has 12 employees and 4 advisors. It is also worth noting that Ryan Bubiski, a co-founder of CodeAcademy and a winner of Times Most Influential People award plays a major role in the advisory board of the project. The team has partnered with about sixteen blockchain and cryptocurrency oriented companies such as Sequoia, Nirvana Capital, and DFund. The project, therefore, has strong investors.\"","developer_score":72.412,"id":"iostoken","image":{"large":"https://assets.coingecko.com/coins/images/2523/large/IOST.png?1557555183","small":"https://assets.coingecko.com/coins/images/2523/small/IOST.png?1557555183","thumb":"https://assets.coingecko.com/coins/images/2523/thumb/IOST.png?1557555183"},"links":{"announcement_url":["https://medium.com/@iostoken"],"blockchain_site":["https://explorer.iost.io","https://www.iostabc.com"],"facebook_username":"IOSTofficial","homepage":["http://iost.io/"],"repos_url":{"github":["https://github.com/iost-official/explorer","https://github.com/iost-official/go-iost","https://github.com/iost-official/iost-webapp"]},"subreddit_url":"https://www.reddit.com/r/IOStoken/","telegram_channel_identifier":"officialios","twitter_screen_name":"iostoken"},"liquidity_score":58.724,"market_cap_rank":54,"name":"IOST","public_interest_score":29.41,"symbol":"iost","tickers":[{"base":"IOST","market":{"identifier":"abcc","name":"ABCC"},"target":"ETH"},{"base":"IOST","market":{"identifier":"coineal","name":"Coineal"},"target":"ETH"},{"base":"IOST","market":{"identifier":"coinzest","name":"Coinzest"},"target":"ETH"},{"base":"IOST","market":{"identifier":"coinzest","name":"Coinzest"},"target":"KRW"},{"base":"IOST","market":{"identifier":"cryptaldash","name":"CryptalDash"},"target":"ETH"},{"base":"IOS","market":{"identifier":"ethfinex","name":"Ethfinex"},"target":"ETH"},{"base":"IOS","market":{"identifier":"ethfinex","name":"Ethfinex"},"target":"USD"},{"base":"IOST","market":{"identifier":"idex","name":"Idex"},"target":"ETH"},{"base":"IOST","market":{"identifier":"livecoin","name":"Livecoin"},"target":"ETH"},{"base":"ED8BDA69-EF3C-4862-B99A-32611C79E2CE","market":{"identifier":"lykke","name":"Lykke"},"target":"BTC"},{"base":"ED8BDA69-EF3C-4862-B99A-32611C79E2CE","market":{"identifier":"lykke","name":"Lykke"},"target":"ETH"},{"base":"IOST","market":{"identifier":"purcow","name":"Purcow"},"target":"ETH"},{"base":"IOST","market":{"identifier":"wazirx","name":"WazirX"},"target":"BTC"}]}