{"address":"0xFB1e5F5e984C28Ad7E228CDaA1F8A0919BB6a09B","coingecko_rank":4378,"coingecko_score":4.795,"community_score":7.637,"description":"Positioned as a ‘Green’ company, Galaxy eSolutions (GES) refurbishes pre-owned consumer electronic goods. GES operates as an open source ecosystem on a decentralized blockchain platform. It is a one-stop solution for simple and secure e-commerce transactions for anyone to use across the global markets. Users will be able to use GES tokens when purchasing products from our GES global marketplace for refurbished, pre-owned consumer electronics.\n\nGES has several strategic business units, including NDBD, Yabphones, and Mobile Freak. NDBD and Yabphones are centralized, and focused on selling, while Mobile Freak is a decentralized P2P buy-and-sell platform.\n\n▪ NDBD: Currently a B2C (Business-to-Consumer) site evolving to become a marketplace with approved suppliers.\n▪ Yabphones: A B2C and F2C (Factory-to-Consumer) site with own branding refurbished products.\n▪ Mobile Freak (mobilefreak.com): a site to be built on blockchain to serve the C2C (Consumer-to-Consumer), C2B (Consumer-to-Business) and B2B (Business-to-Business) refurbished markets.\n\nThe reason for this hybrid model is Galaxy eSolutions’ belief that in the B2C model, where it is sending goods to end consumers, the consistency in quality of goods and exceeding expectations are of utmost importance. This is a retail experience and only in a centralized model can Galaxy eSolutions fully control quality of supplied goods and consumer experience. However, Galaxy eSolutions believes that a blockchain, or decentralized model, would suit a marketplace serving the C2C, C2B and B2B markets. GES will use Mobilefreak.com for this decentralized model and only focus initially on the highly tradable pre-owned and refurbished phones.","developer_score":0.0,"id":"galaxy-esolutions","image":{"large":"https://assets.coingecko.com/coins/images/2079/large/ges.png?1547036388","small":"https://assets.coingecko.com/coins/images/2079/small/ges.png?1547036388","thumb":"https://assets.coingecko.com/coins/images/2079/thumb/ges.png?1547036388"},"links":{"announcement_url":["https://bitcointalk.org/index.php?topic=2852878"],"bitcointalk_thread_identifier":2852878,"blockchain_site":["https://etherscan.io/token/0xfb1e5f5e984c28ad7e228cdaa1f8a0919bb6a09b","https://ethplorer.io/address/0xfb1e5f5e984c28ad7e228cdaa1f8a0919bb6a09b"],"facebook_username":"GalaxyeSolutions","homepage":["https://galaxy-esolutions.com/"],"telegram_channel_identifier":"gesico","twitter_screen_name":"Galaxye_eSol"},"liquidity_score":1.0,"market_cap_rank":3161,"name":"Galaxy eSolutions","public_interest_score":26.858,"symbol":"ges","tickers":[]}